{
  "series": "Request for Comments",
  "number": "87",
  "howpublished": "RFC 87",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0087",
  "url": "https://www.rfc-editor.org/info/rfc87",
  "title": "Topic for Discussion at the Next Network Working Group Meeting",
  "pagetotal": "3",
  "year": "1971",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                                       A. Vezza\nRequest for Comments: 87                                    12 January 1971\nNIC 5632\n\n     TOPIC FOR DISCUSSION AT THE NEXT NETWORK WORKING GROUP MEETING\n     --------------------------------------------------------------\n\n     Project MAC is planning a network graphics meeting to be held in\n\nApril.  It would be desirable to devote some portion of the February\n\nUrbana meeting to consideration of the length, format, structure and\n\ncontents of the April meeting.  Perhaps discussion on topics germane\n\nto network graphics can be started in an informal way at Urbana.\n\n     Project MAC's present ideas about the length, structure, and\n\nformat of the network graphics meeting are as follows:\n\n   1)  The length of the meeting is expected to be two FULL days.\n\n   2) Each organization represented is expected to participate by\n\n   presenting one or more working paper(s) on one or more of the areas\n\n   chosen for discussion.  The working paper(s) will minimally consist of\n\n   a set of working notes and an oral presentation.  Who presents the\n\n   working paper for an organization, or how the labor is divided, is to\n\n   be determined by the organization.\n\n   3) The bulk of the two full days is to be used for the prepared oral\n\n   presentation with discussion after each presentation.  About three\n\n   hours at the end of the second day are reserved for open discussion.\n\n   This three hour period is to be used for critiquing this meeting,\n\n   planning the next one, and bidding for special assignments that\n\n   participating organizations might wish to undertake as a contribution\n\n   to the network graphics effort.\n\n\n\n                                                                [Page 1]\n\f\nOur ideas about content are:\n\n   1) A description of present or future graphical facilities that are or\n\n   will be connected to the network, with a functional description of how\n\n   they work or look (or might look) to a user (network user).\n\n   2) A functional description of a graphical facility one can envision\n\n   or would like to see the network support.\n\n   3) Proposals on network graphic protocol, even proposal which are only\n\n   intended to smoke out issues are acceptable.\n\n   4) A sharing of network graphic \"Historic Moments.\"  Description of\n\n   your experiences in network graphics, what problems were encountered,\n\n   how you solved or lived with them.  What insight and understanding\n\n   have you gained, what questions have been left unanswered by these\n\n   experiences?\n\n\nThe foregoing are our present ideas.  If you have suggestions, please\n\nconvey them to one of the people from your site attending the Urbana\n\nmeeting so they can be discussed, or notify either Fran Yost or me of\n\nyour suggestion by calling 617-864-6900-6026 or writing to:\n\n      Miss F. Yost\n      Project MAC/MIT\n      545 Technology Square, Room 830\n      Cambridge, Massachusetts 02139\n\nI hope we can come away from the Urbana meeting with a firm concept of\n\nthe April network graphic meeting.\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nI would like to ask each participating organization to bring to\n\nthe February meeting a list of its people who are actively engaged in\n\ngraphics with facilities that are or will be on the network.\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Phillip Jaenke 4/97]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n"
}