{
  "series": "Request for Comments",
  "number": "440",
  "howpublished": "RFC 440",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0440",
  "url": "https://www.rfc-editor.org/info/rfc440",
  "title": "Scheduled network software maintenance",
  "pagetotal": "1",
  "year": "1973",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                                    David C. Walden\nRFC #440                                                 BBN-NET\nNIC #13772                                               January 1973\nUpdates: 381,406\n\n\n                 Scheduled Network Software Maintenance\n                 --------------------------------------\n\n    As explained in RFC 381, we believe that we can minimize\nthe disruption caused by the release of new IMP software systems by\ndoing them on a regularly scheduled basis.  In the past we have\nreserved the one hour period from 7am until 8am every Tuesday morning\nfor our IMP system scheduled software maintenance period.  As the size\nof the network has grown to about forty IMPs, we find we can no longer\ncomplete a system release to all IMPs in the one hour scheduled.\nTherefore, we are extending our scheduled software maintenance period\nto two hours from 7am until 9am eastern time every Tuesday\nmorning. The extended period will take effect as of the first Tuesday\nin February.  As we said in RFC 381, we will not always use the\nTuesday morning period, but we always reserve it.  On Tuesday mornings\nwhen we _do_ use the scheduled software maintenance period, a type 2 IMP\nto Host message* will be sent to all Hosts about an hour in advance of\nthe period.\n\n    We understand that the software maintenance period cannot\ncontinue to grow linearly with the number of IMPs, and we will find a\nway around this problem before software releases start taking 168\nhours a week.\n\n\n\n*An IMP-GOING-DOWN-FOR-SCHEDULED-SOFTWARE-MAINTENANCE message.\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\nWalden                                                          [Page 1]\n\f\n"
}