{
  "series": "Request for Comments",
  "number": "173",
  "howpublished": "RFC 173",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0173",
  "url": "https://www.rfc-editor.org/info/rfc173",
  "title": "Network Data Management Committee Meeting Announcement",
  "pagetotal": "2",
  "year": "1971",
  "month": "jun",
  "body": "\n\n\n\n\n\nNetwork Working Group                          P. M. Karp - MITRE\nRequest for Comments #173                      D. B. McKay - IBM\nNIC 6795                                       4 June 1971\n\n\nCategories:  D.4, D.7\nObsoletes:   None\nUpdates:     None\n\n\n         Network Data Management Committee Meeting Announcement\n\nThe data management discussions at the recent NWG meeting resulted in\nthe formation of a Network Data Management Committee to be chaired by\nDoug McKay, IBM.  The purpose of the committee, as stated in RFC 146,\nis:\n\n      (a)  to classify the issues involved and to propose\n           various approaches;\n      (b)  to integrate the hitherto independent network\n           activities that address problems in the area of data\n           sharing; and\n      (c)  to set up and coordinate appropriate experiments\n           to test the services developed and to evaluate\n           alternative approaches.\n\nAn informal meeting was held Wednesday morning, 19 May to estab- lish an\napproach for achieving the above objectives.  The attendees were:\n\n         Peggy Karp           MITRE\n         Doug McKay           IBM\n         Tom O'Sullivan       Raytheon\n         Ari Ollikainin       UCLA\n         Dr. Larry Roberts    ARPA\n         Dick Winter          CCA\n\nDue to an overlap with a file transfer committee meeting, membership of\nthe data management committee was not established.\n\nA decision was made to hold a data management meeting at CCA in\nCambridge prior to the next general NWG meeting.  The structure and\nformat of the meeting will be similar to that of the network graphics\nmeeting (RFC 87); that is, the price of admission for an organization is\na working paper on one or more of the areas chosen for discussion,\naccompanied by an oral presentation.\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nThe meeting will provide an opportunity for varying viewpoints on\nnetwork data sharing to be expressed.  The essential issues will be\neduced, thus fulfilling the committee's objective (a).  Compre- hensive\nplans for attaining objectives (b) and (c) can then be established.  We\nexpect that responsibilities for carrying out objectives (b) and (c)\nwill be assumed by interested committee members.\n\nOne of the original objectives of the meeting was to elicit comments on\nthe data language for the data computer, following a presentation of\ndesign specifications by CCA.  Due to a change in scheduling at CCA,\nthey will discuss the facilities to be provided by the data computer\nrather than language itself.  Therefore meeting participants will have\nan opportunity to provide input to the language design which will be\nspecifically directed at provision of the facilities.\n\n   Some suggested topics for position papers are:\n\n      (a)  philosophical discussion on computer network\n           data sharing;\n      (b)  syntactic and semantic considerations for data\n           description and access languages;\n      (c)  approaches for the integration of data handling\n           services already available;\n      (d)  experimentation methodology for evaluating\n           alternative data sharing techniques;\n      (e)  information content and structure of a network\n           data directory; and\n      (f)  operational or control protocol.\n\nAny or all of the above topics can be addressed in a single paper.\nOther ideas for position paper topics can be gleaned from RFC #s 144 and\n146.  Many of the comments made at the data management session, 18 May,\nat the NWG meeting (RFC 164, pp. 26-29) can be expanded and expounded\nupon.\n\nPosition papers should be submitted ti Doug McKay by 16 July (received\nno later than 19 July).  A meeting agenda, copies of all submitted\npapers, and a background bibliography will be distributed to all\nparticipants by 23 July.  The meeting will be held at CCA, 565\nTechnology Square, Cambridge, Mass. from 2 August until 4 August.  All\nparticipants should contact Marty Ginsberg, CCA (617-491-3670) by 16\nJuly for hotel reservations.\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Simone Demmel 5/97 ]\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}