{
  "series": "Request for Comments",
  "number": "214",
  "howpublished": "RFC 214",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0214",
  "url": "https://www.rfc-editor.org/info/rfc214",
  "title": "Network checkpoint",
  "pagetotal": "2",
  "year": "1971",
  "month": "aug",
  "body": "\n\n\n\n\n\nNetwork Working Group                              21 August 1971\nRequest for Comments 214                           E. Harslem-Rand\nNIC 7195\nCategory: F\nObsoletes: 193, 198\n\n\n                            NETWORK CHECKOUT\n\n\n      As of August 21 we had performed the following verifications\nwith the sites listed below.  These verifications were done on an\narranged basis and do not indicate any degree of continuous\navailability.\n\n      In the category \"NCP-107\" the heading is somewhat misleading.\nIt does not indicate a thorough checkout of all the NCP functions\ndescribed in Document 1 and RFC-107.  It only indicates that the NCP\nin question functioned to the extent required to respond to a RESET (a\nnecessary condition for the Rand NCP to consider the remote host \"up\")\nand that the NCP performed the functions necessary for an ICP.  Thus,\nthis column really indicates only a small degree of NCP completeness.\nSuch function as ECHO, Give Back, error message generation and so on\nwere not checked.  We have checked some of these functions with UCSB\nand SDC but not exhaustively.  This is mainly due to the tedium of\nsuch a process.  BBN is currently writing a protocol certifier for\ntheir DDP-516 host that will do this automatically.\n\n                                  User   Server          Access\n               NCP-107  ICP-156  Telnet  Telnet  Logger  Service\nUCLA Sigma7      x        x        x       x       x       x\nUCLA /91         x        x        x       x       na      x\nSRI NIC          x        x                ?       ?       ?\nUCSB             x        x        x       x       na      x\nBBN A10          x        x                x       x       x\nBBN TIP          x        x        x       x               na\nMIT Multics      x        ?\nMIT DMCG         x        x        x       x       x       x\nSDC              x        x        x       x       ?\nLINCOLN /67      x        x        x       x       x       x\nUTAH             TENEX being installed\n\n\nLEGEND:\n\n --- the function has not been verified for the host\n\nx--- the function has been verified for the host\n\n\n\n                                                                [Page 1]\n\f\n21 Auguest 1971                                                  RFC 214\n\n\nna-- the function is not applicable to the host due to its\n     operating system or intended network use\n\n?--- a comment follows for that function in that host\n\n\nCOMMENTS:\n\nSRI NIC -- both a server telnet and logger exist; however, they\n           do not process the telnet messages correctly\n\nMIT Multics  -- we were only able to connect to an interim\n          logger that sent a 'ts' message\n\nSDC  -- the logger causes the system to crash following login\n\n\n      Any discrepancies should be noted via phone call.  This\nRFC will be updated in about one month.\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n          [ into the online RFC archives by Brian Court 6/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}