{
  "series": "Request for Comments",
  "number": "263",
  "howpublished": "RFC 263",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0263",
  "url": "https://www.rfc-editor.org/info/rfc263",
  "title": "\"Very Distant\" Host interface",
  "pagetotal": "2",
  "year": "1971",
  "month": "dec",
  "body": "\n\n\n\n\n\nNetwork Working Group                             A. McKenzie\nRequest for Comments #263                         BBN\nNIC #7811                                         17 December 1971\nCategories:  B.1, C.2, I.1\nUpdates:  none\nObsoletes:  none\n\n                     \"VERY DISTANT\" HOST INTERFACE\n\n     The normal method of connecting a Host computer to the ARPA\nNetwork is, and will continue to be, placing an IMP at the Host\nsite and making a short-distance hard-wire connection.  However,\nduring the past several months we have become increasingly aware\nof the occasional desire to interface a Host to some IMP via a\nlong-distance connection (where long-distance, in this context,\nis any cable run longer than 2000 feet but may typically be tens\nof miles) via either a hard-wire or telephone circuit.  We believe\nthat any good solution to the general problem of interfacing Hosts\nto IMPs must satisfy at least the following criteria:\n\n     1)  The characteristics of the connection should be such\n         that the undetected error rate can be expected to be\n         extremely low.\n\n     2)  The bandwidth of the connection should not be\n         intrinsically limited to a low value.\n\n     3)  The nature of the connection should be such that the\n         Host may establish multiple network \"conversations\",\n         i.e., it should have all the power of a normal Host\n         connection.\n\nThese criteria were briefly discussed in our earlier RFC #241\n(NIC #7671), \"Connecting Computers to MLC Ports.\"\n\n     After a careful review of the various possibilities for \"very\ndistant\" Host connection, we have arrived at a preliminary design\nfor this type of interface which we believe should prove\nsatisfactory with regard to the criteria above.  Although\ndetailed specifications will not be available for some time, the\nbasic elements of the design are as follows:\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nTransmissions will be full-duplex and will use the same\nBinary Synchronous format that is presently used in inter-IMP\ncommunication.  At the IMP end, a hardware interface identical\nin type, but not necessarily in speed, to the usual IMP 50 kilobit\nmodem interface will be used.  This interface frames blocks of\noutgoing data with special characters and appends a 24 bit cyclic\nredundancy check (CRC).  It de-frames and checks incoming blocks\nwhich must be of similar format.  The Host must provide mating\nformatting, de-formatting and checking facilities at its end.\n\n     In conjunction with the CRC creation and checking, the IMP\nwill be provided with a small amount of \"retransmission\" software\nas a front (i.e., Host side) end for the usual Host/IMP interface\nsoftware. The retransmission scheme, although not presently\ncompletely defined, will be based on positive acknowledgment/\ntimeout techniques.\n\n     The Host will be required to provide a front (i.e. IMP side)\nend to its NCP which can generate CRCs and test for CRC errors,\nprovide simple retransmission logic, etc.  This front end may be\nimplemented in Host software, by means of special purpose hardware,\nin a minicomputer, or in any other way which the Host organization\nfinds reasonable.\n\n     This new type of interface will be completely documented,\nfrom both a hardware and software point of view, as soon as the\ndetailed design is completed.  This documentation will probably\ntake the form of an update to BBN report No. 1822.\n\n     We will be happy to discuss this type of interface with any\ninterested organization, although it should be remembered that\ndetailed design is not yet completed.\n\nAMcK:jm\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}