{
  "series": "Request for Comments",
  "number": "374",
  "howpublished": "RFC 374",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0374",
  "url": "https://www.rfc-editor.org/info/rfc374",
  "title": "IMP System Announcement",
  "pagetotal": "2",
  "year": "1972",
  "month": "jul",
  "body": "\n\n\n\n\n\nNetwork Working Group                           Alex McKenzie\nRFC #374                                        BBN\nNIC 11099                                       19 July 1972\n\n\nThere are two significant developments in the operation of the network\nwhich should be of interest to all sites:\n\nNEW IMP SYSTEM IS RELEASED !\n   On Tuesday July 18, the new IMP software described in previous RFC's\n   (#331,#343,#359) was apparently successfully released.  We ran from\n   10:00am on that day until Wednesday afternoon with very few network\n   problems attributable to the new system.  We are quite pleased with\n   this performance, and expect to leave the new system up permanently!!\n\n   We are, of course, aware that in any system of this size, bugs may\n   crop up at any time, and we solicit the help of the network community\n   in finding them.  We also believe that the new system may have a\n   different \"feel\" to users, both terminal users and Hosts.  We urge\n   everyone to have a bit of patience while getting used to any change in\n   the \"feel\" of the network.  On the other hand, PLEASE REPORT ANY\n   SUSPECTED NETWORK MALFUNCTION TO THE NCC AS SOON AS POSSIBLE.\n   Evidence of bugs, guesses as to what went wrong, etc., are always\n   useful in hunting bugs, but don't let the lack of positive proof delay\n   the reporting of suspected system malfunction.  The NCC telephone\n   number is (617) 661-0100.  Feel free to call collect!\n\n   The one known shortcoming of the new software is the exacerbation of a\n   long-standing TIP software problem.  The TIP now often appears to\n   neglect sending an Allocate control message for some active\n   connection, with the effect that the Server-to-User path becomes\n   blocked.  We are giving the solution of this problem the highest\n   priority!  (Our current data seems to indicate that this problem is\n   most likely to occur when there are several users and when the Server\n   Host is a TENEX system.  If you know of other situations where this\n   problem has occurred, please let us know!)\n\n   Now that the new system is up, all sites with Model 516 IMPs will be\n   contacted by telephone and asked to reset the switches on their IMPs\n   as follows:\n\n             HALT INH         - on\n             W.D.T.           - on\n             AUTO RSTRT       - on\n             MEMORY PRTCT     - on\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nSITE POWER PROBLEMS\n   The network has recently been experiencing serious difficulties\n   related to the annual problem of more demand for electricity than is\n   available during the summer months.  For example:\n\n       During the month of June, between 1/4 and 1/2 of the\n       IMP down time was due to site power failure.\n\n       During the weekend of July 15-16, two sites were down\n       all weekend due to air-conditioning failure which was\n       apparently related to power failures or brownouts.\n       This left several sites connected to the rest of the\n       net through only one path which, according to Murphy's\n       law, eventually failed - leaving nine sites partitioned\n       from the remainder.\n\n       On July 18, an underground power transformer supplying\n       power to the entire computer room at site 27 failed,\n       putting IMP 27 out of action for several hours (anddit\n       could easily have been several weeks.)\n\n   Obviously in these cases there is little that either the NCC or the\n   site can do to restore service.  We expect these situations to\n   continue or even get worse as the summer continues.  Please try to\n   restrain your annoyance when these situations arise; we don't like\n   them either!\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}