{
  "series": "Request for Comments",
  "number": "286",
  "howpublished": "RFC 286",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0286",
  "url": "https://www.rfc-editor.org/info/rfc286",
  "title": "Network Library Information System",
  "pagetotal": "1",
  "year": "1971",
  "month": "dec",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 E. Forman\nRequest for Comments: #286                            MITRE\nNIC #8272                                             21 December 1971\nCategories: G.1 \u0026 G.2\nUpdates: None\nObsoletes: None\n\n                   Network Library Information System\n\n        Georgetown University is designing a Learning Resource Center\n   (LRC), part of which may consist of a system to enable computer query\n   (hopefully on-line) of G.U.'s Library holdings.  The ARPA community\n   might be of assistance in either of two ways:\n\n        1.  One or more organizations may have a Library Retrieval\n            System that they would like to share with Georgetown.\n\n        2.  Since there probably are needs for such a system at most\n            organizations, and since it would be highly beneficial\n            for one organization to be able to query other library\n            holdings as well, and subsequently arrange for inter-\n            library loans, the ARPA community might undertake to\n            design a Network Library Information System.\n\n        If sufficient interest in such a system exists, a working group\n   could be set up to establish the necessary protocols and iron out\n   details of the system.\n\n        It is probable that the NIC could provide valuable inputs to such\n   an undertaking and perhaps would serve as a focal point for the system\n   design and operation.\n\n        Please contact me if either:\n\n        1.  You have, or know of a Library Retrieval System that\n            can be shared with Georgetown University,\n\n        2.  Your organization is interested in participating in a\n            Network Library Retrieval System, or\n\n        3.  You are interested in participating in designing such a\n            system.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}