{
  "series": "Request for Comments",
  "number": "224",
  "howpublished": "RFC 224",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0224",
  "url": "https://www.rfc-editor.org/info/rfc224",
  "title": "Comments on Mailbox Protocol",
  "pagetotal": "2",
  "year": "1971",
  "month": "sep",
  "body": "\n\n\n\n\n\nNetwork Working Group                           Alex McKenzie\nRequest for Comments #224                       BBN\nNIC #7623                                       14 September 1971\nCategories:  D.7\nUpdates:  none\nObsoletes:  none\nReference:  RFC #215, #221\n\n\n                  Comments on Mailbox Protocol\n\n\n     It should be noted that the Terminal IMP will be unable to\ndirectly implement the currently-proposed mailbox protocol for\nthe following reasons:\n\n     a)  The Terminal IMP is completely incapable of storing\n         incoming messages for later printing or display.\n\n     b)  The Terminal IMP is not expected to be able to perform\n         as the \"server\" portion of any connection.\n\n     c)  The Terminal IMP cannot provide programs for the\n         processing of a variety of types of input streams.\n         It currently supports the TELNET protocol, and is\n         expected to support at least one mode of Data\n         Transfer Protocol in the future.  It is _not_ likely\n         to support the File Transfer Protocol.  Furthermore,\n         when using the Data Transfer Protocol it will not\n         perform any transformations on the data stream\n         (e.g., interpretation of line printer form-control\n         \"characters,\" translation from one character set to\n         another, etc.).  It will be up to the \"other end\"\n         of the connection to set up and decode messages based\n         on the terminal type.\n\n     Although these limitations preclude Terminal IMPs from\nparticipating in the currently-proposed mailbox protocol, this\nshould not be considered an objection to implementation of the\nprotocol, provided that Terminal IMP installations will be\nguaranteed the right to \"rent\" mailboxes at some larger Host\nsite [the NIC is probably a good candidate].  With this capability,\na message destined for a Terminal IMP user would be shipped to the\nsite of the \"rented\" mailbox according to protocol and stored\nthere.  A terminal IMP user could then periodically log in to that\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nRFC #224\nPage 2\n\nsite (under TELNET protocol) and examine the contents of the\nmailbox; since the \"examination\" would be carried out over a\nTELNET connection the Host containing the mailbox would _automatically_\nperform the necessary transformation of the data before transmitting\nit to the Terminal IMP.\n\n     A technically unattractive alternative to this scheme would\nbe to _require_ each Terminal IMP site to have a printer dedicated\nto the mailbox function.  If the mail were then transferred in\nTELNET format, we could probably provide a socket connected to\nthe dedicated printer for receipt of mail.  Obviously, if this\nscheme were chosen, a Terminal IMP could accept mail from only\none sender at a time, and the transmission rate would be limited\nto the speed of the printer.  Furthermore, a single central\nmailbox printer is likely to provide poor service to Terminal\nIMPs with widely scattered terminals (e.g., dial-in terminals\ndistributed over an area with a 10-mile radius).\n\n     We feel that, in addition to other arguments, it would be\nmore cost-effective to provide storage for rented mailboxes at\none site than to provide a _special_ mailbox printer at each\nTerminal IMP site.\n\n\n\n\nAMcK:jm\n\n\n\n\n\n\n    [ This RFC was put into machine readable form for entry ]\n    [ into the online RFC archives by BBN Corp. under the   ]\n    [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}