{
  "series": "Request for Comments",
  "number": "494",
  "howpublished": "RFC 494",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0494",
  "url": "https://www.rfc-editor.org/info/rfc494",
  "title": "Availability of MIX and MIXAL in the Network",
  "pagetotal": "1",
  "year": "1973",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                          D. Walden\nRequest for Comments: 494                                        BBN-NET\nNIC: 15359                                                 20 April 1973\nReferences: RFCs 473, 485\n\n\n               Availability of MIX and MIXAL in the Network\n\n   In RFC 473 I requested information on the existence of assemblers and\n   interpreters for Knuth's hypothetical MIX computer.  Following is a\n   summary of the responses to my earlier RFC.\n\n   First the rumors: (1) There is rumored to be a MIX interpreter\n   available on the University of Utah PDP-10, but not assembler; and\n   (2) There is rumored to be a MIX interpreter available on the SU-AI\n   PDP-10.\n\n      Now the facts:\n\n   A fairly well debugged and documented MIXAL assembler exists for the\n   UCSB 360/75.  A partially debugged MIX interpreter also exists.  See\n   RFC 485 for additional information.\n\n   Box MIX and MIXAL are available on the UCSD B6700; although,\n   according to Ken Bowles, they are not currently being handled as\n   fully supported products, and there may be some remaining bugs in the\n   systems. However, MIX and MIXAL are available for network users, and\n   Ken says they will be happy to receive notification of any errors\n   found in the MIX and MIXAL and will attempt to get corrections made\n   in due course. Contact Ken Bowles at UCSD for further information.\n\n   MIX and an assembler for MIX are available for network use on the\n   UCLA 360/91.  These systems have had considerable use, and they are\n   documented.  Contact Bob Braden at CCN for further information.\n\n   Finally: The Computer Science Center at Stanford University\n   apparently has available a standard package for exporting the MIX\n   systems to 360s and 370s.\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by David Hennessey 7/99 ]\n\n\n\n\n\n\n\n\n\nWalden                                                          [Page 1]\n\f\n"
}