{
  "series": "Request for Comments",
  "number": "464",
  "howpublished": "RFC 464",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0464",
  "url": "https://www.rfc-editor.org/info/rfc464",
  "title": "Resource notebook framework",
  "pagetotal": "2",
  "year": "1973",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 Michael D. Kudlick\nRFC # 464                                             SRI-ARC\nNIC # 14738                                           February 27, 1973\n\n\n                      Resource Notebook Framework\n\n\nIntroduction\n\nThe purpose of this RFC is to present a framework for coordinating all\nthe surveys and data gathering efforts concerned with \"resource\nnotebook\" type of information.\n\nWe have obtained agreement from ARPA with the framework, which is\ndescribed below.\n\n    The scheme is designed with two purposes:\n\n        a) to avoid a proliferation of data gathering efforts, which\n        would overwhelm the sites and persons supplying the much-needed\n        information;\n\n        b) to give the responsibility to the NIC for coordinating the\n        tasks associated with the resource notebook.\n\nTwo companion documents, NIC 14514 and NIC 14515 provide supplementary\ninformation to this RFC.\n\n    NIC 14514 describes the history of the Resource Notebook from 1971\n    to the present.\n\n    NIC 14515 contains the questionnaire that the NIC is currently\n    sending to server sites for data on Network Resources.\n\nA recent RFC by John Iseli and Dave Crocker (NWG/RFC #462, NIC 14434)\nalso addresses the same problem area.\n\n    The proposed framework for data collection suggested by John and\n    Dave is different from the framework outlined in this RFC.\n\nFramework\n\nThe Network Information Center will coordinate the task of collecting,\nverifying, and disseminating information of a \"resource notebook\"\nnature.\n\n    a) Collecting and verifying the data.\n\n\n\nKudlick                                                         [Page 1]\n\f\nRFC 464               Resource Notebook Framework          February 1973\n\n\n        Because of the magnitude of this task, regional data collectors\n        would provide assistance both to the NIC and to the sites\n        supplying the information.\n\n            We think that initially there should be five regions:\n            Boston, Washington DC, San Francisco, Los Angeles, and Mid-\n            Continent.\n\n        The regional agent would collect the information from the sites\n        in their region and forward it to NIC for inclusion in the\n        Resource Notebook data base.\n\n        The NIC would work closely with the regional agents to ensure\n        that the data is accurate and up-to-date.\n\n    b) Disseminating data.\n\n        There is presently a need to prepare different subsets or\n        \"views\" of the resource notebook information.\n\n        Regardless of which groups on the Network are given\n        responsibility for preparing different views of the complete\n        resource notebook data base, these views should be available for\n        use on-line as the NIC as well as off-line.\n\nA working group of persons interested in the needs and problems of a\nresource notebook would meet periodically to review the situation, and\nto make concrete proposals for improvements.\n\nDiscussion\n\nWe welcome discussion on this RFC.\n\nI you think it is desirable, a meeting could be held at SRI-ARC to\ndiscuss the whole problem area.\n\n    If a meeting is desirable, we suggest it be held soon, say on Monday\n    March 19, 1973, at 8:30 AM in the SRI-ARC Conference Room.\n\nPlease let us have your comments by March 9.\n\n    You may contact us at (415) 326-6200, ext 3617, care of Mlke\n    Kudlick.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\nKudlick                                                         [Page 2]\n\f\n"
}