{
  "series": "Request for Comments",
  "number": "281",
  "howpublished": "RFC 281",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0281",
  "url": "https://www.rfc-editor.org/info/rfc281",
  "title": "Suggested addition to File Transfer Protocol",
  "pagetotal": "8",
  "year": "1971",
  "month": "dec",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        A. McKenzie\nRequest for Comment: 281                                             BBN\nNIC: 8163                                                8 December 1971\nCategory: D.7\nReference: RFC #264, #265\n\n\n             A suggested Addition to File Transfer Protocol\n\n\nOn November 16, an informal meeting was held at UCLA to discuss\nprospects for a network standard Remote Job Service (RJS) protocol.  In\nattendance were representatives of UCLA-CCN and UCSB, the\nnetwork's only current RJS sites, as well as UCLA-NMC and the BBN\nnetwork project.  A report on that discussion will be published as an\nRFC shortly and will not be discussed here.  In thinking about the use\nof the proposed File Transfer Protocol (FTP) (RFC #265) for RJS,\nhowever, we came to the conclusion that a \"restart\" procedure might be\nan extremely useful addition to the FTP.\n\nMany, perhaps most, of the individuals involved in protocol design thus\nfar are oriented toward the use of short date transmissions over the\nnetwork the transmission lengths that have been considered \"typical\" are\na few characters, a print line, or perhaps as much as a page of text.\nThe experience of the current RJS sites, however, is that single files\nare commonly much longer, for example a line-printer output file of 400\npages would not seem unusual to these sites.  Further, one might\nreasonably predict that network use of Remote Job Services will be\npreselected with a tendency toward large jobs (although large jobs do\nnot necessarily imply large I/O files) and that the addition of other\nbatch service sites (ILLIAC, UCSD) will increase the number of long-file\ntransfers.  In light of this kind of experience/prediction, it would\nseem that the FTP should include (perhaps as an option which\ninteractive-user oriented systems could ignore) a method of \"restarting\"\na long file transfer if some element in the transmission path fails\nafter a large volume of data has been transferred.\n\nThe critical element in a \"restart\" procedure is the ability to arrange\nagreement between both ends of the transmission path as to where,\nexactly, the retransmission should begin.  There are two potential\ncandidates for marking possible restart locations already built into the\nproposed Data Transfer Protocol (RFC #264) which underlies the FTP;\nthese are:\n\n      a) The \"information separators\" (transaction type B4) which are\n      available in both \"transparent block\" transfers and \"descriptor\n      and counts\" transfers, and\n\n\n\n\nMcKenzie                                                        [Page 1]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n      b) The \"sequence numbers\" which can be used with the \"descriptor\n      and counts\" transfer mode.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 2]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n   After some discussion, we seemed to agree that the \"information\n   separators\" (as they would be used in \"transparent block\" transfer\n   mode, i.e., without \"sequence numbers\") were unlikely to serve as\n   UNAMBIGUOUS restart location marker, and therefore we suggest the use\n   of \"sequence numbers\" as markers.  We were aware of the fact that\n   this choice might exclude TIPs and other Hosts which do not use\n   sequence numbering from the type of recovery under discussion; we\n   believe, however, that our suggestion eliminates at least some of\n   this problem.\n\n   Imagine that some site, which we will call the \"user site\" or \"user\",\n   has initiated a connection from its own file transfer process to a\n   file transfer process at some other site, which we will call the\n   \"server site\" or \"server\".  After the appropriate exchanges of\n   information, a file transfer (using the File Transfer Protocol)\n   begins over the path between these two sites.  After some information\n   is transferred, the path between the user and server is broken.  At\n   some later time the user initiates a new connection between the file\n   transfer processes at user and server, establishes relevant access\n   privileges, and wishes to resume the transmission which was in\n   progress when the path was broken.  First we describe four new op-\n   codes for the File Transfer Protocol:\n\n   Hex        Operation\n   ---        ---------\n   10         Append at sequence number\n\n              This command is essentially the same as any of the \"Store\"\n              or \"Append...\" commands except that a 16-bit sequence\n              number immediately follows the op-code (before the\n              pathname).\n\n   11         Retrieve at sequence number\n\n              This is the same as the \"Retrieve\"command except that a\n              16-bit sequence number immediately follows the op-code\n              (before the pathname).\n\n   12         Resume Retrieve\n\n              To be used when the user wishes the server to choose the\n              sequence number; in other respects this is identical to\n              the \"Retrieve\" command.\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 3]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n   13         Use the sequence number\n\n              This command contains only the op-code and a 16-bit\n              sequence number.  It is intended as a denial of the\n              ability to locate the sequence number given in an \"Append\n              at sequence number\" or \"Retrieve at sequence number\"\n              command and, simultaneously, to suggest another number\n              which can be located.\n\n   There are several possible cases which are shown below.  The user\n   site is always presumed to be the site at the left of the page.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 4]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n   A.   User site sending at time path is broken:\n       /\n      /   Append at sequence number\n     |    -------------------------------------------\u003e\n     |    Acknowledge\n     |    \u003c------------------------------------------\n     |    Data\n     |    -------------------------------------------\u003e\n     |\n      \\   The server site agrees to resume at the user-chosen point.\n       \\  The first data transaction is numbered with the chosen\n        \\ sequence number.\n\n       /  Append at sequence number\n      /   -------------------------------------------\u003e\n     |    Unsuccessful Terminate\n     |    \u003c-------------------------------------------\n     |\n      \\   The server site will never permit restart for some reason\n       \\  (seq. #s were ignored or not used initially, seq #s were not\n        \\ stored with the file, the file was lost when the path was\n         \\broken, etc.)\n\n       /  Append at sequence number\n      /   -------------------------------------------\u003e\n     |    Use this sequence number\n     |    \u003c-------------------------------------------\n     |       /       Data\n     |      /        ---------------------------------\u003e\n     |      \\        The user site agrees to use the server-chosen number\n     |       \\       and the first data transaction is numbered with the\n     |        \\      chosen number.\n     |\n     |                       or\n     |\n     |         /      Unsuccessful Terminate\n      \\       /       -------------------------------\u003e\n       \\      \\       The user site cannot restart at this number for\n        \\      \\     some reason.\n\n\n\n\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 5]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n   B.  User site receiving at time path is broken, and the user site\n   does not particularly care about the exact sequence number (for\n   example, if the user site is sending the file to a printer, some\n   duplicate pages are probably acceptable and the user site would\n   probably not want to remember sequence numbers).\n\n               /  Resume Retrieve\n              /   ------------------------------------\u003e\n             |    Data\n             |    \u003c------------------------------------\n             |    The server picks some point and begins transmission at\n             |    that point.  If sequence numbers were used during the\n             |    original transmission, then the first transaction of\n             |    this transmission must exactly match (including\n             |    sequence number) some transaction of the original\n              \\   transmission.\n\n               /  Resume Retrieve\n              /   ------------------------------------\u003e\n             |    Unsuccessful Terminate\n              \\   \u003c------------------------------------\n               \\  The server site is unable or unwilling to restart the\n                \\ transmission.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 6]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n   C.  User site receiving at time path is broken, and does care about\n   the value of the sequence number.\n\n               /  Retrieve at sequence number\n              /   ----------------------------------------\u003e\n             |    Data\n             |    \u003c----------------------------------------\n              \\   The server agrees to resume at the user-chosen\n               \\  point. The first data transaction is numbered\n                \\ with the chosen sequence number.\n\n               /  Retrieve at sequence number\n              /   ----------------------------------------\u003e\n             |    Unsuccessful Terminate\n             |    \u003c----------------------------------------\n             |\n             |    The server site will never permit restart for some\n             |    reason.\n             |    Retrieve at sequence number\n             |    ----------------------------------------\u003e\n             |    Use this sequence number\n             |    \u003c-----------------------------------------\n             |            /    Acknowledge\n             |           /     ----------------------------\u003e\n             |          |      Data\n             |          |      \u003c----------------------------\n             |           \\     The user site agrees to use the\n             |            \\    server-chosen number.  The first data\n             |             \\   transaction is numbered with the chosen\n             |              \\  number.\n             |\n             |                               or\n             |\n             |             /   Unsuccessful Terminate\n             |            /    -----------------------------\u003e\n             |           |\n              \\           \\    The server cannot use the user-chosen\n               \\           \\   number and the user cannot use the\n                \\           \\  server-chosen number. Therefore the attempt\n                 \\           \\ to restart must be abandoned.\n\n\n\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 7]\n\f\nRFC 281      A Suggested Addition to File Transfer ProtocolDecember 1971\n\n\n   Some sites (e.g., UCLA-CCN) have agreed (in principle, at least) to\n   implement these commands and, more important, to store sequence\n   numbers (with files being transferred) on a non-volatile storage\n   medium so that restarts may be effected.  This will be done, of\n   course, only if this, or some similar, proposal is accepted by the\n   NWG as part of the File Transfer Protocol.  We hope interested\n   parties will communicate comments or counter-proposals to the FTP\n   committee and/or publish their ideas in the RFC series.\n\n   AAM/jm\n\n\n\n\n\n\n\n\n\n\n\n          [This RFC was put into machine readable form for entry]\n      [into the online RFC archives by Kelly Tardif, Viaginie 10/99]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 8]\n\f\n"
}