{
  "series": "Request for Comments",
  "number": "231",
  "howpublished": "RFC 231",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0231",
  "url": "https://www.rfc-editor.org/info/rfc231",
  "title": "Service center standards for remote usage: A user's view",
  "pagetotal": "4",
  "year": "1971",
  "month": "sep",
  "body": "\n\n\n\n\n\nNetwork Working Group                     J. Heafner - Rand\nRequest for Comments  231                 E. Harslem - Rand\nNIC 7648                                  21 September 1971\n\n\n                        SERVICE CENTER STANDARDS\n                        ------------------------\n                    FOR REMOTE USAGE--A USER'S VIEW\n                    -------------------------------\n\nINTRODUCTION\n------------\n\n     This note is a statement of our views on service cen- ter\nstandards.  It is an input to the service center panel discussion of\nthe October Network meeting.  Some areas are identified for\nconsideration in intra-network standardiza- tion.  We do not describe\na methodology for analyzing com- puter systems; however, such analysis\nmay be appropriate for solving the problems.  We also do not enumerate\nthe spectrum of services that may be required.  We merely enu- merate\nareas where commonality of appearance and function can be of immediate\nvalue to a network user.\n\nCAVEAT\n------\n\n     It is assumed that service centers will conform to official\nnetwork standard protocols.  This is essential for service centers\nsince the effects of their practices are generally more wide-spread\nand are crucial to the effectiveness of minimal hosts such as TIPs.\n\nJUSTIFICATION\n-------------\n\n     The generation of network standards for service centers is of\nvalue to a very important class of people--the ultimate user\ncommunity.  We have such a community at Rand that is composed of\nresearch scientists and their support programmers.  Certainly such\nusers exist elsewhere, and a goal of the net- work must be to\nencourage their use.  In the past, these researchers have relied\nsolely on programmers to buffer them from computer detail.\nStandardization of services is cer- tainly a great value in expanding\nthe community of users and eliminating the buffer.\n\n     Additionally, standards will be of benefit to those persons\nresponsible for implementation of resource access programs.  Instances\nand areas of standardization are cited below to support both of these\nstatements.\n\n\n\n                                                                [Page 1]\n\f\nAREAS FOR STANDARDIZATION\n-------------------------\n\n     Each host installation has its own standards for pro- gramming\nand operational procedures.  From a network point of view, we are only\ninterested in standards affecting external performance--primarily\nrequired operations and documentation of procedures.  Intra-network\nstandards should allow a user to plan his network use effectively to\nimprove the performance of his tasks and take advantage of savings in\nboth time and money.\n\nRemote Job Entry\n----------------\n\n     One immediately apparent area for standardization is in the\naccess to network resources.  For example, there are two remote job\nentry (RJE) facilities on the network at present with two different\ndata protocols.  The UCSB facility was developed early to provide\ntimely access to their resources.  The UCLA facility was developed\nafter the Telnet and Data Transfer protocols and takes advantage of\nthem.  If these two services appeared alike to the user and to the\nusing process, two significant advantages would be obtained.  First,\nthe using system would need only one module to access both facilities.\nAnd secondly, a user could select either facility on a dynamic basis\nusing the conditions influencing him at any given moment without any\nadditional knowledge of the specific site.\n\nLogin Procedures and Subsystem Access\n-------------------------------------\n\n     A more global example of common access to resources is the login\nprocedure to remote systems.  All systems require basically the same\ninformation--password, identification, account number.  Yet the\nformats are syntactically inconsis- tent.  An extension to the logger\ngenerally exists at these sites in the form of a \"line scanner\" for\nthe network.  In general, this module also performs other\ntransformational functions.  It would certainly be reasonable for this\nmodule to translate a network standard login into whatever format was\nrequired at the site.  Perhaps to a lesser extent, a similar approach\ncould be taken to constructing a uniform access to subsystems from the\nsupervisor.  In like fashion, a network standard interrupt could be\ntranslated into the escape (e.g., control C) of the serving host to\nreturn from a subsystem.\n\nCharging Algorithms and Accounting Protocol\n-------------------------------------------\n\n     To accurately forecast costs, a normalized formula for machine\n\n\n\n                                                                [Page 2]\n\f\ntime estimation is needed.  Technically, an accounting protocol is\neasily added at the subnet and/or NCP levels--the relevant information\nis the same for all nodes, thus the Net charges are readily determined\nby any node.  More difficult is the prediction and comparison of host\ncharges.  Like the login procedure example, each host uses the same\ningredients, namely storage, I/O, connect time, and CPU resources\nexpended.  Again, like the login procedure the information is handled\nslightly dif- ferently in each case such that estimations are\ndifficult.  For example, some charge algorithms represent I/O as\ncounts of I/O transactions where others clock I/O time.  Without\nsignificantly perturbing anyone's local accounting proce- dures, it is\ndesirable to normalize the charge components as a step toward\nreasonable cost comparisons and forecast- ing.\n\nOff-Line Services\n-----------------                             .\n\n     Procedures need to be established for off-line services where\nthey are offered as a service or are an integral part of a service.\nSuch services are graphic hardcopy, large quantities of printer\noutput, tape or disc facilities, etc.  How are such items transmitted?\nWhat guarantees or state- ments should be made about turnaround times?\nHow should they be specified--in terms of invocation and communication\nwith operations staffs?\n\nJob Scheduling, Priorities and Status Information\n-------------------------------------------------\n\n     Extrapolating from the above rather static cost com- parisons\nthat a normalized formula allows, envision a small but useful process,\ni.e., a throughput query service, that allows the user to dynamically\ndetermine the most cost ef- fective location for a job.  (Such a\nservice is technically reasonable since some systems now offer status\ndata such as a core map and job queues display.) Imagine the user's\nsituation.  \"Let's see, I need these numbers by 4:00 and I'm willing\nto pay a slight dollar premium to get them; the job will run on any\nTenex machine, where should I run it?\" The user would like to query\nTenex systems, providing as input the requirements of his program, and\nget answers like probable turn-around time and cost vectors for dif-\nferent priorities.  (Incidentally, our non-programmer users are\nfamiliar with their job parameters (time, core space, etc.) since this\ninformation is normally part of the out- put stream.)\n\n     Most of the necessary elements for such a service are readily\navailable in systems with which we are concerned.  The query service\nwould be a utility for users.  This is the kind of a problem we should\naddress concerning services vis-a-vis exporting Network concepts.\n\n\n\n\n                                                                [Page 3]\n\f\nOther Areas\n-----------\n\n     In addition to the above items, the user community could\nimmediately benefit from standards in: documentation formats and\ndistribution, operating schedules, the extent and availability of\nconsulting services, data transmission and storage facilities,\ntechniques for communication with operations staffs, and abnormal\nprocedures such as system or program failures.\n\n     Some of the above items should be described in a standard format\nrather than the services themselves being standardized across the\nnetwork.  For example, schedules obviously vary in different time\nzones and each system has a different magnitude and policy for on-line\nstorage capabilities.\n\n     To some extent these items are covered in the Resource Notebook.\nIt should either be expanded to become a service center standards\nnotebook or a separate item to fulfill that function should be\ncreated.  For example, a site might have resources that it wished to\noffer on a limited or special arrangement basis to the network\ncommunity and should be included as such in the Resource Notebook.\nHowever, that site might not wish to or have the staff to conform to\nnetwork service center standards.  Hence, the service center notebook\nwould describe standards for a much more rigor- ously conforming\ncommunity.\n\nSUMMARY\n-------\n\n     The theme of this note is that without classifying ser- vices and\nanalyzing operations at service nodes, there are a number of areas\nthat can be standardized to some extent throughout the network.  What\nis needed is a manual of service center standards and a collection of\ndocumentation on services.  Perhaps the latter is the Resource\nNotebook.\n\n     Service centers who intend to attract a significant network user\ncommunity should be prepared to adopt a psychol- ogy appropriate to\nthe market-oriented requirements for providing service.  In the\nnetwork at large, with our re- search orientation, personnel tend to\nhave a different approach to computing than that required by a service\nbureau.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n                                                                [Page 4]\n\f\n"
}