{
  "series": "Request for Comments",
  "number": "313",
  "howpublished": "RFC 313",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0313",
  "url": "https://www.rfc-editor.org/info/rfc313",
  "title": "Computer based instruction",
  "pagetotal": "8",
  "year": "1972",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                     Tom O'Sullivan\nRequest for Comments: 313                                       Raytheon\nNIC: 9343                                                  March 6, 1972\n(CBI: 1)\n\n\n                       COMPUTER BASED INSTRUCTION\n\n   Current development of Computer Based Instruction (CBI) systems seem\n   to be directed toward two types of system:\n\n      1.)  Small to medium scale, dedicated, stand alone systems (such\n      as the IBM 1130, 1500, 1800 complexes) or medium scale systems\n      with dedicated network implications (such as TICKET), and\n\n      2.)  Large, centralized, dedicated systems with dedicated network\n      implications (such as PLATO).\n\n   Some attention has been given to the application of the resources of\n   a General Purpose Computer Network to CBI (e.g., the EDUCOM efforts),\n   however the full implication of the use of such resources do not\n   generally seem to be understood by either the CBI development centers\n   (at academic institutions or at the Armed Forces training or\n   development centers), where most of the current activity takes place,\n   or at ARPA Network Nodes, where most of the resources reside.\n\n   This Request For Comment has two purposes  To:\n\n      1.)  Solicit comments from the Network Working Group, and others,\n      on how selected classes of (and what specific) resources of a\n      General Purpose Network might be applied to the field of Computer\n      Based Instruction and\n\n      2.)  Initiate a dialog between interested parties on the problems\n      of Computer Based Instruction, not limited to, but including, the\n      uses of General Purpose Computer Network resources.\n\n   The attached paper discusses some of the applications of the\n   resources of a large General Purpose Network to computer Based\n   Instruction systems.  Response and discussion are encouraged through\n   the NIC system.\n\n\n\n\n\n\n\n\n\n\nO'Sullivan                                                      [Page 1]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\n                   GENERAL PURPOSE COMPUTER NETWORKS\n                                    AND\n                        COMPUTER BASED INSTRUCTION\n\nINTRODUCTION\n\n   A high level of Computer Based Instruction (CBI) activity exists both\n   in the academic and armed service communities, with the promise of a\n   substantial amount of early development of instruction courses and\n   instructional management facilities.  The major functional areas of\n   interest can be described as follows:\n\n      1.)  Design and Development\n      2.)  Field Tests\n      3.)  Distribution and Operational Use\n      4.)  Evaluation and Modification\n\n   Specific computer support requirements are function of the philosophy\n   and reflected strategy of implementation for each of the functional\n   areas of interest.  Design and development activities may focus on\n   overall curriculum development or on specific training or educational\n   goals involving a specific course.  The focus of attention will have\n   an effect on the support requirements, e.g., the type and size of\n   data base, specialized processing capabilities, etc.  Support\n   requirements for Field Tests will be a function of whether they are\n   to be performed at a central location, or are geographically\n   distributed, particularly with respect to data collection procedures,\n   computer support and terminal clusters, and communications.\n   Solutions to the problems of the distribution and operational use of\n   CBI systems and programs will be a function of the extent to which\n   the training activity is proliferated (i.e., geographically or\n   organizationally distributed).  Both the level of activity, and the\n   solution to problems, in the area of Evaluation and Modification will\n   depend on the goals of the instructional process, the extent of\n   dynamic change in the technology or specific application involved,\n   and the degree to which the course(s) developed meet the needs for\n   which they were intended.\n\n   The above discussion has a heavy emphasis on Computer Aided\n   Instruction (CAI) component of CBI, where the computer is directly\n   used in the instructional process for lesson presentation, test,\n   drill and practice, etc.  Another component of CBI, Computer Managed\n   Instruction (CMI), uses the computer as a management tool to guide\n   the instructional process.  CMI may be used in conjunction with CAI,\n   or as an aid in guiding instructional processes of a more traditional\n   nature.  CMI, in addition to providing assistance in student\n   selection, scheduling, and followup on past course performance, may\n   provide guidance to instructors in the form of diagnostics of student\n\n\n\nO'Sullivan                                                      [Page 2]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\n   weaknesses, prescriptions for strengthening student understanding,\n   and guidance in the redirection of students.  In addition, CMI can\n   provide management with evaluations of course and instructor\n   effectiveness.  CMI has corollaries to the discussion of CAI resource\n   requirements and their relation to the philosophy and related\n   strategy employed.\n\n   Bearing in mind the effects on resource requirements of the complex\n   considerations involved in CBI, there seem to be several areas in\n   which the resources of a large General Purpose Computer Network, such\n   as the ARPA Network, could be of high utility if properly applied.\n   These include:\n\n      1.)  The Network itself\n      2.)  Centralized Data Storage\n      3.)  Language processors\n      4.)  Dialogue Support Systems\n\n   As questions of philosophy and general strategy are resolved, or\n   assumed, the hard questions of implementation come into play.\n   Tradeoffs between competing approaches of the instructional strategy\n   or model, techniques of measurement, languages, hardware, etc., must\n   be made.  It appears that both in resolving the tradeoffs, and in the\n   implementation stage, network resources could prove to have high\n   utility.\n\nTHE NETWORK\n\n   The network itself seems to have utility for CBI that goes beyond the\n   function of providing a communications base for linking terminal(s)\n   (individual or clustered) to processors dedicated to CBI.\n\n   The latter function, however, is important.  The communications\n   network exists, and can be tied into efficiently from many parts of\n   the country.  If there were dedicated CBI systems on the network, it\n   would facilitate:\n\n      1.)  Evaluation of a single system (or its several components) for\n      adequacy, or of competing systems for relative utility, by an\n      interested user center, to assist in the selection of a system for\n      a specific use;\n\n      2.)  Early use by a geographically isolated user center, through\n      use of clustered terminals, of the full power of a major CBI\n      center,\n\n\n\n\n\n\nO'Sullivan                                                      [Page 3]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\n         a.)  For a continuing period of low level use, or\n\n         b.)  Building over time until total usage by the isolated\n         center justifies the installation of a full CBI center of its\n         own.\n\n   Existing network resources also hold promise of utility.  Many\n   manufacturers' systems, with associated varieties of operating system\n   software, are available on the ARPA Network.  Within most of these, a\n   variety of application software is available, some supporting CBI and\n   data base applications.  Therefore, even without the presence of a\n   dedicated CBI system available as a service center on the network,\n   use could be made in support of CBI interests.\n\n      1.)  Testing of existing language and data base systems for\n      appropriateness to CBI problems.\n\n      2.)  Development of CBI systems or components for demonstration\n      and/or test.\n\n      3.)  Testing of existing courses, lessons, or lesson segments to\n      determine if they meet specified performance criteria, eliminating\n      potential duplication of course development effort.\n\n      4.)  Development of CBI systems to be operated under a specific\n      set of hardware and software resources available in the network in\n      anticipation of delivery of a dedicated operational system.\n\n      5.)  Greater flexibility in selection of test sites for field test\n      of courses developed, and performance of those tests prior to the\n      delivery of operational hardware.\n\n      6.)  Formalization of hardware support and associated software\n      protocols to clustered terminals to provide continuing service to\n      geographically remote training activities.\n\n   Even the interests of dedicated CBI systems can be served, since the\n   network has established communications and terminal support protocols\n   that could tend to reduce the software efforts required to establish\n   contact between a large dedicated service center, and clusters of\n   user center terminals.  In addition, terminal types not normally\n   supported by the CBI service center machine might be accommodated by\n   accessing the network through a compatible port, and getting into the\n   service center through established network protocols.\n\n\n\n\n\n\n\nO'Sullivan                                                      [Page 4]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\n   Terminal access to the ARPA Network could be provided in the\n   following ways:\n\n      1.)  Single Terminals - over common carrier facilities to the\n      nearest compatible HOST or TIP.\n\n      2.)  Large Clusters - Simple single purpose TIP, or simple mini-\n      computer supported in the network as far distant HOST.\n\n      3.)  Small clusters - either of the above two depending on the\n      length and intensity of expected use and the number or terminals\n      in the cluster.\n\n   In addition to the above general uses of a large General Purpose\n   Computer Network, there are several specific classes of network\n   resources that may be useful.\n\nCENTRALIZED DATA STORAGE\n\n   The effect of economy of scale could reduce costs for smaller CBI\n   systems if they make use, through the network, of mass storage on\n   larger systems.  If duplicate smaller systems are distributed in the\n   field, then the centralized storage would have a multiplying effect\n   on savings for lessons and lesson material, but special attention\n   would have to be given to the file structure to permit efficient use\n   of look ahead techniques for lessons, lesson segments, and individual\n   student pages.\n\n   For CMI data there are savings that go beyond the economy of scale.\n   A single management system could be selected or built on a large\n   service center machine to be used by CBI systems on the network, even\n   though the operational CBI systems are supported by different\n   manufacturers' hardware.  This would not only reduce the cost for\n   programming and maintaining CMI systems, but also facilitate cross\n   system analysis and intersystem comparison, even though each using\n   system would have its own set of files.  The user of the network data\n   reconfiguration service and data transfer protocol should make such\n   operations feasible.\n\n   This approach to CMI would assist in early development stages of\n   course material by easing the problem of accessing data on past\n   performance and norms.  In the case of geographically distributed\n   testing, the evaluation team would have faster access to performance\n   data.  Both the distribution and modification tasks seem cleaner\n   since there is only one copy of the released version to be updated.\n\n   If the trillion bit laser memory proposed for AMES becomes a reality,\n   then the economy of scale argument can be expected to be dramatic.\n\n\n\nO'Sullivan                                                      [Page 5]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\nLANGUAGE PROCESSORS\n\n   A basic characteristic of a large General Purpose Computer Network is\n   that it is capable of providing support from various manufacturers'\n   machines.  That is, such a network can be comprised of a number of\n   special purpose processors that can be distributed geographically and\n   organizationally to locations where the best support exists for each\n   process.\n\n   This characteristic makes it possible to select and join the best\n   match of capabilities for a complex application .  It is no longer\n   necessary to settle for a hardware/software system that does a\n   reasonable job in most areas of the applications need.\n\n   CBI is a complex application.  In addition to a good management\n   system and associated data base, it requires heavy text handling for\n   lesson material, table lookup and branching logic for acting on the\n   student selected answers to multiple choice questions, a student\n   arithmetic problem solving language for drill and practice,\n   simulation capability of both physical processes (for laboratory and\n   circuit simulation), and of decision processes (for gaming\n   experience), and a future need for natural language processors to\n   permit evaluation of free form student responses.  In addition, there\n   may be need for heavy statistical and arithmetic processing for\n   course, student, and instructor evaluation.\n\n   Depending on the course, various mixes of languages to support the\n   above activities will be needed.  Some believe that the language\n   required for presentation of course material and evaluation of\n   student response (and associated appropriate action) may be heavily\n   dependent on the type of course being given.  As we develop a deeper\n   understanding of the learning process, we are likely to require\n   expansion of languages to provide new functions and perform processes\n   not yet identified.\n\n   To provide expandability of languages, Meta-compiler techniques can\n   be applied.  Meta-compilers are in an early stage of development;\n   however, several are available on the network.  In addition to\n   facilitating language expansion with minimum effort while preserving\n   the workability of code written in the previous versions of the\n   changing language, the Meta-compiler can be made to produce either\n   compiler or program object code that will operate on several\n   different target machines.  This feature can give both programs and,\n   in some cases, compilers that are transportable across machines,\n   eliminating the need to settle on a single manufacturer's hardware\n   when it is expected that a CBI compiler or interpreter, or a course\n   or set of courses is going to be used in a way that requires\n\n\n\n\nO'Sullivan                                                      [Page 6]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\n   substantial geographic distribution.  Hardware decisions can be based\n   on the most cost-effective hardware for the combinations to be run at\n   one time.\n\n   Use of Meta-compilers will permit the development and debugging of\n   new course material in advance of the delivery of the system selected\n   for operations, even though the selected machine is not yet\n   represented in the large General Purpose Computer Network.  Field\n   test can also proceed before the selected hardware arrives.\n\n   Experience to date in the use of Meta-compilers indicates that the\n   use of their high order languages to implement compilers and\n   interpreters result in dramatic savings in both turnaround time and\n   the absolute cost of producing a finished language product.\n\nDIALOGUE SUPPORT SYSTEMS\n\n   In a field developing as rapidly as CBI, and at a time when\n   substantial implementation is about to take place, dialogue between\n   theoreticians, developers, and users is an important issue.  New\n   tools for supporting dialogue among members of a distributed group\n   are currently in experimental use in the ARPA network.  These new\n   techniques not only support dialogue more rapidly than the\n   distribution of papers, notes, and memos, but in some cases tend to\n   sharpen the thought process and yield a better result.\n\n   The application of such facilities, when ready, will be helpful\n   beyond the early planning stages or projects.  After plans are set,\n   during the development of a project, a broader group of experts will\n   be able to be called on to work on problems and questions as they\n   occur.  Later, as the product is being field tested (especially if\n   testing is distributed or separated from the evaluation group), these\n   new tools can be used to allow the test implementors to interact with\n   each other and with evaluators in a more timely manner than a post-\n   mortum meeting, resolving problems and questions as they occur, and\n   as a side benefit producing more complete documentation of test\n   progress.\n\n   After the tests, when the product is being used operationally, these\n   same tools can provide an excellent vehicle for tapping the ideas,\n   suggestions, and enrichments contributed by the more creative\n   instructors, and facilitate acting on them more rapidly than is\n   currently possible.\n\n   Meanwhile, as these tools are being developed, present ARPA Network\n   procedures for supporting the dialogue in a distributed group in more\n   traditional ways may prove helpful.  The Network Information Center\n   (NIC), in addition to supporting the general ARPANET community, is\n\n\n\nO'Sullivan                                                      [Page 7]\n\f\nRFC 313                Computer Based Instruction             March 1972\n\n\n   supporting special interest groups such as the Speech Understanding\n   Research (SUR) group.  The application of these procedures could\n   establish a valuable link between the academic-nonprofit institutions\n   working on CBI, the centers in the Armed Forces where development and\n   operations are taking place, and members of the network community who\n   have an intimate understanding of the network resources available.\n\nCONCLUSION\n\n   This paper has argued that there are resources in a large General\n   Purpose Computer Network that can be applied to CBI with high\n   utility.  The argument can be extended to suggest that large\n   dedicated CBI systems can have greater utility to users (and in the\n   other direction, greater use), if tied into a General Purpose\n   Computer Network, with respect to current network capabilities,\n   future network developments, and in some cases provide backup during\n   periods of overload or system failure.\n\n   There are certainly important CBI issues outstanding in areas of\n   pedagogy, strategy, curriculum development, testing, etc.  As CBI\n   systems are developed there are important issues of control (of the\n   development process, of the distribution of material, and of\n   modification of those materials).  However, these issues seem to be\n   independent of the question of whether CBI takes advantage of the\n   resources of a large General Purpose Network.\n\n   There are important problems to be solved on the computer side\n   dealing with better tools to handle and evaluate masses of data,\n   language, and protocols for network utilization.\n\n   However, there seems to be sufficient promise in what we know of\n   present network capabilities to warrant serious consideration by the\n   developers of CBI of how General Purpose Networks fit in, and by\n   network people of how their resources apply to this important large\n   application area.\n\n\n\n\n\n        [This RFC was put into machine readable form for entry]\n     [into the online RFC archives by H�l�ne Morin, Viag�nie 10/99]\n\n\n\n\n\n\n\n\n\nO'Sullivan                                                      [Page 8]\n\f\n"
}