{
  "series": "Request for Comments",
  "number": "399",
  "howpublished": "RFC 399",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0399",
  "url": "https://www.rfc-editor.org/info/rfc399",
  "title": "SMFS Login and Logout",
  "pagetotal": "2",
  "year": "1972",
  "month": "sep",
  "body": "\n\n\n\n\n\nRFC #399                                        Mark Krilanovich\nNIC #11917                                      UCSB\nUpdates:  122                                   Sept. 26, 1972\n\n                  SMFS Login and Logout\n\n        Two new commands have been added to UCSB's Simple Minded\nFile System (SMFS).  They are described below.\n\n\n        Login (LGI)\n        The login command is the means whereby the user\nidentifies himself and specifies the account number to which his\nuse of SMFS is to be billed.  The user should issue a LGI command\ndirectly after completing the ICP and before any command\nreferencing a file.  The user name and account number specified\nremain in effect until another LGI command is issued, a LGO\ncommand is issued, or the connection is closed.\n\n        At present, the use of SMFS is not billed, and therefore\nuse of the accounting commands is optional.  It is requested,\nhowever, that users and user processes begin to use this command\nas soon as possible, since we would like to collect statistics on\nSMFS utilization before implementing billing.  Therefore, at\npresent the user name can be any name that identfies the user,\nand the account number is completely arbitrary.\n\n        The format of the LGI command is given below.  Note that\nthe lengths of the fixed-length fields are given in bits.  The op\ncode for LGI is decimal 13.\n\n            8\n        \u003cop code\u003e\u003cuser name\u003e\u003caccount number\u003e\n\nThe \u003cuser name\u003e and \u003caccount number\u003e fields are further divided\nas follows:\n\n            8     8*length\n        \u003clength\u003e\u003cuser name\u003e\n\nwhere \u003clength\u003e gives the length in 8-bit characters of the \u003cuser\nname\u003e or \u003caccount number\u003e subfield.  The maximum length of \u003cuser\nname\u003e is eight characters and of \u003caccount number\u003e is four\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNWG/RFC# 399                           MCK 26-SEP-72 15:15  11917\nSMFS Login and Logout\n\n\ncharacters.  The \u003cuser name\u003e and \u003caccount number\u003e fields must\nconsist of characters chosen from the same character set as\nfilenames.\n\n\n        Logout (LGO)\n        The logout command terminates the association between the\nuser and the accounting information specified in the last LGI\ncommand issued, if any; it does not cause SMFS to close the\nconnection.  The user should then issue another LGI command\nbefore attempting any operation referencing a file.  It is not\nnecessary to issue a LGO command before issuing another LGI\ncommand, or before closing the connection.\n\n        Again, at the present time the LGO command is optional,\nand does not affect the user's ability to reference files.\n\n        The format of the LGO command is as follows:\n\n            8\n        \u003cop code\u003e\n\nThe op code for LGO is decimal 14.\n\n\n\n\n\n\n\n    [ This RFC was put into machine readable form for entry ]\n    [ into the online RFC archives by BBN Corp. under the   ]\n    [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}