{
  "series": "Request for Comments",
  "number": "480",
  "howpublished": "RFC 480",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0480",
  "url": "https://www.rfc-editor.org/info/rfc480",
  "title": "Host-dependent FTP parameters",
  "pagetotal": "1",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                     James E. White\nRFC #480                                                  SRI-ARC\nNIC #14949                                                8 March 73\n\n\n                     Host-Dependent FTP Parameters\n\nThis memo is in response to (and support of) one of the points raised by\nBob Braden (RTB) of UCLA-CCN in RFC #430, \"COMMENTS ON FILE TRANSFER\nPROTOCOL\" (see -- 13299,), namely that raised in Section D., \"Site-\nDependent FTP Parameters\".\n\nThe NIC has been confronted with similar problems (and tentatively\ndecided upon similar solutions) in designing mechanisms which would\nenable a user to use FTP to retrieve from the NIC, in sequential form, a\nVIEW of some portion for an NLS tree-structured file.\n\nTo be done without modification to FTP, this task requires the user to\ncommunicate information -- a filename, a statement address, viewspecs,\nand the name of a conversion algorithm -- to SRI-ARC's server FTP\nprocess in a manner that is transparent to the user's user FTP process.\n\nWe currently intend to require the user to embed this information in the\npathname of FTP's STOR and RETR commands by appending to a standard\nTENEX filename, a field of the form:\n\n    ;x \u003cprogram\u003e [ / \u003cparameters\u003e ]\n\nwhere \u003cprogram\u003e identifies an arbitrary program to be dispatched by\nSRI-ARC's server FTP process, with a pointer to the file being stored or\nretrieved as an argument.  \u003cparameters\u003e is optional and, if present, is\nalso passed to the program.\n\nTo store and retrieve NLS files in sequential form, we will require that\n\u003cprogram\u003e be 'NLS' and \u003cparameters\u003e be of the form.\n\n    [ T: \u003cconversion-algorithm\u003e ] [ S: \u003cstatement address\u003e ] [ V:\n    \u003cviewspecs\u003e ]\n\nwhere each of the three items is optional, and any that appear are\nseparated by commas.\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\nWhite                                                           [Page 1]\n\f\n"
}