{
  "series": "Request for Comments",
  "number": "371",
  "howpublished": "RFC 371",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0371",
  "url": "https://www.rfc-editor.org/info/rfc371",
  "title": "Demonstration at International Computer Communications Conference",
  "pagetotal": "2",
  "year": "1972",
  "month": "jul",
  "body": "\n\n\n\n\n\nNWG/ RFC #371                                       Robert Kahn\nNIC 11020                                           BBN\n                                                    12 July 1972\n\nDEMONSTRATION AT INTERNATIONAL COMPUTER COMMUNICATIONS CONFERENCE\n\n     The International Computer Communications Conference, scheduled\nfor 24-26 October 1972 at the Washington, D.C. Hilton Hotel, is a\nnewly organized conference intended to address a broad set of issues\nin the Computer Communications field.  Approximately 17 sessions are\ncurrently planned for the conference.  The social implications of this\nfield are a matter of widespread interest that reaches society in\nalmost all walks of life; education, medicine, research, business and\ngovernment.  All these areas will be affected as the field develops.\n\n     I am organizing a computer communication network demonstration to\nrun in parallel with the sessions.  This demonstration will provide\nattendees with the opportunity to gain first hand experience in the\nuse of a computer network.  The theme of the demonstration will be on\nthe value of computer communication networks, emphasizing topics such\nas data base retrieval, combined use of several machines, real-time\ndata access, interactive cooperation, simulation systems, simplified\nhard copy techniques, and so forth.  I am hoping to present a broad\nsampling of computer based resources that will provide attendees with\nsome perspective on the utility of computer communication networks.\n\n     Terminal equipment has already been offered by many different\nmanufacturers and we are beginning to home in on the application\nareas.  The plan is to deliver a TIP to the Hilton and to connect it\ninto the ARPANET.  All terminals at the Hilton will then be connected\ndirectly to the TIP.  Software resources on the ARPANET as well as\nresources in other nets that can be temporarily connected to the\nARPANET and made available for the purpose of demonstration will be\navailable.  In most cases it is possible to arrange for terminal\naccess via the ARPANET to non ARPANET sites without hardware or\nsoftware development on their part.\n\n     A significant amount of preparation by ourselves, the NIC, and\nothers is being devoted to making it convenient for naive users to sit\ndown at a terminal and effectively use \"selected\" resources without\nassistance.  This involves the generation of \"explicit\" documentation\nin easy to understand terms -- a non-trivial task.  However, we hope\nthis effort will also be useful for other application in the long run.\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNWG/RFC# 371                           REK2 12-JUL-72 9:28  11020\nDemonstration at International Computer Communications Conference\n\n\n     We need the help of sites in the network community to pitch in\nand lend a hand.  This is a large undertaking and much too big to be\npulled off without a large committment in time and energy between now\nand October.\n\n     Many of you are already active in planning for ICCC.  For those\nof you who may not yet be involved, someone will be contacting or will\nhave contacted your technical liaison in the next few days.  We hope\nyou will join us in this effort.  If you have suggestions about the\ndemo or if you want particular information about it, please send me a\nmessage via the NIC (ident REK2) or get in touch with me at BBN (617)\n491-1850 x 3401.\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}