{
  "series": "Request for Comments",
  "number": "410",
  "howpublished": "RFC 410",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0410",
  "url": "https://www.rfc-editor.org/info/rfc410",
  "title": "Removal of the 30-Second Delay When Hosts Come Up",
  "pagetotal": "2",
  "year": "1972",
  "month": "nov",
  "body": "\n\n\n\n\n\nNetwork Working Group                      John M. McQuillan\nRequest for Comments #410                  Bolt Beranek and Newman\nNIC #12402                                 10 November 1972\nCategories:  B-1\n\n\n           Removal of the 30-Second Delay When Hosts Come Up\n           -------------------------------------------------\n\n\n     The IMP currently delays accepting input from a Host for 30\nseconds after the Host has come up.  This delay serves to allow\nthe fact that the Host is up to propagate through the network.\nThe fundamental problem is that a Host must not be permitted\nto communicate with a second Host until the second Host\n(actually its IMP) has been made aware that the first Host is\nup.  Otherwise, one Host may come up and send a \"hello\"\nmessage to another Host, whose reply is discarded by the IMP\nbecause it is for a dead destination.\n\n     All this reasoning is based on a dead destination de-\ntection mechanism at the source IMP.  The 30-second delay is\nbased on the worst-case propagation delay for routing information\nin the network, so that every potential source IMP can update\nits host up/down table.  There are several drawbacks to this\nscheme:\n\n         1.  Hosts should not have to wait the worst-case time\n             of 30 seconds to send to Hosts at their IMP or\n             nearby in the network.\n\n         2.  The operation of half-duplex interfaces is made\n             even more complicated because of the startup delay.\n\n         3.  The timeout period of 30 seconds is really a\n             function of network topology and we would like to\n             be able to change it when necessary as the network\n             expands.\n\n     We propose to eliminate the 30-second delay altogether.\nThe IMP subnetwork will detect messages for a dead Host at the\ndestination IMP instead of at the source IMP.  There is no delay\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\ninvolved for an IMP to sense when its own Hosts come up, so\nthat it can always make the correct decision about whether to\ngive a message to one of its Hosts or to return a destination\ndead message to the source Host.  Under this new scheme, when-\never the IMP's ready line is up it is ready to accept input\nfrom its Hosts without delay.  Several comments on this change\nshould be noted:\n\n         1.  No change to Host software should be necessitated\n             by this change.  The Host may attempt to send a\n             message to the IMP as soon as it brings its\n             ready line up, or it may delay for a long time.  In\n             either case, the IMP will take the message.  As\n             before, as soon as the Host has brought up its\n             ready line, it must accept messages from the IMP.\n\n         2.  The Hosts may wish to remove any delays _they_ have\n             programmed into their startup routines, since\n             such delays are no longer necessary.\n\n         3.  Destination dead messages will be returned as\n             before with two differences.  There will be more\n             delay between the receipt of the message at the\n             IMP and the return of the dead destination message\n             because it must travel through the network.  For\n             the same reason, if many messages are sent to\n             dead Hosts, the dead destination messages may come\n             back out of order.\n\n     The Host personnel responsible for the IMP software at\neach site should check that this proposed change will not ad-\nversely affect them.  If no adverse comments are received,\nthis change will go into effect on Tuesday morning, December\n12 at the regular IMP software release time.\n\n\n  [ This RFC was put into machine readable form for entry ]\n  [ into the online RFC archives by BBN Corp. under the   ]\n  [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}