{
  "series": "Request for Comments",
  "number": "253",
  "howpublished": "RFC 253",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0253",
  "url": "https://www.rfc-editor.org/info/rfc253",
  "title": "Second Network Graphics meeting details",
  "pagetotal": "1",
  "year": "1971",
  "month": "oct",
  "body": "\n\n\n\n\n\nNetwork Graphics Group                  James A. Moorer\nRequest for Comments: #253              Stanford Al Laboratory\nNIC #7694                               19 October 1971\nRelated: RFC #246\nObsoletes: none\n\n                Second Network Graphics Meeting Details\n\n        Stanford will be the site of the second network graphics\nmeeting.  Attendees will be stored in the Flamingo Motel in Palo Alto\nat $8.25 a night.  The conference itself will be in the Stanford\nArtificial Intelligence Laboratory conference room.  The motel is\nroughly 2 miles from the laboratory.  Monday night, November 22, a\nchinese banquet will be offered at the Golden Pavillion restaurent in\nLos Altos at $7.20 a plate.  Any attendees are welcome to invite\nnon-network guests if desired.  Attendees will please notify Stanford\nas soon as possible and indicate the following:\n\n1) Your name.\n2) Your affiliation (site).\n3) Whether you will need a room.\n4) Whether you will attend the banquet.\n5) Whether you will be renting a car.  This is for setting up\ntransportation pools.\n6) Whether you will give a talk and if so, how long it will be and\nwhat audio-visual devices will be needed.\n\n        This information may be transmitted to me or to the\nsecretaries who are supposed to know about the conference and will\ntake the data.  The phone number here is (405) 321-2300, extension\n4971.  I will try to get maps out to all the non-resident attendees as\nthey register.  Latest withdrawal date for the banquet and room\nreservations will be November 18 and will be considered bound after\nthat date.\n\n        The conference will convene at 6:00 PM Pacific time on\nSunday, November 21, and end at noon on Tuesday, November 23.\n\n\n\n\n      [ This RFC was put into machine readable form for entry ]\n      [ into the online RFC archives by BBN Corp. under the   ]\n      [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}