{
  "series": "Request for Comments",
  "number": "462",
  "howpublished": "RFC 462",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0462",
  "url": "https://www.rfc-editor.org/info/rfc462",
  "title": "Responding to user needs",
  "pagetotal": "2",
  "year": "1973",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 Jean Iseli (MITRE)\nRFC # 462                                        Dave Crocker (UCLA-NMC)\nNIC # 14434                                            February 22, 1973\n\n\n                        Responding to User Needs\n\n\nINTRODUCTION\n\nThe ARPANET is currently undergoing a transition to an environment in\nwhich network resources will be made available to a larger user base.\nThis emergent user base already contains a significant number of\nterminal users not associated with a server site.  Information relative\nto network host services and access characteristics is needed to\nencourage and assist new users.\n\nTo date, the Resources Notebook has been the primary outlet for efforts\nto provide users with Network-wide information. A separate RFC, from the\nNIC, discusses the past and current history more completely. In this\nRFC, we would like to second the NIC's suggestion for the formation of a\nWorking Group concerned with User Information and Services, and we would\nlike to offer a specific suggestion for consideration at the NIC's\nproposed meeting.\n\n\nPROPOSAL\n\nMany of the problems associated with the lack of adequate Network\ninformation are caused by the many compilation steps. Too many resources\n(most of them human) are required. In addition to delay, errors are\nintroduced. Part of the solution is to place the acquisition of basic\ninformation closer to the source and make the source responsible for the\nacquisition and maintenance.\n\n    The \"source\" is distributed around the Network and, therefore, the\n    proposal is to develop and implement a distributed and extensible\n    network data-base which contains the desired information.  This\n    would require each server site to create and maintain an information\n    file locally and/or at the NIC. As a further (more down stream)\n    step, a mechanism to access these files could be specified and\n    implemented.\n\n        People at different sites would thereby be able to use the tools\n        most comfortable and accessible to them.\n\n\n\n\n\n\nIseli \u0026 D. Crocker                                              [Page 1]\n\f\nRFC 462                 Responding to User Needs           February 1973\n\n\n        An interesting technical issue involves making the disparate\n        files accessible by an automaton.  The NIC is currently\n        attempting to smooth out the interface between NLS and non-NLS\n        files, and this seems like a reasonable object for such efforts.\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIseli \u0026 D. Crocker                                              [Page 2]\n\f\n"
}