{
  "series": "Request for Comments",
  "number": "312",
  "howpublished": "RFC 312",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0312",
  "url": "https://www.rfc-editor.org/info/rfc312",
  "title": "Proposed Change in IMP-to-Host Protocol",
  "pagetotal": "2",
  "year": "1972",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 A. McKenzie\nRFC #312                                              BBN\nNIC 9342                                              22 March 1972\nCategories:  B.1\n\n                Proposed Change in IMP-to-Host Protocol\n\n        We are currently considering a redefinition of the IMP-to-Host\n   error message types (type 1 and type 8) and the creation of addi-\n   tional IMP-to-Host error message types.  We believe that these\n   changes will assist the Hosts in determining appropriate recovery\n   action, without causing any serious reprogramming problems.  Our\n   current plans are to install these changes within a few months;\n   therefore we should be informed of any strong negative reactions\n   relatively quickly.\n\n        The proposed changes fall into two general classes as de-\n   scribed below:\n\n        A)  General Error Message\n            ---------------------\n\n            Under certain circumstances, particularly when the Host\n            has been unresponsive to queued input for a \"long time\"\n            the IMP drops its ready line for a short period, causing\n            the \"error flip-flops\" to be set (see RFC #270, NIC 7818).\n            Under these conditions the IMP sends a few NOP's to the\n            Host and then resumes normal operation.  We propose to\n            send the Host a new message (message type 13) in addition\n            to the NOPs; this message will tell the Host that the\n            IMP's Ready Line was dropped, that the IMP's error flop\n            was set, and that the IMP will respond to the next com-\n            pletion of a Host-to-IMP message with a type 1 or type 8\n            message (because of the setting of the IMP's error flop.\n\n        B)  Error Messages which are Responses to Specific\n            ----------------------------------------------\n            Host-to-IMP Transmissions:\n            --------------------------\n\n            1)  IMP-to-Host message type 1 will be redefined to mean:\n                \"IMP's Error flip-flop was set on a message which\n                the IMP cannot identify.\"\n\n            2)  IMP-to-Host message type 8 will be redefined to mean:\n                \"IMP's Error flip-flop was set during receipt of the\n                message identified by the 'source' and 'link number'\n                bits of this error message.\"\n\n\n\n                                                                [Page 1]\n\f\n            3)  IMP-to-Host message type 10 will be defined to mean:\n                \"A Host-to-IMP message was too short (and cannot be\n                identified).\"\n\n            4)  IMP-to-Host message type 11 will be defined to mean:\n                \"A Host-to-IMP message was too long; the message is\n                identified by the 'source' and 'link number' bits\n                of this error message.\"\n\n            5)  IMP-to-Host message type 12 will be defined to mean:\n                \"A Host-to-IMP message with an illegal message type\n                code was received; the message is identified by the\n                'source' and 'link number' bits of this error message.\n                (Note that the erroneous type code is not included in\n                the error message.)\"\n\n\n\n\n   AAM/jm\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}