{
  "series": "Request for Comments",
  "number": "2",
  "howpublished": "RFC 2",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0002",
  "url": "https://www.rfc-editor.org/info/rfc2",
  "title": "Host software",
  "pagetotal": "10",
  "year": "1969",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        Bill Duvall\nRequest for Comments: 2                                              SRI\n\n\n                            [unknown title]\n\n\n[page 1 missing]\n\n1 LINKS\n\n   1a Control Links\n\n      1a1 Logical link 0 will be a control link between any two HOSTs on\n      the network\n\n         1a1a Only one control link may exist between any two HOSTs on\n         the network. Thus, if there are n HOSTs on the network, there\n         are n-1 control links from each HOST.\n\n      1a2 It will be primarily used for communication between HOSTs for\n      the purposes of:\n\n         1a2a Establishing user links\n\n         1a2b Breaking user links\n\n         1a2c Passing interrupts regarding the status of links and/or\n         programs using the links\n\n         1a2d Monitor communication\n\n      1a3 Imps in the network may automatically trace all messages sent\n      on link 0.\n\n   1b Primary Links\n\n      1b1 A user at a given HOST may have exactly 1 primary link to each\n      of the other HOSTs on the network.\n\n         1b1a The primary link must be the first link established\n         between a HOST user and another HOST.\n\n         1b1b Primary links are global to a user, i.e. a user program\n         may open a primary link, and that link remains open until it is\n         specifically closed.\n\n\n\n\n\nDuvall                                                          [Page 1]\n\f\nRFC 2\n\n\n         1b1c The primary link is treated like a teletype connected over\n         a normal data-phone or direct line by the remote HOST, i.e. the\n         remote HOST considers a primary link to be a normal teletype\n         user.\n\n         1b1d The primary link is used for passing (user) control\n         information to the remote HOST, e.g. it will be used for\n         logging in to the remote host (using the remote hosts standard\n         login procedure).\n\n   1c Auxilliary Links\n\n      1c1 A user program may establish any number of auxilliary links\n      between itself and a user program in a connected HOST.\n\n         1c1a These links may be used for either binary or character\n         transmission.\n\n         1c1b Auxilliary links are local to the sub-system which\n         establishes them, and therefore are closed when that subsystem\n         is left.\n\n2 MANIPULATION OF LINKS\n\n   2a Control links\n\n      2a1 The control link is established at system load time.\n\n      2a2 The status of a control link may be active or inactive\n\n         2a2a The status of the control link should reflect the\n         relationship between the HOSTs.\n\n   2b Primary Links\n\n      2b1 Primary links are established by a user or executive call to\n      the monitor\n\n         2b1a The network identification number of the HOST to be linked\n         to must be included in the call\n\n         2b1b An attempt to establish more than one primary link to a\n         particular HOST will be regarded as an error, and the request\n         will be defaulted\n\n         2b1c Standard Transmission Character Set\n\n\n\n\n\nDuvall                                                          [Page 2]\n\f\nRFC 2\n\n\n            2b1c1 There will be a standard character set for\n            transmission of data over the primary links and control\n            links.\n\n               2b1c1a This will be full (8 bit) ASCII.\n\n         2b1d (get link) The protocol for establishing a link to HOST B\n         from HOST A is as follows\n\n            2b1d1 A selects a currently unused link to HOST B from its\n            allocation tables\n\n            2b1d2 A transmits a link-connect message to B over link 0.\n\n            2b1d3 A then waits for:\n\n               2b1d3a A communication regarding that link from B\n\n               2b1d3b A certain amount of time to elaspse\n\n            2b1d4 If a communication regarding the link is received from\n            B, it is examined to see if it is:\n\n               2b1d4a A verification of the link from B.\n\n                  2b1d4a1 This results in a successful return from the\n                  monitor to the requestor. The link number is returned\n                  to the requestor, and the link is established.\n\n               2b1d4b A request from B to establish the link. This\n               means: that B is trying to establish the same link as A\n               independently of A.\n\n                  2b1d4b1 If the network ID number of A(Na) is greater\n                  than that of B(Nb), then A ignores the request, and\n                  continues to await confirmation of the link from B.\n\n                  2b1d4b2 If, on the other hand, Na\u003cNb, A:\n\n                     2b1d4b2a Honors the request from B to establish the\n                     link,\n\n                     2b1d4b2b Sends verification as required,\n\n                     2b1d4b2c Aborts its own request, and repeats the\n                     allocation process.\n\n\n\n\n\nDuvall                                                          [Page 3]\n\f\nRFC 2\n\n\n               2b1d4c Some other communication from B regarding the\n               link.\n\n                  2b1d4c1 This is an error condition, meaning that\n                  either:\n\n                     2b1d4c1a A has faulted by selecting a previously\n                     allocated link for allocation,\n\n                     2b1d4c1b B is transmitting information over an un-\n                     allocated link,\n\n                     2b1d4c1c Or a message regarding allocation from B\n                     to A has been garbled in transmission.\n\n                  2b1d4c2 In this case, A's action is to:\n\n                     2b1d4c2a Send a link disconnect message to B\n                     concerning the attempted connection\n\n                     2b1d4c2b Consider the state of HOST B to be in\n                     error and initiate entry to a panic routine(error).\n\n               2b1d5 If no communication regarding the link is received\n               from B in the prescribed amount of time, HOST B is\n               considered to be in an error state.\n\n                  2b1d5a A link disconnect message is sent to B from A.\n\n                  2b1d5b A panic routine is called(error).\n\n   2c Auxilliary Links\n\n      2c1 Auxilliary links are established by a call to the monitor from\n      a user program.\n\n         2c1a The request must specify pertinent data about the desired\n         link to the monitor\n\n            2c1a1 The number of the primary link to B.\n\n         2c1b The request for an auxilliary link must be made by a user\n         program in each of the HOSTs (A and B).\n\n         2c1c If Na \u003e Nb, then HOST A proceeds to establish a link to\n         HOST B in the manner outlined above (getlink).\n\n\n\n\n\nDuvall                                                          [Page 4]\n\f\nRFC 2\n\n\n         2c1d If Na\u003cNb, then A waits:\n\n            2c1d1 For HOST B to establish the link (after looking to see\n            if B has already established the corresponding link).\n\n            2c1d2 For a specified amount of time to elapse.\n\n               2c1d2a This means that HOST B did not respond to the\n               request of HOST A.\n\n               2c1d2b The program in HOST A and B should be able to\n               specifiy the amount of time to wait for the timeout.\n\n3 ERROR CHECKING\n\n   3a All messages sent over the network will be error checked initally\n   so as to help isolate software and hardware bugs.\n\n   3b A checksum will be associated with each message, which is order\n   dependent.\n\n      3b1 The following algorithm is one which might be used:\n\n         3b1a A checksum of length 1 may be formed by adding successive\n         fields in the string to be checked serially, and adding the\n         carry bit into the lowest bit position of the sum.\n\n              +--------------+\n              |              |\n              +---FIELD 1----+\n\n          ADD +--------------+\n              |              |\n              +----FIELD 2---+\n\n            +-+--------------+\n            | |              |\n            +-+--------------+\n              \\\n               \\          +--+\n          ADD   CARRY---\u003e |  |\n                          +--+\n\n              +--------------+\n              |              |\n              +----RESULT----+\n\n            3b1a1 This process is known as folding.\n\n\n\nDuvall                                                          [Page 5]\n\f\nRFC 2\n\n\n            3b1a2 Several fields may be added and folded in parallel, if\n            they are folded appropiately after the addition.\n\n              +---------+---------+---------+---------+\n              | FIELD 4 | FIELD 3 | FIELD 2 | FIELD 1 |\n              +---------+---------+---------+---------+\n\n              +---------+---------+---------+---------+\n              | FIELD 8 | FIELD 7 | FIELD 6 | FIELD 5 |\n              +---------+---------+---------+---------+\n            ADD\n            +-+---------+---------+---------+---------+\n            | |         |         |         |         |\n            +-+---------+---------+---------+---------+\n             |      |        |         |         |\n             |      |        |         |         v\n             |      |        |         |    +---------+\n             |      |        |         |    |         |\n             |      |        |         |    +---------+\n             |      |        |         |\n             |      |        |         \\    +---------+\n             |      |        |          `-\u003e |         |\n             |      |        |              +---------+\n             |      |        |\n             |      |        \\              +---------+\n             |      |         `-----------\u003e |         |\n             |      |                       +---------+\n             |      |\n             |      \\                       +---------+\n             |       `---------------------\u003e|         |\n             |                              +---------+\n             |\n             \\                                    +---+\n              `-----CARRY------------------------\u003e|   |\n                                                  +---+\n                                  ADD\n                                  +---------+---------+\n                                  |         |         |\n                                  +--CARRY--+---------+\n                                       |\n                                       \\        +-----+\n                                    ADD `-----\u003e |     |\n                                                +-----+\n\n                                            +---------+\n                                            |         |\n                                            +-RESULT--+\n\n\n\n\nDuvall                                                          [Page 6]\n\f\nRFC 2\n\n\n                  3b1a2a Using this scheme, it is assumed that, if there\n                  are n fields, the carries from the first n-1 fields\n                  are automatically added into the low order position of\n                  the next higher field, so that in folding, one need\n                  only add the [n] result fields to the carry from the\n                  nth field, and then add in an appropiately sized carry\n                  from that addition (and repeat the desired number of\n                  times to achieve the result.\n\n            3b1a3 A checksum computed in this manner has the advantage\n            that the word lengths of different machines may each be used\n            optimally:\n\n               3b1a3a If a string of suitable length is chosen for\n               computing the checksum, and a suitable checksum field\n               length is selected, the checksum technique for each of\n               the machines will be relatively optimal.\n\n                  3b1a3a1 Field length: 288 bits (lowest common\n                  denomenator of (24,32,36)\n\n                  3b1a3a2 Checksum length: 8 bits (convenient field size\n                  for all machines)\n\n         3b1b If a message is divided into groups of fields, and each\n         group is checksummed in this manner, an order dependent\n         checksum may be got by shifting the checksum for each group,\n         and adding it in (successively) to the checksum of the next\n         group\n\n   3c A facility will be provided where two HOSTs may enter a mode which\n   requires positive verification of all messages. This verification is\n   sent over the control link.\n\n4 MONITOR FUNCTIONS\n\n   4a Network I/O drivers\n\n      4a1 Input\n\n         4a1a Input message from IMP.\n\n         4a1b Do error checking on message.\n\n            4a1b1 Verify checksum,\n\n            4a1b2 Send \"message recieved\" aknowledgement over control\n            link if aknowledge mode is in effect.\n\n\n\nDuvall                                                          [Page 7]\n\f\nRFC 2\n\n\n         4a1c (trans)character translation\n\n            4a1c1 There is a strong possibility that the character\n            translation may be done in the IMP.\n\n            4a1c2 This needs to be explored further with BBN.\n\n            4a1c3 There are two main considerations\n\n               4a1c3a Should the translation be done by table or\n               algorithm?\n\n                  4a1c3a1 Initially it seems as though the best way to\n                  go is table.\n\n               4a1c3b How should we decide which messages should be\n               translated, i.e. is it desirable to not translate\n               everything (YES!!) and by what means can we use to\n               differentiate?\n\n         4a1d Decode header, and pass message to correct recipient as\n         identified by source, and link.\n\n      4a2 Output\n\n         4a2a Build header\n\n         4a2b Character translation\n\n            4a2b1 See remarks under the section on output translation\n            (trans).\n\n         4a2c Create checksum\n\n         4a2d Check status of link\n\n            4a2d1 If there has not been a RFNM since the last message\n            transmitted out the link, wait for it.\n\n         4a2e Transmit message to IMP\n\n         4a2f If aknowledge mode is in effect,wait for\n\n            4a2f1 RFNM from destination IMP.\n\n            4a2f2 Response from destination HOST over control line 0.\n\n\n\n\n\nDuvall                                                          [Page 8]\n\f\nRFC 2\n\n\n   4b Network status\n\n      4b1 Maintain status of other HOSTs on network\n\n         4b1a If an IMP is down, then his HOST is considered to be down.\n\n      4b2 Maintain status of control lines.\n\n      4b3 Answer status queries from other HOSTs.\n\n      4b4 Inform other HOSTs as to status of primary and auxilliary\n      links on an interrupt basis.\n\n      4b5 Inform other HOSTs as to status of programs using primary and\n      secondary links\n\n5 EXECUTIVE PRIMITIVES\n\n   5a Primary Links\n\n      5a1 These require the HOST number as a parameter.\n\n         5a1a Establish primary link\n\n         5a1b Connect controlling teletype to primary link\n\n         5a1c INPUT/OUTPUT over primary link\n\n         5a1d Interrogate status of primary link\n\n            5a1d1 Don't know what, exactly, this should do, but it seems\n            as though it might be useful.\n\n         5a1e Disconnect controlling teletype from primary link\n\n         5a1f Kill primary link\n\n   5b Auxilliary Links.\n\n      5b1 Establish auxilliary link.\n\n         5b1a requires the HOST number as a parameter\n\n         5b1b It returns a logical link number which is similar to a\n         file index. It is this number which is passed to all of the\n         other Auxilliary routines as a parameter.\n\n      5b2 INPUT/OUTPUT over auxilliary link\n\n\n\nDuvall                                                          [Page 9]\n\f\nRFC 2\n\n\n      5b3 Interrogate status auxilliary link.\n\n         5b3a Don't know what, exactly, this should do, but it seems as\n         though it might be useful.\n\n      5b4 Kill auxilliary link.\n\n   5c Special executive functions\n\n      5c1 Transparent. INPUT/OUTPUT over link\n\n         5c1a This may be used to do block I/O transfers over a link\n\n         5c1b The function of the monitor in this instance is to\n         transfer a buffer directly to its IMP\n\n         5c1c At does not modify it in any way\n\n            5c1c1 This means that the header and other control\n            information must be in the buffer.\n\n         5c1d The indended use of this is for network debugging.\n\n6 INITIAL CHECKOUT\n\n   6a The network will be initially checked out using the links in a\n   simulated data-phone mode.\n\n      6a1 All messages will be one character in length.\n\n      6a2 Links will be transparent to the monitor, and controlled by\n      user program via a special executive primitive.\n\n         6a2a The initial test will be run from two user programs in\n         different HOSTs, e.g. DDT to DDT.\n\n         6a2b It will be paralleled by a telephone link or similar.\n\n\n           [  This RFC was put into machine readable form for entry  ]\n           [  into the online RFC archives by Robbie Bennet 10/1998  ]\n           [  This RFC was nroffed by Kelly Tardif, Viagenie 10/1999 ]\n\n\n\n\n\n\n\n\n\nDuvall                                                         [Page 10]\n\f\n"
}