{
  "series": "Request for Comments",
  "number": "131",
  "howpublished": "RFC 131",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0131",
  "url": "https://www.rfc-editor.org/info/rfc131",
  "title": "Response to RFC 116: May NWG meeting",
  "pagetotal": "3",
  "year": "1971",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                  E. Harslem - Rand\nRequest For Comments: 131                              J. Heafner - Rand\n                                                              April 1971\n\n\n                 Response to RFC #116 (May NWG Meeting)\n\nPhase One\n\nSoftware Status of 360/65\n\n     1) Our software is currently being changed to reflect the new NCP\nprotocol delineated in RFC #107.  These changes will be completed\nbefore the end of May.\n\n     2) We are implementing a logger that, after an automatic ICP\ndialog, can be driven from a local console.  Any desirable messages\ncan be sent or received in EBCDIC, ASCII (8), or as binary streams.\nThe purpose of the logger is to allow sites to checkout remote log in\nprocedures.  Since no production-oriented services will be offered on\nthe 360/65, the logger is for experimental purposes only.  It will be\ncompleted before the end of May.\n\n     3) We have not planned a TELNET. We will, however, implement both\nserver and user TELNETs once a specification is generally accepted.\nImplementation time will be on the order of two weeks.\n\nTransition from 360/65 to PDP-10\n\n     1) We plan to move from our 360/65 to a PDP-10.  Rand will offer\nNetwork services on the PDP-10.  The hardware and software status of\nthe PDP-10 will be reported later.\n\n     2) The 360/65 Network connection will remain for some time due to\nits production use by another ARPA-sponsored project at Rand.\nMaintenance of the 360/65 Network software will be provided for the\nlifetime of the connection but no new programs will be developed on\nthe 360/65 after September.\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNetwork Related Activities\n\n     1) The UCSB/Rand Network activities were recently reported in RFC\n#113 and earlier in RFC #78.  The Climate Dynamics Project (CDP) at\nRand will continue to use this facility (more heavily) in the future.\n\n     2) In conjunction with the above facility, the Rand Network team\nhas planned and implemented a front-end graphics program to allow the\nreduced data from UCSB to be displayed and interacted with locally as\ngraphs, contours, plots, and lists.  This will be used in about three\nmonths after an intermediate program, being written by the CDP\npersonnel, is completed.\n\nPhase Two\n\nExperimental Data Reconfiguration Service (Form Machine)\n\n     1) A working session was held recently at Rand on the Data\nreconfiguration Service (DRS), the results of which have been drafted\nand are being edited by the participants.  These data will be\npublished soon as an RFC.  Eric Harslem will be prepared to make an\noral report at the NWG meeting on the DRS.\n\nProtocol Manager\n\n     1) We plan to submit a positional paper on a proposed Protocol\nManager, which will allow flexibility in both experimental and\nproduction use of connection protocols.  This will be presented as a\nRequest for Comments on a software package that Rand intends to\nimplement for its use on the PDP-10.  For example, it should obviate a\nfixed logger on our forthcoming PDP-10.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nPhase Three\n\nComments on Goals and Organization of the NWG\n\n     1) We have been proponents of the collective NWG as a forum to\nraise issues and as a general information transfer mechanism of what\nsites are doing and thinking.  More recently small working groups and\ncommittees have been formed to generate particular specifications such\nas TELNET, the new NCP protocol, etc.  We favor continuance of these\nmethods as long as any site with a willingness, an interest, and\ncontribution is not excluded from any group or committee.  We feel\nthat these groups will limit themselves to a small functional size a\npriori because they are directed toward special interests.\n\n     The long lead time between the formation of such a group and\ntheir final output (and subsequent implementation of the plan) has\nbeen accepted by the NWG Technical Chairman and is rather\ndisconcerting.  The NCP glitch cleaning committee is an example of\nexpedient work. UTAH, for example, has already implemented the new NCP\nprotocol.  Other groups (including the DRS) have not been as\nresponsive.  Perhaps the technical problems addressed by other groups\nare more complex and the needs for their solutions are not as\nimmediate as the NCP glitches.  We offer no nice solution except that\nperhaps some guidelines should be established concerning timely\npublication of reports.\n\n     2) Regarding long range goals of the NWG, we do not think that\nthe NWG is the right body to establish the long range goals.  By long\nrange goals of the NWG, we are really concerned (in part) with long\nrange goals of the Network.  We feel that the Principal Investigators\nare in a position to have a better perspective of long range Network\ngoals than the NWG members.  As a suggestion, one way of converting\ntheir views into NWG tasks is to have the NWG Technical Chairman host\na one day opinion session of the Principal Investigators, then report\nthese views to the NWG for the generation of their implied tasks.\n\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Jim Thompson 4/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n"
}