{
  "series": "Request for Comments",
  "number": "130",
  "howpublished": "RFC 130",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0130",
  "url": "https://www.rfc-editor.org/info/rfc130",
  "title": "Response to RFC 111: Pressure from the chairman",
  "pagetotal": "1",
  "year": "1971",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                         J. Heafner\nRequest for Comments: 130                                           Rand\nNIC 5848                                                   22 April 1971\n\n\n           RESPONSE TO RFC #111 (PRESSURE FROM THE CHAIRMAN)\n\n   The purpose of RFC #111, as I interpret it, is two-fold:  1) To\n   establish realistic implementation schedules and to make them known\n   to the Network community so as to expedite everyone's planning of\n   productive use of Network Services.  2) To uncover implementation\n   techniques and strategies that were most successful and might be\n   useful in future implementations.\n\n   RFC #111 asks for implementation schedules.  I have not \"prodded\"\n   host teams yet because an integral part of those schedules includes\n   TELNET for which no specification is known to everyone.  Tom\n   O'Sullivan, Raytheon (TELNET Chairman) and John Melvin, SRI (TELNET\n   Committee Member) advise me that a TELNET RFC will be generated soon.\n   I will subsequently contact site liaisons concerning a schedule.\n\n   I will talk with Alex McKenzie, BBN about the form of publication of\n   these schedules.  Alex and I agree that they should be published as\n   an RFC updating NIC Memo #5767 (ARPA Network Site Status).  I will\n   collect and compile the information via phone, mail or NIC and send\n   it to Alex for technical editing and subsequent NIC RFC publication.\n\n   Alex informed me that the forthcoming Resource Notebook (see NIC\n   #5760) includes much of the information on use of services, obtaining\n   job numbers, etc.  RFC #111 schedules will be an update of NIC #5767\n   and may reference, but will not duplicate, the Resource Notebook.\n\n   One begins to wonder why I'm in this loop since Alex has the\n   responsibility to periodically update NIC #5767.  The reason, as RFC\n   #111 states, is that Rand will assist in testing implementations\n   remotely.  To facilitate testing, I would like first-hand information\n   on schedules and comments on how we might be of service in this\n   respect.  Testing will be short-term and will not go beyond what is\n   included in RFC #111.  I will contact site liaisons shortly to find\n   out if and how we can be of assistance in this capacity.\n\n   Please feel free to contact either me or Eric Harslem regarding this\n   RFC or RFC #111.\n\n\n        [ This RFC was put into machine readable form for entry]\n      [into the online RFC archives by Alison M. De La Cruz 12/00]\n\n\n\n\nHeafner                                                         [Page 1]\n\f\n"
}