{
  "series": "Request for Comments",
  "number": "113",
  "howpublished": "RFC 113",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0113",
  "url": "https://www.rfc-editor.org/info/rfc113",
  "title": "Network activity report: UCSB Rand",
  "pagetotal": "2",
  "year": "1971",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                      5 April 1971\nRequest for Comments: 113                  E. F. Harslem\nNIC 5820                                   J. F. Heafner\n                                           J. E. White\n\n\n               NETWORK ACTIVITY REPORT:  UCSB \u003c- -\u003e RAND\n\nUCSB RJE/RJOR\n\n      The UCSB Remote Job Entry (RJE) and Remote Job Out- put\nRetrieval (RJOR) Systems described in NWG/RFC #105 have been used and\nvalidated from Rand.  The facility is now being used on a limited\nbasis as a production tool by another research group at Rand.\n     Access to the UCSB facility from Rand is through the Network\nService Program (NSP).  This program is driven by Rand Video-Graphic\nconsoles and allows a console user access to both local file storage\n(at Rand) and to the Network. A small module (UCSBMGR) was added to\nNSP to handle the UCSB RJE and RJOR protocols and data formats.\n     In exercising the RJE/RJOR facility over the past two months,\ntypical job sizes included input decks of 800 to 2800 80-character\ncard images and output files of about 30 pages of printer linstings.\n\nNETWORK OBSERVATIONS\n\n     In sending files to UCSB we did a timing study over several\ntransmissions of the above mentioned 2800 record file.  On the average\nthis file was transmitted at a rate of 250 80-character cards per\nminute.  (Each 80-character card was a separte Network message.)  This\nis, of course, much less than the advertised 30 kilobit rate; however,\nit should be remembered that the path from Rand to UCSB is through at\nleast one intermediate IMP.  On the other hand, the processes at each\nend of the connection were running at maximum priority with very small\nloads on either machine.  An obvious area for speed-up would be the\nblocking of card images for network transmission.\n     In the course of the last two months of networking, we have\nnoticed approximately five serious failures in transmitted messages.\nIn two instances, the RFNM on the control link from UCSB to Rand was\nlost.  Its loss was not reported via a type 9 IMP-to-Host message as\nwould be expected.  We have not been able to cause the problem to\noccur; hence we are unable to ascertain whether it is an IMP problem\nor a problem with the UCSB Host Interface.\n     The other three errors were related to the garbling of a data\nmessage between the Rand NSP and UCSB RJE.  In all three instances, it\nwas the second card image trans- ferred to RJE.  We were unable to\ncause this problem at will; hence have been unable to track it down.\nUnfortun- ately the HASP system at USCB merely ignored this image\nrather than printing it so we are not aware of the nature nor source\n\n\n\n                                                                [Page 1]\n\f\nof the garbling.  It could be anywhere from the disk file storage at\nRand on down the line.  This problem was observed sporadically in our\nearly trans- missions to UCSB and has disappeared.  We feel relatively\nconfident, however, that our Host software on either end was not at\nfault.\n     Lest these last two figures seem too terrifying, it should be\nnoted that we have run over 100 jobs at UCSB from Rand, each job\nconsisting of many Network transmissions.\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Simone Demmel 4/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}