{
  "series": "Request for Comments",
  "number": "385",
  "howpublished": "RFC 385",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0385",
  "url": "https://www.rfc-editor.org/info/rfc385",
  "title": "Comments on the File Transfer Protocol",
  "pagetotal": "6",
  "year": "1972",
  "month": "aug",
  "body": "\n\n\n\n\n\nNWG/RFC 385                                       Abhay K. Bhushan\nNIC 11357                                                  MIT-MAC\nUpdates: RFC 354                                  August 18, 1972\nRFC 354\n\n            COMMENTS ON THE FILE TRANSFER PROTOCOL (RFC 354)\n            ------------------------------------------------\n\n   The following comments pertain to the File Transfer Protocol, NWG/RFC\n   354.  The comments include errata, further discussion, emphasis\n   points, and additions to the protocol.  I shall incorporate these\n   comments into the main protocol document after we have had sufficient\n   experience.\n\n   1. Please note the following corrections:\n       (i)    Page 2, line 15:  replace user-FTP by server-FTP.\n       (ii)   Page 3, line 12:  replace III.A by III.C.\n       (iii)  Page 15, last para, line 1:  replace user s by user is.\n       (iv)   Page 28, line 21:  replace _CRCRLF_ by _CRLF_.\n       (v)    Page 27, line 10:  replace 451,451 by 451.\n       (vi)   Note that on Page 26, line 15 mode code is S|B|T|H.\n\n   2. The language of RFC 354 reads that it is recommended for\n      hosts to implement the default parameters.  The sense of the\n      word recommended should be taken as required.  Thus the\n      required minimum implementations for FTP servers is:\n\n           Type - ASCII (8-bit bytes)\n           Mode - Stream\n           Structure - File\n           Commands - RETR, STOR, USER (and PASS), SOCK and BYE\n\n   3. The \"Print File-ASCII\" and \"EBCIDIC Print File\" types are\n      incorrectly specified (pages 10 and 11, RFC 354).  The real\n      problem with print files is of ASA (Fortran) vertical format\n      control.  Instead of the two print file types, there should\n      really be three types as described below:\n\n           BCDIC - The sender transfers data using the EBCDIC\n                    character code and 8-bit transfer byte size.\n                    The _CRLF_ convention is used for vertical format\n                    control.  This type will be used for efficient\n                    transfer of EBCDIC files between systems which\n                    use EBCDIC for their internal character\n                    representation.\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNWG/RFC 385 Page 2\n\n\n           ASCII with ASA vertical format Control - This is the\n                    \"Print file-ASCII\" defined in RFC 354.  The\n                    server is to transform the data in accordance\n                    with ASA (Fortran) vertical format control\n                    procedures for printing on printers that\n                    still use this standard.  The data is to be\n                    transferred as 8-bit bytes.\n\n           EBCDIC with ASA vertical format control - This is the\n                    EBCDIC Print File defined in RFC 354.  The\n                    server is to transform the data in accordance\n                    with ASA (Fortran) vertical format control\n                    standards but using the EBCDIC character code.\n                    The data is to be transferred in 8-bit bytes.\n\n      The new types are to be denoted by symbols E for EBCDIC, P\n      for Print file-ASCII and F for Formatted (ASA standard)\n      EBCDIC print file.  A discussion of the ASA vertical format\n      control appears in NWG/RFC 189, Appendix C, and in\n      Communications of the ACM, Vol 7, No. 10, p. 606, October\n      1964.  According to the ASA vertical format control\n      standards, the first character of a formatted record is not\n      printed but determines vertical spacing as follows:\n\n           Character    Vertical Spacing before printing\n           ---------    --------------------------------\n            Blank          One line\n              0            Two lines\n              1            To first line of next page\n              +            No advance\n\n      In addition to the above four, there are more characters\n      (defined in Appendix C, RFC 189) which represent an IBM\n      extension to the ASA standard.\n\n   4. A comparison of \"stream\" and \"text\" modes is in order.  The\n      advantages of \"stream\" mode are:\n           1) The receiver need not scan the incoming bytes.\n           2) It is usable with all data types.\n\n      The disadvantages are:\n           1) The EOF by closing the connection is not reliable.\n\n           2) The EOR by ASCII _CRLF_ is unreliable as the _CRLF_\n              really may be valid data rather than an EOR.  It is\n              an EOR only if the sender and receiver have a _prior_\n              agreement to that effect.\n\n\n\n\n                                                                [Page 2]\n\f\nNWG/RFC 385 Page 2\n\n\n   5. In the Block mode the protocol states that left-most bits not\n      containing information should be zero.  It appears that some\n      sites have difficulty sending null bytes in the beginning of\n      a block.  Since it is really not necessary for these bytes to\n      be zero, these bits are now defined to be \"don't care\" bits.\n\n   6. In the use of block mode it is possible for two or more\n      conditions requiring different descriptor codes (suspected\n      errors and either end of record or end of file) to exist\n      simultaneously.  Such a possibility may be handled by sending\n      a separate EOR or EOF block with a zero byte count (this is\n      allowed by the protocol).  Also it should be noted that an\n      EOF is an implicit EOR.\n\n   7. It needs to be emphasized again that the user-FTP must\n      \"listen\" on the data socket prior to sending a command\n      requiring a file transfer.  Specifically the user-FTP should\n      not wait for a 255 reply (server data socket) before doing\n      the \"listen\".  (The security check may be come later, as the\n      data connection can be closed if connection is to a socket\n      other than that specified by the 255 reply).  Although the\n      protocol suggests that the 255 reply would be sent before\n      making the connection, it does not guarantee that the 255\n      reply would arrive before the initiating RFC at the user\n      site.  The above argument also applies to receiving a a close\n      (NCP-CLS) on the data connection before receiving a reply\n      indicating the reason for the close (note assertion on page\n      24, paragraph 3, RFC 354).\n\n   8. Although the protocol does not restrict closing or leaving\n      open the data connection in Block and Text modes, it should\n      be emphasized that the closing of the data connection, if it\n      is to be done at all, should be done immediately after the\n      file transfer rather than just after a new transfer command\n      is received.  This is because the server and user may have to\n      test whether the data connection is open or not before doing\n      a \"listen\" or an \"init\" respectively.\n\n   9. It should be emphasized again that 'Type' supersedes 'Byte',\n      and that the TYPE command should be sent before the BYTE\n      command.\n\n   10. It should be noted that both upper and lower case alphabetic\n       characters are to be treated identically in the command\n       syntax.  This applies also to the symbols for type, mode,\n       and structure.  For example, 'A' and 'a' both indicate ASCII\n       type.\n\n\n\n\n                                                                [Page 3]\n\f\nNWG/RFC 385 Page 2\n\n\n   11. It should be noted that in the 'LIST' command, the data\n       transfer is over the data connection in type ASCII.\n\n   12. The following reply code is to be added:\n\n               454 FTP:  Cannot connect to your data socket.\n\n       This is a fail response any of the commands requiring data\n       transfer (including RETR, STOR, APPE, and LIST)\n\n   13. Rather than use the append command for sending mail files, a\n       new command 'MLFL' (for mail file) is defined.  The syntax\n       of the mail file command is:\n\n               MLFL \u003cuser\u003eCRLF\n               where\n               \u003cuser\u003e ::= \u003cempty\u003e| \u003cNIC ident\u003e| \u003csys ident\u003e\n\n       If the user field is empty or blank (one or more spaces),\n       then the mail is destined for a printer or other designated\n       place for site mail.  \u003cNIC ident\u003e refers to the standard\n       identification described in the NIC Directory of Network\n       Participant.  A serving host may keep a table mapping \u003cNIC\n       ident\u003e into \u003csys ident\u003e.  This would provide for uniform\n       convenient usage.  \u003csys ident\u003e is the user's normal\n       identification at the serving HOST.  The use of \u003csys ident\u003e\n       would allow a network user to send mail to other users who\n       do not have NIC identification but whose \u003csys ident\u003e is\n       known.\n\n       The intent of this command is to enable a user at the user\n       site to mail data (in form of a file) to another user at the\n       server site.  It should be noted that the files to be mailed\n       are transmitted via the data connection in ASCII type.\n       These files should be appended to the destination user's\n       mail by the server in accordance with serving Host mail\n       conventions.  The mail my be marked as sent from the\n       particular using HOST and the user specified by the 'USER'\n       command.  The reply codes for the \"MLFL\" command are\n       identical to that in the \"APPE\" command, as shown below:\n\n              COMMAND         SUCCESS         FAIL\n              -------         -------         ----\n               MLFL            250             451,454,500-506\n                Sec. reply     252             452,453\n\n   14. The 'MLFL' command for network mail, though a useful and\n       essential addition to the FTP command repertoire, does not\n\n\n\n                                                                [Page 4]\n\f\nNWG/RFC 385 Page 2\n\n\n       allow TIP users to send mail conveniently without using\n       third hosts.  It would be more convenient for TIP users to\n       send mail over the TELNET connection instead of the data\n       connection as provided by the 'MLFL' command.  The following\n       'MAIL' command is therefore defined to send mail via the\n       TELNET connection:\n\n               MAIL \u003cuser\u003eCRLF\n\n       the syntax of \u003cuser\u003e is identical to that in the MLFL\n       command described above.  After the 'MAIL' command is\n       received, the server is to treat the following lines as text\n       of the mail sent by the user.  The mail text is to be\n       terminated by a line containing only a single period, that\n       is the character sequence \".CRLF\" in a new line.  The\n       following new reply codes are defined to handle the mail\n       command:\n\n          350 Enter mail, terminate by a line with only a '.'\n          256 Mail completed.\n\n       The reply codes are:\n\n              COMMAND         SUCCESS         FAIL\n              -------         -------         ----\n               MAIL            350             450,451,500-506\n                Sec Reply      256\n\n   15. An additional access control command called account (ACCT)\n       is now defined to facilitate accounting in systems such as\n       TENEX which require in addition to user and password, a\n       separate account specification.  The 'ACCT' command is\n       different from the 'PASS' command in that it is not\n       necessarily related to the 'USER' command and may arrive at\n       any time.  For example, a user may transfer different files\n       using different accounts.  The 'ACCT' command has the same\n       reply codes as the 'PASS' command (230 for success and 430-\n       432,500-506 for fail).  Some servers may require that an\n       account command must be sent before the user is \"logged in\".\n       For suchcases the success reply to the 'PASS' command could\n       be '330 Enter account'.\n\n   16. Since password information is quite sensitive, it is\n       desirable in general to \"mask\" it or suppress type out.  It\n       appears that the server has really no fool-proof effective\n       way to achieve this.  It is therefore the user-FTP process\n       responsibility to hide the sensitive password information.\n\n\n\n\n                                                                [Page 5]\n\f\nNWG/RFC 385 Page 2\n\n\n   17. The FTP is an open-ended protocol designed for easy\n       expandability.  Experimental commands may be defined by\n       sites wishing to implement such commands.  These\n       experimental commands should begin with the alphabetic\n       character 'X'.  Standard reply codes may be used with these\n       commands.  If new reply codes need to assigned, these\n       should be chosen between 900 and 999.  If the experimental\n       command is useful and of general interest, it shall be\n       included in the FTP command repertoire.\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 6]\n\f\n"
}