{
  "series": "Request for Comments",
  "number": "368",
  "howpublished": "RFC 368",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0368",
  "url": "https://www.rfc-editor.org/info/rfc368",
  "title": "Comments on \"Proposed Remote Job Entry Protocol\"",
  "pagetotal": "2",
  "year": "1972",
  "month": "jul",
  "body": "\n\n\n\n\n\nNetwork Working Group                                      R.T. Braden\nRequest for Comments #368                                  UCLA/CCN\nNIC 11015                                                  July 21, 1972\nCategories:\nObsoletes:\nUpdates:\n\n                              COMMENTS ON\n                  \"PROPOSED REMOTE JOB ENTRY PROTOCOL\"\n\n    Chuck Holland's draft proposal (RFC #360) is an excellent\ndocument, very complete and consistent.  Since the final standard RJE\nprotocol will be widely used on the Network, honing its definition now\nwill save trouble and discontent later.  Therefore, I will proceed to\nmake a new suggestions and pick a few nits.\n\n   1.  In my humble opinion, the  command  verb  \"BYE\"  is  overly\n       cute; I would find \"QUIT\" much less offensive\n\n   2.  The \"(pathname)\" syntax (p.5) may need some reworking.\n       It would be very desirable for all protocols or Network\n       access programs to use the same syntax for selecting a\n       host and socket and/or file name.  (Note that the FTP\n       documents use the term \"pathname\" in the more\n       restricted sense of a local file system name.)\n\n       a.  The PORT construction seems very undesirable,\n           since it depends upon a particular bit convention\n           of TIP's.  TIP's have bent Network protocols rather\n           badly in the past, but surely we don't want to build\n           their particular socket system into an official\n           protocol.\n\n       b.  For convenience, it may be desirable to allow hex\n           and octal socket numbers.\n\n       c.  There will probably be other hosts besides TIP's which\n           will use the \"(host-socket)\" pathname, and some of\n           them may want a transmission attribute other than \"T\".\n           The proposed syntax should be changed to allow (attributes)\n           in (host-socket)\n\n       d.  I see no reason to exclude attribute \"TE\", since the control\n           characters cr, lf, and ff exist in EBCDIC as well as ASCII.\n\n       e.  There are many EBCDIC codes, and at least 2 ASCII's.  The\n           (code) construction needs expansion.\n\n\n\n\n                                                                [Page 1]\n\f\n   3.  The syntax of OUT might reflect the fact that pathname is\n       required only for (disp) of \"(S)\".\n\n   4.  It may be desirable to distinguish syntactically (job-id)\n       and job-file-id).  For example, this would allow the command\n\n            ABORT (job-file-id)\n\n       to abort the job currently being transmitted, regardless of\n       its id (this assumes that multiple jobs for a given user\n       are sent sequentially).\n\n   5.  The replies presented in the document are very good, but may\n       need some elaboration.  For example, the syntax error messages\n       should be more specific.  When the user enters:\n\n            OUT=(H) UCLA91: NE/ARP998.WGW.TEST\n\n       he would like the error message to indicate explicitly that\n       the hostname is not valid, rather than merely being told there\n       is something wrong with one of the parameters.\n\n   6.  Experience with remote job entry to CCN via the Network has\n       shown that the user wants a transmission status command, to\n       find out how many records have been sent or received so far.\n       The network bandwidth corresponds in order of magnitude to\n       one page per second.  The average output for jobs submitted\n       to CCN from the Network has contained about 30 pages, so\n       significant transmission delays are not unusual.  It is important\n       to add a command for this purpose.\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by BBN Corp. under the   ]\n         [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}