{
  "series": "Request for Comments",
  "number": "135",
  "howpublished": "RFC 135",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0135",
  "url": "https://www.rfc-editor.org/info/rfc135",
  "title": "Response to NWG/RFC 110",
  "pagetotal": "3",
  "year": "1971",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        W. Hathaway\nRequest for Comments: 135                                           AMES\nNIC: 6712                                                  29 April 1971\nUpdates: 110\n\n\n                        Response to NWG/RFC #110\n   (Conventions for Using an IBM 2741 Terminal as a User Console for\n                    Access to Network Server Hosts)\n\n   I would like to propose the following conventions to replace the ones\n   proposed in RFC #110.  The original conventions suffer from lack of\n   consideration of the correspondence 2741 and what I feel are\n   inconsistencies and considerable difficulty of use.  (The 2741\n   terminal with correspondence keyboard does not have all of the\n   standard characters, notably:\n\n      less than       \u003c\n      greater than    \u003e\n      logical not    [1]\n      vertical bar    |\n\n   Thus we must not use any of these characters in our conventions if we\n   wish to support the correspondence 2741.)\n\n   The dedication of certain characters to special functions involves a\n   trade-off: the convenience of having the function as a single key\n   versus the inconvenience of having to use two keys to enter the\n   character as data.  I believe that only two of the special functions\n   listed in RFC #110 justify the dedication of a key: the \"character\n   escape\" function and the \"character delete\" function.  For the\n   \"character escape\" function I recommend the cent sign [2], as this\n   character is on both the regular and correspondence 2741 terminals\n   and is not in the ASCII character set.  For the \"character delete\"\n   function I recommend the backspace key for obvious reasons.  While\n   there is some need to be able to enter the character \"backspace\" (as\n   for underscoring output etc.,) I feel that the trade-off mentioned\n   above clearly indicates a single key \"character delete\" would be much\n   more valuable than a single key \"backspace\" and a two key \"character\n   delete.\"\n\n   For the other special functions I recommend two key combinations,\n   consisting of \"character escape\" [2] and a key to define the\n   function.  These are summarized below:\n\n\n\n\n\n\n\nHathaway                                                        [Page 1]\n\f\nRFC 135                 Response to NWG/RFC #110           29 April 1971\n\n\n      character escape        [2]\n      character delete        backspace\n      system delete           [2]$\n      line delete             [2]# or [2]#NL\n      logical line end        [2];\n      line continuation       [2]NL\n      ASCII control           [2]@\n\n   The option in \"line delete\" is to allow the user to enter a new line\n   (NL) immediately after the \"line delete\" to line up margins without\n   entering a null line; to enter a null line after a \"line delete\"\n   would require two NL characters.\n\n   The two new functions defined above, \"line continuation\" and \"ASCII\n   control,\" are used as follows.  The \"line continuation\" is used to\n   enter a line which is longer than the 2741 carriage (or the margin\n   placement) will permit.  It can be looked on as the complement of the\n   \"logical line end\" in that is allows you to enter one logical line on\n   several physical lines.\n\n   The use of the \"ASCII control\" function requires some background.\n   There are of course many characters in ASCII which are keyed as\n   combinations of \"control\" and another key.  The \"character escape\"\n   function may be used to handle these control characters as follows: a\n   \"character escape\" followed by a letter will be the equivalent of the\n   ASCII \"control\" \"letter\", written as Xc (where X is the letter).\n   This will greatly simplify the conventions for users, as they will\n   simply key \"[2]A\" where they are used to using Ac and so forth.  For\n   completeness, however, there needs to be a way to key the additional\n   control characters which require both \"control\" and \"shift\" in\n   addition to a letter (such as ESC, which is SHIFT Mc).  Further it is\n   desirable that a more mnemonic system be provided for the non-\n   Teletype user, who knows he wants a LF but does not know that it is a\n   Jc.  To satisfy both of these needs I recommend the \"ASCII control\"\n   special function, which is used to enter any of the ASCII control\n   character as \"[2]@\" followed by the standard two or three character\n   abbreviation.  Thus \"escape\" would be [2]@ESC, \"line feed\" would be\n   [2]@LF, and so forth.  The use of the variable length abbreviation\n   does not introduce any ambiguity, although from an implementation\n   standpoint it may be advantageous to use the two character\n   abbreviation proposed in RFC #110.\n\n   Finally we must be able to enter the eight ASCII graphics which do\n   not appear on either 2741 terminal, as well as the \"cent sign\" and\n   \"backspace\" themselves (without their special functions).  For these\n   I recommend the following:\n\n\n\n\n\nHathaway                                                        [Page 2]\n\f\nRFC 135                 Response to NWG/RFC #110           29 April 1971\n\n\n      [2](            for     [\n      [2])            for     ]\n      [2]6            for     {\n      [2]9            for     }\n      [2]/            for     \\\n      [2]'            for     '\n      [2]\"            for     ^\n      [2]-            for     ~\n      [2][2]          for     [2]\n      [2]backspace    for     backspace\n\n   Note that the characters \"\u003c\" and \"\u003e\" do not appear on the\n   correspondence 2741 and hence should not be used.\n\nEndnotes\n\n   [1] logical not\n\n   [2] cent sign\n\n\n          [This RFC was put into machine readable form for entry]\n          [into the online RFC archives by Lorrie Shiota, 10/02]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHathaway                                                        [Page 3]\n\f\n"
}