{
  "series": "Request for Comments",
  "number": "290",
  "howpublished": "RFC 290",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0290",
  "url": "https://www.rfc-editor.org/info/rfc290",
  "title": "Computer networks and data sharing: A bibliography",
  "pagetotal": "15",
  "year": "1972",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                                   Alvin P. Mullery\nRequest for Comments: 290               Thomas J. Watson Research Center\nUpdates: RFC 243                                        January 11, 1972\nNIC: 8300\n\n\n           COMPUTER NETWORKS AND DATE SHARING: A BIBLIOGRAPHY\n\n\n   Abstract.  The bibliography is broken into seven subject areas -\n   general data structures, data description, data conversion, data\n   management, data security, data transmission, and computer network\n   design.  Two of these areas, general data structures and data\n   management, cover a very broad range of subjects: however, in these\n   two areas, only entries that seem to be specially pertinent to\n   computer networks and data sharing are included.  The bibliography\n   also contains an index of authors.\n\n\n   A. GENERAL DATA STRUCTURES\n\n   1.  F.D. Anzelmo, \"A Data-Storage Format for Information System\n       Files,\" IEEE Trans. Computers, vol. C-20, p. 39-43, January 1971.\n\n   2.  E. F. Codd, \"A Relational Model of Data for Large Shared Data\n       Banks,\" Comm. ACM, vol 13, p. 377-387, June, 1970.\n\n   3.  C.T. Davies, \"A Logical Concept for the Control and Management of\n       Data\", AR-0803-00\n\n   4.  J. Barley, \"Toward on Understanding of Data Structures,\" 1970 ACM\n       SIGFIDET Workshop on Data Description and Access, p. 1-40,\n       November, 1970.\n\n   5.  M. Kay and S. Y. W. Su, \"The MIND System:  The Structure of the\n       Semantic File,\" Rand Corp. Rept. RM-6265/3-PR, June 1970.\n\n   6.  S. E. Madnick and J.W. Alsop II, \"A Modular Approach to File\n       System Design,\" 1969 Spring Joint Computer Conf., AFIPS Proc.,\n       vol. 34, p. 1-13, 1969.\n\n   7.  W. C. McGee, \"File Structures for Generalized Data Management,\"\n       Pro. IFIPS Congress 68, p. 1233, 1968.\n\n   8.  P. D. Rovner and J. A. Feldman, \"The LEAP Language and Data\n       Structure,\" Proc IFIPS Congress 68, p. 579 1968.\n\n\n\n\n\nMullery                                                         [Page 1]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   B. DATA DESCRIPTION\n\n   1.  R. E. Bleier, \"Data Definition Standardization,\" 1970 ACM\n       SIGFIDET Workshop on Data Description and Access, p. 68-86,\n       November 1970.\n\n   2.  T. H. Bonn, \"A Standard for Computer Networks,\" Computer, vol. 4,\n       p. 10-14, May/June, 1971.\n\n   3.  \"Data Base Task Group Report,\" CODASYL Program Language\n       Committee.\n\n   4.  \"IBM Data Base Task Group Representative Minority Report,\"\n       CODASYL Program Language Committee, Oct. 17, 1969.\n\n   5.  C. J. Date and P. Hopewell, \"File Definition and Logical Data\n       Independence,\" 1971 ACM SIGFIDET Workshop on Data Description,\n       Access, and Control, p. 117-138, November 1971.\n\n   6.  C. J. Date and P. Hopewell, \"Storage Structure and Physical Data\n       Independence,\" 1971 ACM SIGFIDET Workshop on Data Description,\n       Access, and Control, p. 139-169, November 1971.\n\n   7.  J. B. Dennis, \"On the Exchange of Information,\" 1970 ACM SIGFIDET\n       Workshop on Data Description and Access, p. 41-67, November, 1970\n\n   8.  M. Donaldson, S. Robinovitz, and B. Wolfe, \"Proposed MICIS\n       Standard for Data Description,\" Michigan Interuniversity\n       Committee on Information Systems, Dec. 4, 1970.\n\n   9.  M. Ellis and K. Nelson, \"A Data Description Language for\n       Hierarchical Data Files,\" 1970 ACM SIGFIDET Workshop on Data\n       Description and Access, p. 87-107, November 1970\n\n   10. D. Evans and A. Van Dam, \"Data Structure Programming Language,\"\n       Proc. IFIP Congress 68, p. 557-564, 1968.\n\n   11. G. A. Gibson, \"Draft: Data Description Language,\" fdt (a\n       publication of the ACM Special Interest Committee on File\n       Description and Translation), vol. 1, p. 9-13, 10 August 1969.\n\n   12. L. V. Haibt and A. P. Mullery, \"Data Descriptive Language for\n       Shared Data,\" IBM Research Report RC3476, August 1971.\n\n   13. A. W. Holt, \"Information System Theory Project,\" Applied Data\n       Research, Princeton, Rept. ADR-REF-6606, Sept. 1968.\n\n\n\n\n\nMullery                                                         [Page 2]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   14. G. J. Lipovsky,  \"The Architecture of a Large Distributed Logic\n       Associative Memory,\" Univ. of Illinois, Urbana, Report R-424,\n       July 1969 (contains a discussion of representation structures\n       suitable for describing complex data bases).\n\n   15. C. N. Mooers, \"A Standard Method for the Description of External\n       Data Formats,\" part IV of \"Standards for User Procedures and Data\n       Formats in Automatic Information Systems and Networks,\" Zator\n       Co., Cambridge Mass., Aug. 28, 1967.\n\n   16. C. N. Mooers, \"Data Descriptive Languages,\" fdt (a publication of\n       the ACM Special Interest Committee on File Description and\n       Translation), vol. 1 p. 31-36, 10 August 1969.\n\n   17. H. R. Morse, \"Efficiency and the Use of Data Definition\n       Techniques,\" fdt (a publication of the ACM Special Interest\n       Committee on File Description and Translation), vol. 1, p. 20-23,\n       10 August 1969.\n\n   18. M. Schaefer, \"User's Guide for DBL:  General Description,\" System\n       Development Corporation, Santa Monica, Calif., Rept. TM-\n       3870/001/01, September, 1969.\n\n   19. D. P. Smith, \"A Data Description Facility,\" Moore School, Univ.\n       of Penn., AD-703244, April 1970.\n\n   20. D. P. Smith, \"A Manual with Examples for the Data Description\n       Language (DDL),\" Moore School, Univ. of Penn., AD-726707, April\n       1971.\n\n   21. T. A. Standish, \"A Data Definition Facility for Programming\n       Languages,\" Carnegie Institute of Technology, AD-658042, May 18,\n       1967.\n\n   22. B. Wegbreit, \" The Treatment of Data Types in EL1,\" Technical\n       Report, Division of Engineering and Applied Physics, Harvard\n       Univ., May 1971.\n\n   23. B. Wegbreit, \"The ECL Programming System,\" Technical Report\n       Division of Engineering and Applied Physics, Harvard Univ., May\n       1971.\n\n\n\n\n\n\n\n\n\n\nMullery                                                         [Page 3]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   C. DATA CONVERSION\n\n   1.  R. D. Anderson, E. F. Harslem, J. F. Heafner, V. Cerf, J. Madden,\n       R. Metcalfe, A. Shoshani, J. White, and D. Wood, \"The Data\n       Reconfiguration Service - - An Experiment in Adaptable,\n       Process/Process Communication,\" Proc. ACM/IEEE Second Symposium\n       on Problems in the Optimization of Data Communication Systems, p.\n       1-9, October 1971.\n\n   2.  K. Sattley, R. E. Millstein, S. Marshall, \"On Program\n       Transferability,\" Applied Data Research, Inc., Rept. RADC-TR-70-\n       217, Nov. 1970.\n\n   3.  M. Schaefer, \"DBL - A Language for Converting Data Bases,\"\n       Datamation, vol. 16, p. 123, June 1970.\n\n\n   D. DATA MANAGEMENT\n\n   1.  W. W. Chu, \"Optimal File Allocation in a Multiple Computer\n       System,\" IEEE Trans. Computers, vol. c-18, p. 885-889, October\n       1969.\n\n   2.  E. G. Coffman, J. J. Elphick, and A. Shoshani, \"System\n       Deadlocks,\" Computing Surveys, vol. 3, no. 2, p. 67, June 1971.\n\n   3.  J. M. Daniels and L. D. Irwin, \"Memory Protection in\n       Multiprocessor Computer Systems,\" Auburn Univ. Rept. THEMIS-AU-\n       T-17, November, 1970.\n\n   4.  A. N. Habermann, \"Prevention of System Deadlocks,\" Comm. ACM, vol\n       12, no. 7, p. 373-385, July 1969.\n\n   5.  J. W. Havender, \"Avoiding Deadlock in Multitasking Systems,\" IBM\n       Systems Journal, vol. 7, no. 2, 1968.\n\n   6.  P. G. Hebalkar, \"A Graph Model for Analysis of Deadlock\n       Prevention in Systems with Parallel Computations,\" IBM Research\n       Report RC3367, April 22, 1971.\n\n   7.  B. W. Lawpson, \"A Scheduling Philosophy for Multi-Processing\n       Systems,\" Comm. ACM, vol. 11, p. 347-360, May, 1968.\n\n   8.  T. Marill and K. Curewitz, \"Network Data Handling System,\"\n       Computer Corporation of America, Cambridge, Mass., August 1971.\n\n\n\n\n\n\nMullery                                                         [Page 4]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   9.  J. E. Murphy, \"Resource Allocation with Interlock Detection in a\n       Multi-Task System,\" 1968 Fall Joint Computer Conference.  AFIPS\n       Proc., vol. 33, p. 1169-1176, 1968\n\n   10. P. J. Owens, \"Phase II, A Data Management System Model,\" IBM\n       Research Rept. RJ665, Jan. 29 1970.\n\n   11. M. E. Senko, V. Y. Lum, P. J. Woens, \"A File Organization\n       Evaluation Model (FOREM),\" Proc IFIP Congress 68, August, 1968.\n\n   12. A. Shoshani and A. J. Bernstein, \"Synchronization in a Parallel-\n       Accessed Data Base,\" Comm. ACM, vol 13, p. 604-607, Nov. 1969.\n\n   13. A. J. Strnad, \"The Relational Approach to the Management of Data\n       Bases,\" MIT Project MAC Rept. Mac-TM-23, April 1971.\n\n   14. V. K. M. Whitney, \"A Study of Optimal File Assignment and\n       Communication Network configuration in Remote-Access Computer\n       Message Processing and Communication Systems,\" SEL Technical\n       Report No. 48, System Engineering Lab, Dept. of Elect. Engin.,\n       University of Michigan, September, 1970.\n\n\n   E. DATA SECURITY\n\n   1.  P. Baran, \"On Distributed Communications: IX. Security, Secrecy,\n       and Tamper-Free Considerations,\" The RAND Corporation, AD-444839,\n       August 1964.\n\n   2.  P. S. Browne and D. Steinauer, \"A Model for Access Control,\" 1971\n       ACM SIGFIDET Workshop on Data Description, Access, and Control,\n       p. 241-262, November 1971.\n\n   3.  A. I. Dean, Jr., \"Data Privacy and Integrity Requirements for\n       Online Data Management System,\" 1971 ACM SIGFIDET Workshop on\n       Data Description, Access, and Control, p. 279-298, November 1971.\n\n   4.  T. D. Friedman, \"The Authorization Problem in Shared Files,\" IBM\n       Systems Journal, vol. 9, no. 4, p. 258-280, 1970.\n\n   5.  R. M. Graham, \"Protection in an Information Processing Utility,\"\n       comm. ACM, vol 1, no. 5, p. 365-369, May 1968.\n\n   6.  L. J. Hoffman, \"Computers and Privacy:  A Survey,\" Computing\n       Surveys, vol. 1, no. 2, p. 85-103,  1969.\n\n   7.  L. J. Hoffman, \"The Formulary Model for Access Control and\n       Privacy in Computer Systems,\" SLAC Report No. 117, May 1970.\n\n\n\nMullery                                                         [Page 5]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   8.  B. W. Lampson, \"Dynamic Protection Structures,\" 1969 Fall Joint\n       Computer Conference, AFIPS Proc., vol 35, p. 27-38, 1969.\n\n   9.  R. C. Owens, Jr., \"Evaluation of Access Authorization\n       Characteristics of Derived Data Sets,\" 1971 ACM SIGFIDET Workshop\n       on Data Description, Access, and Control, p. 263-278, November\n       1971.\n\n   10. P. L. Peck, Jr., \"Survey of Applicable Safeguards for Insuring\n       the Integrity of Information in the Data Processing Environment,\"\n       MITRE Rept. MTP356, MITRE Corp., McLean, Va., June 1971.\n\n   11. B. Peters, \"Security Considerations in a Multiprogrammed Computer\n       System,\" 1967 Spring Joint Computer Conference, AFIPS Proc., vol\n       30, p. 283-286, 1967.\n\n   12. L. H. Saltzer and M. D. Schroeder, \"A Hardware Architecture for\n       Implementing Protection Rings,\" Third ACM Symposium on Operating\n       Systems, October 1970.\n\n   13. R. O. Skatrud, \" A Consideration of the Application of\n       Cryptographic Techniques to Data Processing,\" 1969 Fall Joint\n       Computer Conference, AFIPS Proc. Vol 35, p. 111-117, 1969.\n\n   14. R. Turn and H. E. Petersen, \"Security of Computerized Information\n       Systems,\" Rand Corp. Rept. P-4405, July 1970.\n\n   15. W. H. Ware, \"Security and Privacy in Computer Systems,\" 1967\n       Spring Joint Computer Conference, AFIPS Proc., vol 30, p. 279-\n       282, 1967.\n\n   16. W. H. Ware, \"Security and Privacy:  Similarities and\n       Differences,\" 1967 Spring Joint Computer Conference, AFIPS Proc.,\n       vol 30, p. 283-290, 1967.\n\n\n   F. DATA TRANSMISSION\n\n   1.  \"Proposed Character Set for Roman alphabet and Romanized Non-\n       Roman Alphabets\" American Standards Institute Document x3.2/836,\n       May 29, 1969.\n\n   2.  P. Baran, \"On Distributed Communication Networks,\" IEEE Trans. On\n       Communication Systems, vol. CS-12, no. 1, p. 1-9, March 1964.\n\n   3.  K. A. Bartlett, \"Transmission Control in a Local Data Network,\"\n       Proc. IFIP Congress 68, p. 704-708, August 1968.\n\n\n\n\nMullery                                                         [Page 6]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   4.  \"Final Report of the Electronic Industries Association Committee\n       on Netting Computer Systems,\" Marc Bendick, Chairman, System Dev.\n       Corp. Rept. SP-3514, May, 1970.\n\n   5.  \"Computer Netting, Standardization, and Systems Management,\"\n       Computer Netting Committee, Defense Communications Council,\n       Electronic Industries Association, I. Bialick, Chairman,\n       September 15, 1969.\n\n   6.  A. K. Bhushan and R. H. Stotz, \"Procedures and Standards for\n       Intercomputer Communication,\" 1968 Spring Joint Computer Conf.,\n       AFIPS Proc., vol 32 pp 95-104, 1968.\n\n   7.  S. Carr, S. Crocker, V. Cerf. \"Host-Host Communication Protocol\n       in the ARPA Network,\" 1970 Spring Joint Computer Conf., AFIPS\n       Proc., vol 36, p. 589-598, 1970.\n\n   8.  \"Data Transmission Network Computer-to Computer Study,\" Computer\n       Sciences Corporation, Falls Church, Va., 1971.\n\n   9.  D. W. Davies, \"Communication Networks to Serve Rapid-response\n       Computers,\" Proc IFIP Congress 68, p. 650-656, August 1968.\n\n   10. D. W. Davies, \"The Principles of a Data Communication Network for\n       Computers and Remote Peripherals,\" Proc IFIP Congress 69, p.\n       709-714, August 1968.\n\n   11. D. R. Doll, \"Topology and Transmission Rate Considerations in the\n       Design of Centralized Computer Communication Networks,\" Proc.\n       1970 IEEE International Conference on Communications, p. 19.17-\n       19.27, 1970.\n\n   12. H. Frank, \"Analysis and Optimization of Store-and Forward\n       Computer Networks,\" Network Analysis Corporation, AD-707438, June\n       15, 1970.\n\n   13. M. E. Jacobs, \"Standard Format for Data Exchange,\" Special\n       Libraries, vol. 59, pp 258-260, April 1968.\n\n   14. D. Karp and S. Seroussi, \"A Communications Interface for Computer\n       Networks,\" IBM Research Report No. RC3417, June 1971.\n\n   15. J. L. Little, \"Some Evolving Conventions and Standards for\n       Character Information Coded in Six, Seven, and Eight Bits,\" NBS\n       Technical Note 478, May 1969.\n\n\n\n\n\n\nMullery                                                         [Page 7]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   16. J. L. Little and C. N. Mooers, \"Standards for User Procedures and\n       Data Formats in Automated Information Systems and Networks,\" 1968\n       Spring Joint Computer Conf., AFIPS Proc., vol 32 pp 89-94, 1968.\n\n   17. A. K. Olefir, B. F. Kipurov, D. M. Frumin, and L. P. Yukhnevich,\n       \"A System for Data Exchange between two Computers,\" Foreign\n       Technology Division, Wright Patterson AFB, Rept. FTD-HT-23-438-\n       68, November 7, 1969.\n\n   18. R. A. Scantlebury and P. T. Wilkinson, \"The Design of a Switching\n       System to Allow Remote Access to Computer Services by Other\n       Computers and Terminal Devices,\" Proc. ACM/IEEE Second Symposium\n       on Problems in the Optimization of Data Communication Systems, p.\n       160-165, October 1971.\n\n   19. P. J. Trafton, H. A. Blank, and N. F. McAllister, \"Data\n       Transmission Network Computer-to Computer Study,\" Proc. ACM/IEEE\n       Second Symposium on Problems in the Optimization of Data\n       Communication Systems, p. 183-191, October 1971.\n\n   20. P. T. Wilkinson and R. A. Scantlebury, \"The Control Functions in\n       a Local Data Network,\" Proc IFIP Congress 68, p. 734-738, August\n       1968.\n\n\n   G. COMPUTER NETWORK DESIGN\n\n   1.  V. I. Belyakov-Bodin and Yu. I. Torgov, \"On the Structure of a\n       Heterogeneous Computing System, Controlled by a Large Digital\n       Computer,\" Foreign Technology Division, Wright-Patterson AFB\n       Rept. FTD-HT-23-1450-68, AD699640, October 1, 1969.\n\n   2.  A. A. Benvenuto, et al., \"System Load Sharing Study,\" The MITRE\n       Corporation, Rept. MTR-5062, 1969.\n\n   3.  \"Interface Message Processor:  Specifications for the\n       Interconnection of a Host and an IMP.\" Bolt, Baranek and Newman,\n       Inc., Rept. 1822, February 1971.\n\n   4.  E. K. Bowden, Sr., \"Priority Assignment in a Network of\n       Computers,\" IEEE Trans. Computers, vol. C-18 p. 1021-1026, Nov.\n       1969.\n\n   5.  I. Cohen, \"Control of Data Processor Networks,\" 1970 IEEE\n       International Conference on Communications, p. 19.28-19.34, 1970.\n\n\n\n\n\n\nMullery                                                         [Page 8]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   6.  G. D. Cole, \"Performance Measurements on the ARPA Computer\n       Network,\" Proc. ACM/IEEE Second Symposium on Problems in the\n       Optimization of Data Communication Systems, p. 39-45, October\n       1971.\n\n   7.  P. R. Cox, \"General System Organisation of Multi-Processor\n       Configurations,\" Software 70, Sheffield England, p. 33-40, April\n       1970.\n\n   8.  D. R. Doll, \"Efficient Allocation of Resources in Centralized\n       Computer Communication Network Design,\" PhD Thesis, Univ. of\n       Michigan, System Engineering Laboratory, Tech. Rept. 02641-1-T,\n       June 1969.\n\n   9 . D. J. Farber and K. C. Larson, \"The System Architecture of the\n       Distributed Computer System - an Informal Description,\" Univ. of\n       California, Irvine Technical Report No. 11, September 1971.\n\n   10. H. Frank, I. T. Frisch, and W. S. Chou, \"Topological\n       Considerations in the Design of the ARPA Network,\" 1970 Spring\n       Joint Computer Conf., AFIPS Proc., vol. 36, p. 581-587, 1970.\n\n   11. H. Frank, I. T. Frisch, W. S. Chou, and R. Van Slyke, \"Optimal\n       Design of Centralized Computer Networks,\" Proc. 1970 IEEE\n       International Communications Conference, p. 19.1-19.10, 1970.\n\n   12. H. Frank, I. T. Frisch, R. Van Slyke, and W. S. Chou, \"Optimal\n       Design of Centralized Computer Networks,\" Networks, vol 1, no. 1,\n       p. 43-57, 1971.  (Same paper as previous entry.)\n\n   13. D. Fredericksen and R. W. Ryniker, \"A Computer Network Interface\n       for OS/MVT,\" IBM Research Report RC3317, April 1971.\n\n   14. R. C. Gunderson and J. O. Johnson, \"Engineering Design and\n       Implementation of a Multi-Computer Data Processing System for a\n       Navy Command and Control Center,\" Proc. 7th International\n       Convention on Military Electronics, Western Periodicals, North\n       Hollywood Calif., 1963.\n\n   15. R. M. Hamaker, \"Distributed Computer Systems,\"\n       Telecommunications, vol. 4, p. 25-30, March 1970.\n\n   16. E. Hansler, G. K. McAuliffe, R. S. Wilkov, \"Reliability\n       Considerations in Centralized Computer Networks,\" IBM Research\n       Report RC3354, May 1971.\n\n\n\n\n\n\nMullery                                                         [Page 9]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   17. F. Heart, R. Kahn, S. Ornstein, W. Crowther, and D. Walden, \"The\n       Interface Message Processor for the ARPA Computer Network,\" 1970\n       Spring Joint Computer Conference, AFIPS proc. Vol 36, p. 551-567,\n       1970.\n\n   18. W. G. Howe and T. R. Kibler, \"Control Concepts of a Logical\n       Network Machine,\" IBM Research Report RC3331, April 1971.\n\n   19. R. E. Kahn and W. R. Crowther, \"Flow Control in a Resource-\n       Sharing Computer Network,\" Proc. ACM/IEEE Second Symposium on\n       Problems in the Optimization of Data Communication Systems, p.\n       108-116, October 1971.\n\n   20. R. E. Kahn and W. R. Crowther, \" A Study of the ARPA Network\n       Design and Performance,\" Bolt, Beranek and Newman, Inc.,\n       Cambridge, Mass, Report BBN-2161, August 1971.\n\n   21. L Kleinrock, \"Analytic and Simulation Methods in Computer Network\n       Design,\" 1970 Spring Joint Computer Conf., AFIPS Proc., vol. 36,\n       p. 569-579, 1970.\n\n   22. L Kleinrock, \"Models for Computer Networks,\" Proc. 1969 IEEE\n       International Conf. on Communications, p. 21.9-21.16, June 1969.\n\n   23. D. E. Lawrence, \"A Proposed Computer Network for the Australian\n       National University,\" Computer Centre, The Australian National\n       University, Canberra, Report No. 38, August 1971.\n\n   24. A. L. Leiner, W. A. Notz, J. L. Smith, and A. Weinberger, \"PILOT,\n       A New Multiple Computer System,\" J. ACM, vol 6, p. 315-335, July\n       1959.\n\n   25. T. Marill and L. G. Roberts, \"Toward a Cooperative Network of\n       Time-Shared Computers,\"  1966 Fall Joint Computer Conference,\n       AFIPS Proc., vol 29, p. 425-431, 1966.\n\n   26. D. B. McKay and D. P. Karp, \"Network/440 - - IBM Research\n       Computer Sciences Department Computer Network,\" IBM Research\n       Report RC 3431, July 1971.\n\n   27. D. B. McKay and D. P. Karp, \"A Network/440 Protocol Concept,\" IBM\n       Research Report RC 3432, July 1971.\n\n   28. D. B. McKay and D. P. Karp, J. W. Meyer, and R. S. Nachbar,\n       \"Exploratory Research on Netting at IBM,\" IBM  Research Report\n       RC3486, June 1971.\n\n\n\n\n\nMullery                                                        [Page 10]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   29. S. F. Mendicino, \"The Lawrence Radiation Laboratory Octopus,\"\n       Lawrence Radiation Lab Rept. UCRL-73149, April 1971.\n\n   30. \"An Experimental Computer Network,\" MIT Lexington, Rept. ESD-TR-\n       69-74, March 1969.\n\n   31. S. S. Patil, \"Coordination of Asynchronous Events,\" MIT Project\n       MAC Rept. MAC-TR-72, June 1970.\n\n   32. P. L. Peck, \"The Implications of ADP Networking Standards for\n       Operations Research,\" Mitre Corp., McLean, Va., Rept. MTP333, AD\n       696675, June 1696.\n\n   33. J. L. Redding, \"Computer Network Simulator,\" Naval Ship Research\n       and Development Center Rept. NSRDC 3650, September 1971.\n\n   34. L. G. Roberts, and B. D. Wessler, \"Computer Network Development\n       to Achieve Resource Sharing,\" 1970 Spring Joint Computer Conf.,\n       AFIPS Proc., vol. 36, p. 543-549, 1970.\n\n   35. J. J. Russell and D. C. Knight, \"Communication and Systems\n       Development in the C. S. I. R. O. (Commonwealth Scientific and\n       Industrial Research Organization) Network,\" Proc, 3rd Australian\n       Computer Conference, p. 384-386, 1966.\n\n   36. R. M. Rutledge, A. L. Vareha, L. C. Varian, A. H. Weis, S. F.\n       Seroussi, J. W. Meyer, J. F. Jaffee, and M. A. K. Angell, \"An\n       Interactive Network of Time-Sharing Computers,\" Proc. 24th\n       National Conference, A. C. M. Publication p-69, p. 431-442, 1969.\n\n   37. J. F. Sherlock, \"The Simulation of a Multi-Computer System,\" IEEE\n       Trans. Computers, v. C-19, p. 1114-1117, Nov. 1970.\n\n   38. A. Shoshani and E. G. Coffman, \"Sequencing Tasks in Multi-\n       Process, Multiple Resource Systems to Avoid Deadlocks,\" Proc.\n       11th Annual Symposium on Switching and Automata Theory, p. 225-\n       233, Oct. 1970.\n\n   39. A. H. Weis, \"Distributed Network Activity at IBM, \"IBM Research\n       Report RC3392, June 1971.\n\n\n\n\n\n\n\n\n\n\n\nMullery                                                        [Page 11]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n   AUTHOR INDEX\n\n       J. H. Alsop II . . . . . . . . . . . . . . . . . . . .  A6\n       R. D. Anderson . . . . . . . . . . . . . . . . . . . .  C1\n       M. A. K. Angell. . . . . . . . . . . . . . . . . . . . G36\n       F. D. Anzelmo  . . . . . . . . . . . . . . . . . . . .  A1\n       ASI  . . . . . . . . . . . . . . . . . . . . . . . . .  F1\n\n       P. Baran . . . . . . . . . . . . . . . . . . . . . . E1,F2\n       K.A. Bartlett. . . . . . . . . . . . . . . . . . . . .  F3\n       V. I. Belyakov-Bodin . . . . . . . . . . . . . . . . .  G1\n       M. Bendick . . . . . . . . . . . . . . . . . . . . . .  F4\n       A. A. Benvenuto. . . . . . . . . . . . . . . . . . . .  G2\n       A. J. Bernstein. . . . . . . . . . . . . . . . . . . . D12\n       A. K. Bhushan  . . . . . . . . . . . . . . . . . . . .  F6\n       I. Bialick . . . . . . . . . . . . . . . . . . . . . .  F5\n       H. A. Blank. . . . . . . . . . . . . . . . . . . . . . F19\n       R. E. Bleier . . . . . . . . . . . . . . . . . . . . .  B1\n       Bolt, Baranek and Newman . . . . . . . . . . . . . . .  G3\n       T. H. Bonn . . . . . . . . . . . . . . . . . . . . . .  B2\n       E. K. Bowden, Sr . . . . . . . . . . . . . . . . . . .  G4\n       P. S. Browne . . . . . . . . . . . . . . . . . . . . .  E2\n\n       S. Carr  . . . . . . . . . . . . . . . . . . . . . . .  F7\n       V. Cerf  . . . . . . . . . . . . . . . . . . . . . .C1, F7\n       W. S. Chou  . . . . . . . . . . . . . . . . . .G10,G11,G12\n       W. W. Chu . . . . . . . . . . . . . . . . . . . . . .   D1\n       CODASYL . . . . . . . . . . . . . . . . . . . . . .  B3,B4\n       E. F. Codd  . . . . . . . . . . . . . . . . . . . . .   A2\n       E. G. Coffman . . . . . . . . . . . . . . . . . . . D2,G38\n       I. Cohen  . . . . . . . . . . . . . . . . . . . . . .   G5\n       G. D. Cole  . . . . . . . . . . . . . . . . . . . . . . G6\n       Computer Sciences Corp. . . . . . . . . . . . . . . . . F8\n       P. R. Cox   . . . . . . . . . . . . . . . . . . . . . . G7\n       S. Crocker  . . . . . . . . . . . . . . . . . . . . . . F7\n       W. Crowther . . . . . . . . . . . . . . . . .  G17,G19,G20\n       K. Curewitz  . . . . . . . . . . . . . . . . . . . . .  D8\n\n       J. M. Daniels  . . . . . . . . . . . . . . . . . . . .  D3\n       C. J. Date  . . . . . . . . . . . . . . . . . . . .  B5,B6\n       C. T. Davies  . . . . . . . . . . . . . . . . . . . .   A3\n       D. W. Davies  . . . . . . . . . . . . . . . . . . . F9,F10\n       A. L. Dean, Jr  . . . . . . . . . . . . . . . . . . . . E3\n       J. B. Dennis  . . . . . . . . . . . . . . . . . . . . . B7\n       D. R. Doll  . . . . . . . . . . . . . . . . . . . . F11,G8\n       M. Donaldson  . . . . . . . . . . . . . . . . . . . . . B8\n\n\n\n\n\nMullery                                                        [Page 12]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n       J. Earley  . . . . . . . . . . . . . . . . . . . . . .  A4\n       M. Ellis . . . . . . . . . . . . . . . . . . . . . . .  B9\n       M. J. Elphick  . . . . . . . . . . . . . . . . . . . .  D2\n       D. Evans . . . . . . . . . . . . . . . . . . . . . . . B10\n\n       J. A. Feldman  . . . . . . . . . . . . . . . . . . . .  A8\n       H. Frank . . . . . . . . . . . . . . . . . F12,G10,G11,G12\n       D. Fredericksen  . . . . . . . . . . . . . . . . . . . G13\n       T. D. Friedman . . . . . . . . . . . . . . . . . . . .  E4\n       I. T. Frisch . . . . . . . . . . . . . . . . . G10,G11,G12\n       D.M. Frumin  . . . . . . . . . . . . . . . . . . . . . F17\n       G. A. Gibson . . . . . . . . . . . . . . . . . . . . . B11\n       R. M. Graham . . . . . . . . . . . . . . . . . . . . .  E5\n       R. C. Gunderson  . . . . . . . . . . . . . . . . . . . G14\n\n       A. N. Haberman . . . . . . . . . . . . . . . . . . . .  D4\n       L. Haibt . . . . . . . . . . . . . . . . . . . . . . . B12\n       R. M. Hammaker . . . . . . . . . . . . . . . . . . . . G15\n       E. Hansler . . . . . . . . . . . . . . . . . . . . . . G16\n       E. F. Harslem  . . . . . . . . . . . . . . . . . . . .  C1\n       J. W. Havender . . . . . . . . . . . . . . . . . . . .  D5\n       J. F. Heafner. . . . . . . . . . . . . . . . . . . . .  C1\n       F. Heart . . . . . . . . . . . . . . . . . . . . . . . G17\n       P. G. Hebalkar . . . . . . . . . . . . . . . . . . . .  D6\n       L. J. Hoffman  . . . . . . . . . . . . . . . . . . . E6,E7\n       A. W. Holt . . . . . . . . . . . . . . . . . . . . . . B13\n       P. Hopewell. . . . . . . . . . . . . . . . . . . . . B5,B6\n\n       J. D. Irwin  . . . . . . . . . . . . . . . . . . . . .  D3\n\n       M. E. Jacobs . . . . . . . . . . . . . . . . . . . . . F13\n       J. F. Jaffee . . . . . . . . . . . . . . . . . . . . . G36\n       J. O. Johnson. . . . . . . . . . . . . . . . . . . . . G14\n\n       R. Kahn . . . . . . . . . . . . . . . . . . . .G17,G19,G20\n       D. Karp . . . . . . . . . . . . . . . . . .F14,G26,G27,G28\n       M. Kay. . . . . . . . . . . . . . . . . . . . . . . . . A5\n       B. F. Kipurov . . . . . . . . . . . . . . . . . . . .  F17\n       L. Kleinrock. . . . . . . . . . . . . . . . . . . .G21,G22\n       D. C. Knight  . . . . . . . . . . . . . . . . . . . . .G35\n\n       B. W. Lampson . . . . . . . . . . . . . . . . . . . .D7,E8\n       D. E. Lawrence. . . . . . . . . . . . . . . . . . . .  G23\n       A. L. Leiner. . . . . . . . . . . . . . . . . . . . .  G24\n       G. J. Lipovsky  . . . . . . . . . . . . . . . . . . .  B14\n       J. L. Little  . . . . . . . . . . . . . . . . . . .F15,F16\n       V. U. Lum . . . . . . . . . . . . . . . . . . . . . .  D11\n\n\n\n\nMullery                                                        [Page 13]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n       J. Madden . . . . . . . . . . . . . . . . . . . . . . . C1\n       S. E. Madnick . . . . . . . . . . . . . . . . . . . . . A6\n       T. Marill . . . . . . . . . . . . . . . . . . . . . D8,G25\n       S. Marshall . . . . . . . . . . . . . . . . . . . . . . C2\n       N. F. McAllister  . . . . . . . . . . . . . . . . . . .F19\n       G. K. McAuliffe . . . . . . . . . . . . . . . . . . . .G16\n       W. C. McGee . . . . . . . . . . . . . . . . . . . . . . A7\n       D. B. McKay . . . . . . . . . . . . . . . . . .G26,G27,G28\n       S. F. Mendicino . . . . . . . . . . . . . . .  . . . . G29\n       R. Metcalf  . . . . . . . . . . . . . . . . . . . . . . C1\n       R. E. Millstein . . . . . . . . . . . . . . . . . . . . C2\n       MIT . . . . . . . . . . . . . . . . . . . . . . . . . .G30\n       C. N. Mooers. . . . . . . . . . . . . . . . . .B15,B16,F16\n       H. R. Morse . . . . . . . . . . . . . . . . . . . . .  B17\n       A. P. Mullery . . . . . . . . . . . . . . . . . . . .  B12\n       J. E. Murphy. . . . . . . . . . . . . . . . . . . . .   D9\n\n       R. S. Nachbar . . . . . . . . . . . . . . . . . . . .  G28\n       K. Nelson . . . . . . . . . . . . . . . . . . . . . .   B9\n       W. A. Notz. . . . . . . . . . . . . . . . . . . . . .  G24\n\n       A. K. Olefir. . . . . . . . . . . . . . . . . . . . .  F17\n       S. Ornstein . . . . . . . . . . . . . . . . . . . . .  G17\n       P. J. Owens . . . . . . . . . . . . . . . . . . . .D10,D11\n       R. C. Owens, Jr.. . . . . . . . . . . . . . . . . . . . E9\n\n       S. S. Patil . . . . . . . . . . . . . . . . . . . . .  G31\n       P. L. Peck, Jr. . . . . . . . . . . . . . . . . .  E10,G32\n       B. Peters . . . . . . . . . . . . . . . . . . . . . .  E11\n       H. E. Petersen. . . . . . . . . . . . . . . . . . . .  E14\n\n       J. L. Redding . . . . . . . . . . . . . . . . . . . .  G33\n       L. G. Roberts . . . . . . . . . . . . . . . . . .  G25,G34\n       S. Robinovitz . . . . . . . . . . . . . . . . . . . . . B8\n       P. D. Rovner  . . . . . . . . . . . . . . . . . . . . . A8\n       J. J. Russel  . . . . . . . . . . . . . . . . . . . .  G35\n       R. M. Rutledge. . . . . . . . . . . . . . . . . . . .  G36\n       R. W. Ryniker . . . . . . . . . . . . . . . . . . . .  G13\n\n       J. H. Saltzer . . . . . . . . . . . . . . . . . . . .  E12\n       K. Sattley. . . . . . . . . . . . . . . . . . . . . . . C2\n       R. A. Scantlebury . . . . . . . . . . . . . . . . .F18,F20\n       M. Shaefer. . . . . . . . . . . . . . . . . . . . . B18,C3\n       M. D. Schroeder . . . . . . . . . . . . . . . . . . .  E12\n       M. E. Senko . . . . . . . . . . . . . . . . . . . . .  D11\n       S. Seroussi . . . . . . . . . . . . . . . . . . . .F14,G36\n       J. F. Sherlock. . . . . . . . . . . . . . . . . . . .  G37\n       A. Shoshani . . . . . . . . . . . . . . . . .C1,D2,D12,G38\n\n\n\nMullery                                                        [Page 14]\n\f\nRFC 290     Computer Networks and Data Sharing Bibliography January 1972\n\n\n       R. O. Skatrud . . . . . . . . . . . . . . . . . . . .  E13\n       D. P. Smith . . . . . . . . . . . . . . . . . . . .B19,B20\n       J. L. Smith . . . . . . . . . . . . . . . . . . . . .  G24\n       T. A. Standish. . . . . . . . . . . . . . . . . . . .  B21\n       D. Steinauer. . . . . . . . . . . . . . . . . . . . . . E2\n       R. H. Stotz . . . . . . . . . . . . . . . . . . . . . . F6\n       A. J. Strnad. . . . . . . . . . . . . . . . . . . . . .D13\n       S. Y. W. Su . . . . . . . . . . . . . . . . . . . . . . A5\n\n       Yu. I. Torgov . . . . . . . . . . . . . . . . . . . . . G1\n       P. J. Trafton . . . . . . . . . . . . . . . . . . . .  F19\n       R. Turn . . . . . . . . . . . . . . . . . . . . . . .  E14\n\n       A. VanDam . . . . . . . . . . . . . . . . . . . . . .  B10\n       R. R. VanSlyke  . . . . . . . . . . . . . . . . .  G11,G12\n       A. L. Vareha . . . . . . . . . . . . . . . . . . . . . G36\n       L. C. Varian . . . . . . . . . . . . . . . . . . . . . G36\n\n\n       W. H. Ware . . . . . . . . . . . . . . . . . . . . E15,E16\n       B. Wegbreit . . . . . . . . . . . . . . . . . . .  B22,B23\n       A. Weinberger . . . . . . . . . . . . . . . . . . . .  G24\n       A. H. Weis . . . . . . . . . . . . . . . . . . . . G36,G39\n       B. D. Wessler  . . . . . . . . . . . . . . . . . . . . G34\n       J. White . . . . . . . . . . . . . . . . . . . . . . .  C1\n       V. K. M. Whitney . . . . . . . . . . . . . . . . . . . D14\n       P. T. Wilkinson . . . . . . . . . . . . . . . . . F18, F20\n       R. S. Wilkov  . . . . . . . . . . . . . . . . . . . .  G16\n       B. Wolfe  . . . . . . . . . . . . . . . . . . . . . . . B8\n       D. Wood . . . . . . . . . . . . . . . . . . . . . . . . C1\n\n       L. P. Yukhnevich  . . . . . . . . . . . . . . . . . .  F17\n\n\n\n\n        [This RFC was put into machine readable form for entry]\n     [into the online RFC archives by Kelly Tardif, Viag�nie 10/99]\n\n\n\n\n\n\n\n\n\n\n\n\n\nMullery                                                        [Page 15]\n\f\n"
}