{
  "series": "Request for Comments",
  "number": "174",
  "howpublished": "RFC 174",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0174",
  "url": "https://www.rfc-editor.org/info/rfc174",
  "title": "UCLA - Computer Science Graphics Overview",
  "pagetotal": "3",
  "year": "1971",
  "month": "jun",
  "body": "\n\n\n\n\n\nNWG                                                    J. Postel, V. Cerf\nRFC # 174                                              UCLA-NMC\nNIC # 6799                                             Computer Science\nCategories: D.6,I.1                                    8 June 71\nReferences: 134\nObsoletes: none\n\n                UCLA-Computer Science Graphics Overview\n\nI. Hardware\n\n   A.  Imlac PDS-1\n\n      We have 2 PDS-1 graphics consoles each with 8K 16 bit words\n      of memory.\n\n      The display screens are mounted with the long axis vertical.\n\n   B.  DEC 340\n\n      We have a DEC 340 Display Station with a light pen.  Associ-\n      ated with the station are a Rand Tablet and a Lincoln Wand.\n      There is a display processor which drives the DEC 340 which\n      reads its instruction from the XDS Sigma 7 memory via dedi-\n      cated memory port.\n\nII. Software\n\n   A.  Imlacs\n\n      We have not as yet developed any software for the PDS-1.\n      We have used the Imlac provided text and graphics support\n      software to utilize the PDS-1's as alphameric and limited\n      graphics consoles (at 1200 baud).\n\n      These are used only with the SEX timesharing system.\n\n   B.  DEC 340\n\n      We have over several years developed a package of Library\n      routines* which interface to FORTRAN programs for use with\n      the DEC 340 and its associated devices.  This station is\n      used only with a stand alone system (RAD 75).\n\n      Several programs have been implemented using these facilities\n      among them are:\n\n*SMOG (sub-program manager for On-Line Graphics).\n\n\n\n                                                                [Page 1]\n\f\nNWG                                                  J. Postel, V. Cerf\nRFC # 174                                            UCLA-NMC\nNIC # 6799                                           Computer Science\n                                                     8 June 71\n\n\n\n         1. MOSAIC\n\n            MOSAIC is an experimental computer graphics program\n            which permits a user to manipulate the parameters of\n            a fairly complex polar co-ordinate equation. The ob-\n            ject is to explore the space of interesting images\n            which can be produced.  Library facilities are provid-\n            ed so that the user can save interesting images.  He\n            can also combine the images in many ways to form mo-\n            saic-like patterns.  An Arriflex 16mm camera can be\n            driven through the use of this program, and we have\n            used the system to generate several films which serv-\n            ed as a basis for video-graphics experiments (TV video-\n            tape).\n\n\n         2. FISHEYE\n\n            Using the interactive part of MOSAIC, and a peculiar,\n            exponential mapping function, studies were made in the\n            presentation of CRT images too large to fit in normal\n            form on our 10\" scope.  The images are mapped in such\n            a way that part of the image is shown at linear scale,\n            the remainder being squeezed up at the outer edges of\n            the screen.  Thus, the global image is always visible,\n            but details are apparent mainly in the linear region.\n            This study formed the basis of an M.S. thesis.\n\n\n         3. MOVIE\n\n            This is a movie script language which allows the user\n            to compose a scenario describing the entrance and exit\n            of images on the CRT.  Mosaics can be created.  Images\n            can fade-in, fade-out, dissolve, expand, zoom, contract,\n            Dramatis personae (in the form of MOSAIC images) can\n            be defined and their movements described.  The program\n            computes the movements of all images for the duration\n            of the film and then calls on the MOSAIC generating\n            routines to make the film.  Camera control is automa-\n            tic.\n\n\n\n                                                                [Page 2]\n\f\nNWG                                                  J. Postel, V. Cerf\nRFC # 174                                            UCLA-NMC\nNIC # 6799                                           Computer Science\n                                                     8 June 71\n\n\nIII. Intentions\n\n   A. Imlacs\n\n      We intend to equip our PDS-1's with the mouse and keyset\n      configuration used at SRI-ARC.  We intend to attempt to\n      make use of PDS-1 programs developed at other sites.  We\n      intend to develop an assembler for PDS-1 programs.  We are\n      thinking about a subroutine Library for PDS-1 graphics for\n      FORTRAN (or other higher level languages).\n\n\n   B. DEC 340\n\n      We intend eventually to bring the DEC 340 hardware and soft-\n      ware facilities into the SEX system.\n\n\n\n      [ This RFC was put into machine readable form for entry ]\n      [ into the online RFC archives by Ignacio Goyret 6/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n"
}