{
  "series": "Request for Comments",
  "number": "305",
  "howpublished": "RFC 305",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0305",
  "url": "https://www.rfc-editor.org/info/rfc305",
  "title": "Unknown Host Numbers",
  "pagetotal": "1",
  "year": "1972",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                            Ralph Alter\nRFC #305                                         BBN\nNIC #9078                                        23 February 1972\n\n\n                          UNKNOWN HOST NUMBERS\n                          --------------------\n\n   In response to a recent minor flurry of confusion, it seems worth\n   announcing publicly the fact that new IMPs are tested (almost\n   always) on the ARPA Net here at BBN before delivery to the intended\n   site.  Accordingly, sites should not be surprised to receive RFCs\n   or at least RSTs from IMPs or Hosts they thought didn't exist, or\n   at least did not exist yet.\n\n   Occasionally, IMPs of some given configuration are tested in a\n   mode where they announce their IMP number as different from what\n   it will be when finally installed.  A variety of reasons may create\n   such a situation.  The latest such occurrence is that a TIP, to be\n   installed shortly at ETAC with IMP number 20 (replacing the 316\n   IMP now at ETAC which is number 20) was recently tested here with\n   McClellan's IMP number (22).  (It couldn't be tested with its own\n   number since the 316 IMP currently at ETAC is using that number.)\n   The result was RSTs from the TIP (Host 3) at IMP 22 - which is\n   network address 150 (226 octal or 96 hex).\n\n   One site asked if their Host tables needed updating.  The answer\n   is _NO_.  We fully expect IMPs tested under these circumstances to be\n   ignored or CLS'd by some Hosts.  We suggest that Host tables (where\n   they are thought to be necessary) be modified only in response to\n   official notification from BBN via either an RFC or an update to\n   Appendix A of BBN Report #1822.\n\n\n   RA/jm\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}