{
  "series": "Request for Comments",
  "number": "453",
  "howpublished": "RFC 453",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0453",
  "url": "https://www.rfc-editor.org/info/rfc453",
  "title": "Meeting announcement to discuss a network mail system",
  "pagetotal": "3",
  "year": "1973",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 Michael D. Kudlick\nRFC # 453                                             SRI-ARC\nNIC # 14317                                           February 7, 1973\n\n\n         Meeting Announcement to Discuss a Network Mail System\n\nPurpose\n\nThe purpose of this RFC is to announce a meeting at SRI-ARC on the\nNetwork Mail problem discussed at the January 1973 Principal\nInvestigators' Meeting in San Diego.\n\nWe have set the meeting for Thursday, February 22, 1973, at 8:30 AM in\nthe SRI-ARC conference room.  If a second day is is needed, Friday would\nbe used.\n\nThe agenda will include a discussion of the problem, and a discussion of\nalternate solutions.\n\nThe goal of the meeting is to produce a clear definition of what the\nsolution ought to be, what steps have to be taken, and who should do\nwhat.\n\nThe results of the meeting will be published as an RFC for further\ndialogue, as is done with other suggested protocols.\n\nAspects of the Problem\n\nThere are already several subsystems existing on the Network whose\nfunction is to send and receive mail.\n\nThe principal problem is to coordinates and extend these subsystems so\nthat\n\n    a.  uniform user and site identifications are used,\n\n    b.  the File Transfer Protocol is utilized to allow mail to be\n        originated and distributed anywhere on the Network without\n        having to go through a central system.\n\n    c.  there is an option for the sender to record the dialogue and\n        have it catalogued for others to read and reference, and\n\n    d.  There is a way to handle mail for TIP users.\n\n\n\n\n\n\nKudlick                                                         [Page 1]\n\f\nRFC 453         Meeting to Discuss a Network Mail System   February 1973\n\n\n        A suggestion made in the past to have a typewriter type terminal\n        permanently attached to TIP's to record all hardcopy messages\n        directed to that TIP should be reviewed.\n\nWe (SRI-ARC) have been looking into the problem of using the File\nTransfer Protocol to allow NIC Journal mail to be sent and delivered\nover the Network, without the user having to know and use NLS.  We\nintend to integrate this function with the Tenex SNDMSG capabilities.\nFor some preliminary internal ARC discussion on this subject, you may be\ninterested in reading two Journal items, one by Charles Irby (IJOURNAL,\n14308,1:w) and the other by Jim White (IJOURNAL, 14312,1:w).\n\n    We realize that there are many benefits to this approach, but would\n    like to have such a scheme fit into an agreed upon Network wide\n    message and document sending protocol.\n\n    Especially important to us is that questions concerning user and\n    site identification, recorded and unrecorded dialogue, and\n    coordination among other mail subsystems on the Network, be fully\n    understood and mutually resolved at the design level before\n    implementation work proceeds.\n\n    We therefore want to discuss these issues at the Network Mail\n    meeting February 22.\n\nRole of the NIC\n\nIn conjunction with the above discussion, we will consider offering the\nservices of the Network Information Center in three related areas:\n\n    to implement and maintain identification files for all network users\n    and sites;\n\n        (These files could be made available in sequential form through\n        a standard socket so that Network sites could either query them\n        or periodically obtain updated copy.)\n\n    to record in the NIC Journal that mail which the sender wishes to\n    have recorded, and to catalogue those items for later reference;\n\n    to distribute Journal or message mail through the Network via File\n    Transfer Protocols if requested;\n\n    to provide and use NIC dialogue group identifications, in order to\n    make it simpler to send items to several persons who had a common\n    interest.\n\n\n\n\n\nKudlick                                                         [Page 2]\n\f\nRFC 453         Meeting to Discuss a Network Mail System   February 1973\n\n\nNetwork Mail Meeting Logistics\n\nIf you or anyone at your site would like to attend the meeting, please\nnotify Mil Jernigan (MEJ) at SRI-ARC:\n    phone (415) 326-6200 ext. 4775\n\nIf you request it, we will make motel reservations for you.\n\nSigned ... MD Kudlick\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nKudlick                                                         [Page 3]\n\f\n"
}