{
  "series": "Request for Comments",
  "number": "369",
  "howpublished": "RFC 369",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0369",
  "url": "https://www.rfc-editor.org/info/rfc369",
  "title": "Evaluation of ARPANET services January-March, 1972",
  "pagetotal": "11",
  "year": "1972",
  "month": "jul",
  "body": "\n\n\n\n\n\nNetwork Working Group                                         J. Pickens\nRequest for Comments: 369               UCSB COMPUTER SYSTEMS LABORATORY\nNIC: 6801                                                   25 July 1972\n\n\n                     EVALUATION OF ARPANET SERVICES\n                      January through March, 1972\n\nABSTRACT\n\n   RFC #302, Exercising the ARPANET, described a group organized at UCSB\n   to investigate the network resources.  The stated goals were to\n   develop problem solving capability and, in the process, produce\n   helpful criticism for the nodes investigated.  This report summarizes\n   the group's experiences and finding and suggests network refinements\n   to improve user satisfaction.\n\n   The group's encounter with ARPANET included many unexpected problems\n   and difficulties.  Most worthy of mention are software heterogeneity\n   and inadequate documentation.\n\n   From this first hand experience the group has formulated criteria for\n   ease in use of network resources.  The report presents these criteria\n   as well as suggestions for improved documentation, better utilization\n   of current resources, and a plea for regular usage of inter-personal\n   communications facilities.  Individual sites have been graded on\n   reliability, response, and friendliness.  Comments regarding specific\n   sites have been included to help in adapting to the needs of\n   uninitiated users.\n\n   Despite problems encountered in the initial nine week exposure,\n   enough was learned of ARPANET resources to enable the group to write\n   useful software.  Programs to effect automatic login, file transfer,\n   and interprocess communication have been written and put to use.\n\nTABLE OF CONTENTS\n\n      BACKGROUND\n         Approach.......................................  2\n         Goals..........................................  2\n      THE SURVEY\n         Extent and Duration............................  3\n         Statistical Results............................  3\n      CRITIQUE OF ARPANET SERVICES\n         A Site Measurement Parameter, \"Friendliness\"...  4\n         Software Critique..............................  5\n         Community Spirit...............................  5\n         Economics......................................  6\n\n\n\nPickens                                                         [Page 1]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\n      SUGGESTIONS FOR IMPROVEMENT\n         Software.......................................  6\n         Community Spirit...............................  7\n      CONCLUSION........................................  8\n      APPENDIX A\n         Sample of Survey Questionnaire................   9\n      APPENDIX B\n         Grades and Comments for Specifics Sites.......  10\n\n\nBACKGROUND\n\nApproach\n\n   The test group was organized from a group of Electrical Engineering\n   graduate students in Computer Science.  Within the group was\n   represented a substantial degree of experience with high level\n   languages and time sharing systems (such as the Dartmouth BASIC and\n   UCSB mathematical graphics systems).  However, no one had experience\n   in exercising ARPANET, and few knew what resources the ARPANET\n   represented.  After two weeks of presentation from Jim White and\n   Roland Bryan, the group was turned loose for open experimentation.\n\n   Enthusiasm was high as each group managed to locate and decode the\n   login procedures for various nodes and began to learn how to use the\n   available resources.  In fact, half of the weekly seminar time was\n   devoted to sharing learned experiences and procedures.  Interest,\n   however, lagged some as the quarter progressed due to poor network\n   site reliability, few active nodes, and hard to locate documentation\n   (only five out of fourteen students remained active after the first\n   quarter).\n\nGoals\n\n   The primary goal of the group was to learn how to use and to evaluate\n   network resources.  It was decided to be fair but direct in\n   evaluating each site, including UCSB.  Since the level of networking\n   experience was initially low, the evaluation criteria was dictated\n   mostly by gut feelings.\n\n   At the conclusion of the first quarter's effort, a questionnaire was\n   given to the students (a sample of which is included in Appendix A).\n\n\n\n\n\n\n\n\n\nPickens                                                         [Page 2]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\n   The group response is summarized for overall performance below.  Data\n   for individual sites is presented in Appendix B. Some of the\n   questions asked were the following:\n\n      Estimate percentage of time spent in various trouble states\n      Estimate the mean time to failure\n      Describe personal experience with the network\n      Suggest improvements\n      Grade the investigated nodes on the factors of reliability,\n      response, and friendliness\n\nTHE SURVEY\n\nExtent and Duration\n\n   During the period in which the major effort was expended (January-\n   March, 1972) relatively few nodes were active.  Experimentation,\n   therefore, concentrated most heavily on UCSB, BBN-TENEX, MIT-MULTICS,\n   and SRI-ARC.  Minor investigation was performed of HARV-10, UCLA-NMC,\n   and UCLA-CCN.  The remaining sites were either inactive or\n   inaccessible for lack of documentation.\n\n   Activity included the following:\n\n      Game playing (e.g., chess, life, and doctor at BBN-TENEX)\n      Text and file manipulation (e.g., COL, NLS, TECO)\n      Inter-personal communication (LINK and SNDMSG)\n      On line compilation (e.g., TENEX FORTRAN, MULTICS PL/1).\n\nStatistical Results\n\n   Figure 1 below summarizes the overall response to the questionnaire\n   given to the group after nine weeks experience with the ARPANET.\n   Individual exposure varied from ten to sixty hours, and twelve\n   students responded.  Each survey item is presented as a group average\n   (sum/12) and is supplemented with a low and a high value to show the\n   range of response.  The questions were slightly ambiguous in that\n   they failed to distinguish between node inactivity and local NCP\n   inactivity.  Also, some figures may reflect individual students'\n   inadequacy in understanding local and foreign procedures.\n   Nevertheless, the data is interesting as a look into uninitiated user\n   experience.\n\n\n\n\n\n\n\n\n\nPickens                                                         [Page 3]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\nFigure 1\n\n   Survey Item                                Average    Low    High\n\n   % of time unable to log in any site         12,4%     2%     25%\n   % of time unable to log into desired site   35.7      20     75\n   % of time foreign site suddenly crashes     13        5      50\n   % of time local site suddenly crashes       12.5      5      25\n   % of time trouble free operation            35        0      80\n   Approximate mean-time-between-failure       1h       5 min   2 hrs\n\n   TOTAL TIME INVESTED                         32.3hrs  10 hrs  60 hrs\n\n   First to be noted is that considering the entire ARPANET complex, no\n   one approximated the mean-time-between-failure at more than two\n   hours!  Secondly, the average time for \"trouble free\" operation was\n   35%, a figure untenable for regular user usage.  In all fairness,\n   however, some sites were much more \"trouble free\" than others, and\n   individuals tend to define the term by the level of their own\n   competence and experience, thus explaining the high of 80% and the\n   low of 0%.\n\nCRITIQUE OF ARPANET SERVICES\n\nA Site Measurement Parameter, Friendliness\n\n   Much discussed by the group was the concept of \"friendliness\",\n   especially as it applies to on-line systems.  The following\n   definition of friendliness is offered, based on direct network\n   experience.\n\n   Friendliness is:\n\n      Concise, complete, and available documentation.\n      Easy system usage (e.g., minimum numbers of keys for login\n      system and job status readily available).\n      Easy to reach help both on-line people and on-line files.\n      No messages overkill (as sometimes unexpectedly occurs\n      during login).\n      Reasonable reliability and response time\n      Concise, but informative error diagnostics\n\n   The reader can probably think of more criteria, but these were the\n   outstanding points of friendliness generated specifically by the\n   group's experience.\n\n\n\n\n\n\nPickens                                                         [Page 4]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\nSoftware Critique\n\n   1) Initial experimentation concentrated on login procedures, canned\n   scenarios (e.g., Abhay K. Bhushan's ARPANET scenario, RFC #254), game\n   playing, and inter-personal communication.  As the effort continued,\n   attempts were made to solve problems at various nodes.  One student,\n   for example, programmed a Newton-Raphson root finder in PL/1 at MIT-\n   MULTICS a blackbody problem in FORTRAN at BBN-TENEX and MIT-MULTICS,\n   and in PL/1 at MIT-MULTICS; and a Discrete Fourier Transform in BASIC\n   at BBN-TENEX.  It is the group's conclusion that small problems can\n   be written in a half hour, entered and edited in fifteen minutes and\n   debugged in another fifteen minutes.  For small problems the current\n   ARPANET software resources are quite adequate.\n\n   2) By far the most annoying difficulty was obtaining adequate\n   documentation.  The resource notebook was found to be interesting but\n   of limited utility.\n\n   3) Information about each node's NCP, which was requested in\n   February, 1972, is still unavailable.\n\n   4) Significant variations in procedures were found in executing\n   similar tasks on different nodes.  Consider, for example, the wide\n   variety of text editors with unique file naming, editing, and\n   manipulation commands (TENEX, TECO, COL, NLS...).  Consider, too, the\n   wide variety of compilation, load and execute procedures (RJE for\n   UCSB edit, save, compile, save, load, execute for TENEX systems).\n   Even more disparate are the \"executive level\" commands with all their\n   varieties (TENEX's \"Control-C\", UCLA-NMC's \"X\", UCSB's \"RESET\" ...\n   all of which return to the \"top-lvel\").  Software heterogeneity is a\n   stumbling block to the user.\n\n   5) Residents of large nodes are hard pressed to find problems which\n   should be solved outside of the local environment.  With UCSB's\n   mathematical graphics on-line system and direct access to batch, the\n   group experienced apprehensive twinges spending hours on the network\n   solving problems which could be solved in minutes locally.\n\nCommunity Spirit\n\n   1) Individuals sometimes got the impression (erroneously it is hoped)\n   that some researchers in the ARPA community had little desire to\n   consult and/or help.  On the other hand, others bent over backwards\n   in giving assistance.  The group had hoped for a more consistent\n   response.\n\n\n\n\n\n\nPickens                                                         [Page 5]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\n   2) There was difficulty in locating the source of responsibility for\n   resource development.  It seemed to the seminar group that the\n   complete distribution of responsibility negated incentive to locate,\n   document, and create useful network resources.\n\nEconomics\n\n   Network economics at levels above as well as the communications\n   level, are a big user problem, e.g., if distributed computing is\n   allowed, then distributed billing is a necessity.  It is frustrating\n   to watch accounts randomly die at different nodes and have to spend\n   weeks in monetary renovation.  This problem was experienced with a\n   site which (a) randomly changed passwords and then (b) eliminated its\n   free account.  Also there is a problem with double connect charges,\n   e.g., $4.00 per hour at UCSB to sign on to BBN-TENEX at $8.00 per\n   hour, which totals to $12.00 per hour!\n\nSUGGESTIONS FOR IMPROVEMENT\n\n   In spite of the many difficulties and frustrations, the class was\n   impressed with the potential of ARPANET and produced several\n   suggestions for improvement.\n\nSoftware\n\n   1) Working groups should be organized to define problems which\n   require the use of a significant set of the network resources.\n\n   2) The ARPANET represents a great resource already, even with TELNET\n   as the only operational protocol.  More effort should be put in\n   utilization of what currently exists.  Two illustrative examples\n   follow:\n\n      a) By combining the resources represented by UCSB's OLS and UCSB's\n         TELNET, user programs were created to sign on automatically to\n         the various sites.  Thus a network user need know only the\n         sign-on procedure for UCSB; all settings of local/remote echo,\n         character/line at a time, upper/lower case, etc. are taken care\n         of automatically by the pre-written user programs.\n\n      b) Combining the resources of TELNET PROTOCOL, PL/1 subroutine\n         calls to the UCSB NCP, and 360 O/S multi-programming, a group\n         of students created a batch-fed command language in PL/1 to\n         communicate via telnet with foreign sites.  This program has\n         been used successfully to investigate file transfer (NIC files\n         are regularly copied on 8-1/2 x 11\" white printer paper, and\n         cards will soon be transferred to I4-TENEX), interprocess\n         communication (a program was started at BBN-TENEX to be used as\n\n\n\nPickens                                                         [Page 6]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\n         a subroutine locally; plans exist to initiate and monitor a\n         chess game between BBN-TENEX and SU-AI), and data transfer\n         (pre-formatted files of data have been transferred from UCLA-\n         NMC to UCSB; UCLA-NMC will soon make available survey and\n         measurement data ala TELNET PROTOCOL and through direct ICP!).\n         Moe details of this program will be available in a future\n         report.\n\n   3) Documentation: A self-sufficient mini-user-manual (MINIMAN) should\n   exist for each site and also for each function network wide, such as\n   the FORTRAN compilers.  The MINIMAN would be similar in some respects\n   to the resource notebook, but would be more oriented to helping the\n   user run.  A site dependent MINIMAN would contain the following:\n\n      Sign on procedure\n      Simple file manipulation and editing commands\n      Compilation and execution instructions\n      TELNET access\n      Brief (!) summary of programs and subroutines\n      Direction on how to get help.\n\n   Overall documentation of hardware, software and human resources\n   should be more complete.  A documentation questionnaire should\n   perhaps be circulated to authors of network programs, including the\n   authors of Network Control Programs.  Merging information from the\n   questionnaire with the Resource Notebook would facilitate the\n   construction of a resource-location cross referenced index.  Such an\n   index, perhaps on-line, would aid the network user in locating both\n   software and hardware.  Whatever the final scheme, more planning is\n   required to improve the user versus documentation battle.  The recent\n   effort in this direction by Marshall D. Abrams entitled \"Serving\n   Remote Users on the ARPANET\" (NIC 10606 RFC #364) is well timed and\n   should be thoroughly considered.\n\n   4) Finally, high level subroutine calls to each NCP, such as those\n   offered by UCSB, should be universally available.\n\nCommunity Spirit\n\n   1) Networks have great though unexploited potential for inter-\n   personal communication.  The communication resources (NIC's JOURNAL,\n   NLS TENEX's SENDMSG, LINK; UCLA-NMC'S S_.MSG:C to name a few) are\n   used today only by the proficient few, but should be utilized\n   regularly by all.  Two symptoms of the current state of network\n   communications from the group's point of view are that most\n   procedural information was shared verbally in class and that many\n\n\n\n\n\nPickens                                                         [Page 7]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\n   problems in locating documentation were solved by a last resort to\n   that old standby, the telephone.  Improved communications will\n   stimulate cooperation on joint projects.\n\n   2) Names and interests of programmers/researchers willing to\n   cooperate on joint projects and corresponding \"blue sky\" lists of\n   software projects should be maintained.\n\n   3) A network NEWS and NOTES should be published to inform and advise\n   network participants of new resources and procedural modifications.\n   Care must be taken, however, to keep this document concise (i.e.,\n   avoid \"message over-kill\").  Perhaps a one page flier published\n   weekly would meet this need.\n\n   4) A network consulting center should be created, perhaps at the\n   existing NIC, which would specialize in non-partisan matching of\n   network users to network resources.\n\n   5) A strong potential of the network is in Computer Science\n   education.  Being exposed to many varieties of computer systems helps\n   the student/user avoid the narrowness of experience and opinion which\n   sometimes exists in centers of learning and computing.  In this\n   respect the TIP user is probably the most benefited as, for little\n   investment in local resources, many styles of systems are at his\n   \"finger-tips\".  Yet even for service nodes, the network represents an\n   inexpensive extension to local educational resources.  Current\n   efforts to tap the educational value of ARPANET should be encouraged\n   and extended.\n\nCONCLUSION\n\n   Existing site surveys measure and evaluate the performance of IMP\n   hardware, host hardware, and host NCP programs, but little has been\n   done to evaluate software performance.  The UCSB EE 210 graduate\n   students attempted a primitive first pass evaluation of network\n   resources in the period between January and March 1972.  Out of this\n   effort have come definitions and criteria which would be useful to\n   other individuals or agencies in developing evaluation schemes on the\n   USER protocol level.  To this end, it is hoped that this report is\n   useful.\n\n\n\n\n\n\n\n\n\n\n\nPickens                                                         [Page 8]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\nAPPENDIX A - Sample Student Questionnaire\n\nARPANET\n\n   Grade Given:  A=Excellent                 Evaluation by:\n                 F=Bad\n\n   -------------------------------------------------------------------\n   SITE | RELIABILITY| RESPONSE | FRIENDLINESS | # HOURS  | COMMENTS |\n        |            |          |              |   USED   |          |\n   -----|------------|----------|--------------|----------|----------|\n        |            |          |              |          |          |\n        |            |          |              |          |          |\n\n                            ARPANET Evaluation\n\n   -- Indicate % of your sessions which were in the following categories:\n\n              %               State\n         +--------+-------------------------------------------+\n         |        |  Unable to Log in to any site.            |\n         |--------|-------------------------------------------|\n         |        |  Unable to Log in to Desired site.        |\n         |--------|-------------------------------------------|\n         |        |  Foreign site suddenly crashes.           |\n         |--------|-------------------------------------------|\n         |        |  Local site crashes.                      |\n         |--------|-------------------------------------------|\n         |        |  Trouble free operation.                  |\n         |--------|-------------------------------------------|\n         |        |  Other                                    |\n         +--------+-------------------------------------------+\n\n   -- Considering the performance of the local host, communication\n      network, and remote hosts, estimate the mean time to failure of\n      ARPANET:\n         Mean-Time-Between-Failure=___________\n\n   -- What was your total time invested in the ARPANET this quarter?\n         Total Time Invested=___________\n\n   -- Describe your overall experience with the ARPANET (e.g., rise and\n      fall of personal interest factors involved, etc.).\n\n   -- What suggestions for changes or improvements or new capabilities\n      do you have to make to ARPANET hosts?\n\n      (Use back side or other paper for these questions if necessary)\n\n\n\nPickens                                                         [Page 9]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\nAPPENDIX B - Specific Sites, Grades and Comments\n\n   The following grades and comments are based on the two to four most\n   representative questionnaire responses for each site.  Reliability,\n   Response, and Friendliness are averaged grades and reflect subjective\n   criticism.  Total Invested time is the sum total of the\n   experimentation times reported by individual respondents.  It is\n   hoped that future evaluations might be more specific and complete\n   than the current efforts, yet the value of these initial efforts\n   should not be underestimated.\n\n   Grades:\n\n         A=Excellent\n\n         F=Bad\n                                                    Total Time\n   Site        Reliability  Response  Friendliness   Invested\n   --------------------------------------------------------------\n   BBN-TENEX       A            A         A             71 hours\n   UCSB            B            B+        B-            36\n   SRI-ARC         B            B         A             75\n   HARV-10         C            A-        B             14\n   UCLA-NMC        C-           C         D             14\n   MIT-MULTICS     C-           D         C+            82\n   --------------------------------------------------------------\n\nGroup Comments\n\n      Site:  BBN-TENEX\n         Very popular site\n         Doctor, life and chess are stimulating and easy to use games\n         Operators are very helpful\n         Account problems kept site from being useful\n         BASIC is well-written and easy to use\n         FORTRAN is difficult to use because of the many steps to\n         create-compile-execute.\n\n      Site:  UCSB\n         There are many problems with old key boards\n         TELNET diagnostics are poor\n         Online help files are sorely lacking\n         Graphics are necessary for full utility\n         Operator would not reload NCP when down\n         List of TELNET site names are not current or complete\n\n\n\n\n\n\nPickens                                                        [Page 10]\n\f\nRFC 369              EVALUATION OF ARPANET SERVICES            July 1972\n\n\n      Site:  SRI-ARC\n         Good documentation exists on NLS specifics, but general\n           overview is lacking\n         Inter-console link is convenient and often used.\n         NLS-JOURNAL is useful but requires significant training\n         Online perusal is difficult at terminals with small display faces.\n\n      Site:  HARV-10\n         Operator is readily available\n         FORTRAN is straight forward\n         Easy to use editor\n         Couldn't get operator to put BASIC on.\n\n      Site:  UCLA-NMC\n         Self-explanatory ABACUS program is not self-explanatory\n         System often disappears\n         Hard to get past LOG ON* without TIMEOUT GOODBYE\n         Message system is well organized.\n\n      Site:  UCLA-CCN\n         Always up, but nothing can be done (HELP is not supported)\n         When RJS is executed, there is no response until correct signon\n         procedure is entered (spurious death indication).\n\n      Site:  MIT-MULTICS\n         Response is very slow\n         Automatic logout of autonomous user is excruciatingly painful\n         Text editor is very easy and helpful\n         PL/1 and FORTRAN are easy to use.\n\n\n\n\n\n        [This RFC was put into machine readable form for entry]\n     [into the online RFC archives by H�l�ne Morin, Viag�nie 12/99]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPickens                                                        [Page 11]\n\f\n"
}