{
  "series": "Request for Comments",
  "number": "489",
  "howpublished": "RFC 489",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0489",
  "url": "https://www.rfc-editor.org/info/rfc489",
  "title": "Comment on resynchronization of connection status proposal",
  "pagetotal": "1",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                     Jon Postel\nRequest for Comments: #489                                UCLA-NMC\nNIC #15298                                                March 26, 1973\n\n\n       Comment on Resynchronization of Connection Status Proposal\n\n\nThis is a comment on the proposal by Burchfiel and Tomlinson in RFC 467\nfor a procedure in the host-to host protocol for resynchronization of\nconnection status.  I endorse their proposal with the following trivial\nchange.  The commands proposed might be more appropriately be called\n\"reset connection allocation sender\" and \"reset connection allocation\nreceiver\" since the only aspect of the connection which is reset is the\nallocation.  I therefore use the names RAS and RAR respectively.\n\nThe table below shows in overly concise notation my interpretation of\nthe resynchronizing procedure proposed by Burchfiel and Tomlinson, this\npresentation is not intended to supersede their document but to clarify\nthe procedure.  The sequence shown here can be initiated by either the\nsender or receiver either for internally generated reasons or upon the\nreceipt of a RAS or RAR, if this latter is the case then sender step 5\nor receiver step 4 is satisfied.\n\nSENDER                                 RECEIVER\n\n1. Set state to \"wait-for-RAR\"         1. Set state to \"wait-for RAS\"\n2. Wait till no RFNM outstanding       2. Send RAR\n3. Send RAS                            3. Process messages until\n4. Process allocates until             4. RAS received then\n5. RAR received then                   5. Zero allocation quantities\n6. Zero allocation quantities          6. Set state to \"open\"\n7. Set state to \"open\"                 7. Send a new allocate\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\nPostel                                                          [Page 1]\n\f\n"
}