{
  "series": "Request for Comments",
  "number": "38",
  "howpublished": "RFC 38",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0038",
  "url": "https://www.rfc-editor.org/info/rfc38",
  "title": "Comments on Network Protocol from NWG/RFC \\#36",
  "pagetotal": "1",
  "year": "1970",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                   Stephen M. Wolfe\nRequest for Comments: 38                                        UCLA CCN\n                                                           20 March 1970\n\n                      Comments on Network Protocol\n                            from NWG/RFC #36\n\n   The proposed protocol does not allow for the possible multiplexing of\n   connections over links.\n\n   Generally, this presents no problem, but it might cause loading\n   restrictions in the future. Two cases where routing multiple\n   connections over the same link are apparent:\n\n         a) Where a user has several high speed connections, such as\n            between processes that transmit files over the network.\n            Assigning these connections to the same link limits the\n            percentage of network resources that may be used by that\n            user. This becomes particularly important when several\n            store-and-forward IMP's are used by the network to effect\n            the communication.\n         b) When two hosts each have their own independent network and\n            desire to allow access to the other hosts's network over\n            the ARPA net, a shortage of links may develop. Again, the\n            assignment of several connections to the same link could\n            help solve the problem.\n\n   The following changes in the protocol would make possible the future\n   use of multiplexed links. It is not necessary to add the\n   multiplexing, itself, to the protocol at this time.\n\n         a) The END and RDY must specify relevant sockets in addition to\n            the link number. Only the local socket name need be\n            supplied.\n         b) Problems arise with the RSM and SPD commands. Should they\n            refer to an entire link, or just to a given connection?\n            Since there is a proposal to modify the RFNM to accommodate\n            these commands, it might be better to add another set of\n            commands to block and unblock a connection, but I am not\n            convinced that that is the best solution.\n         c) The destintation socket must be added to the header of each\n            message on the data link. Presumably this would consist of\n            32 bits immediately after the header and before the marking.\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Karl Reinsch 1/97 ]\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}