{
  "series": "Request for Comments",
  "number": "498",
  "howpublished": "RFC 498",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0498",
  "url": "https://www.rfc-editor.org/info/rfc498",
  "title": "On mail service to CCN",
  "pagetotal": "3",
  "year": "1973",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNETWORK WORKING GROUP                                   ROBERT T. BRADEN\nRFC #498                                                UCLA/CCN\nNIC #15715                                              APRIL 17, 1973\n\n\n                         ON MAIL SERVICE TO CCN\n\n\n    Most of the recent documents on mail protocols have discussed the\nfacilities desired at \"post-office\" hosts, i.e. those which provide\nstore-and-forward services. CCN has no plans to provide post-office\nservices; we expect to receive mail only for the staff of CCN.  Our\ngreatest concern is to get messages reliably to and from our\nadministrative and user support people who don't habitually use on-line\nterminals, so we are printing out all mail and distributing it by\ncourier/secretary.\n\n    Let me say a friendly word for SNDMSG.  This Tenex command, which\nuses the FTP MAIL command to deliver messages, is very simple but\nextremely useful--probably because it is so simple.  Furthermore, it is\none of the well-kept secrets of the Network that SNDMSG can be used to\nsend messages to any host which supports the MAIL command (without\nrequiring logon to FTP).  Thus, to send a message to anyone at CCN, the\nrecommended procedure is to do SNDMSG to \"name@CCN\".  This connects to\nCCN's FTP and sends a \"MAIL name\" command followed by the message.  We\nnow accept any \"name\" and print an immediate upper-case copy which is\ndistributed to the recipient's office.  So, if you SNDMSG to\n\"BRADEN@CCN\", your message will end up on my desk, usually within a few\nhours.  Other useful SNDMSG destination at CCN are:\n\n           WBK@CCN or KEHL@CCN      (the Director)\n\n           RIB@CCN or BELL@CCN      (Supervisor Of User Relations)\n\n           BBN@CCN or NOBLE@CCN     (Barbara Noble, User Consultant)\n\nThis fine service is brought to you by your friendly neighborhood Tenex.\n\n    On the other hand, the Tenex READMAIL command is a little too\nsimple.  After giving you a message, it should ask you whether you want\nto delete, keep, forward, and/or repeat the message.\n\n    Dave Crocker of NMC has suggested an extension to the MAIL and MLFL\n(Mail File) commands in CCN's FTP to allow CCN to serve as a mail\ndelivery station for NMC as well as CCN.  This extension is intended to\nbe a trivial subset of the full-blown mail protocol which is currently\nbeing developed by Jim White et al.  It is a simple means to allow CCN's\nhigh-speed printers to be used conveniently for receiving and\n\n\n\nBRADEN                                                          [Page 1]\n\f\nRFC 498                  ON MAIL SERVICE TO CCN               April 1973\n\n\ndisseminating Network documentation as well as messages.  It is based\nupon extensions of the pathname/user name fields in the MLFL/MAIL\ncommands, respectively.  The proposed syntax is as follows:\n\n                           __                   __\n                          |                       |\n                          | ;D[DOCUMENT]          |\n                          | ;M[MESSAGE]           |\n               \u003cuserid\u003e   | ;C[COPIES]= \u003cinteger\u003e |\n                          | ;BIN= \u003cinteger\u003e       |\n                          |__                   __|\n\nThe semantics would be:\n\n    (1) \u003cuserid\u003e  will normally be a valid TSO userid; this will be used\n                  to determine a charge number to account for the\n                  printing. If \u003cuserid\u003e is _not_ recognized, the rest of\n                  the parameters will be ignored, but the mail will\n                  still be accepted. The result will be to print one\n                  copy immediately in upper case and send it to Bin\n                  9906, charging it to an overhead account.\n\n    (2) MESSAGE   means print a copy immediately using the normal\n                  upper-case-only train. This is the default.\n\n    (3) DOCUMENT  means enqueue the text for overnight printing with an\n                  upper/lower case print train.  A message indicating\n                  receipt (and perhaps the first block) will also be\n                  printed immediately in upper case and distributed.\n\n    (4) COPIES    makes multiple copies. [This facility will not be\n                  available immediately].\n\n    (5) BIN       specifies CCN bin to receive output. Default will be\n                  9906 (ARPA mail bin).\n\n    Each incoming message will be time-and-date-stamped.  The time/date\nwill appear on the first page of the message (on a separate page in the\ncase of upper/lowercase), in the 256 acknowledgment message from FTP,\nand on our system log file.  This time/date stamp may be useful for\nusers to keep tabs on their documents, and to allow us to track down\nmissing messages. The semicolon and equal sign delimiters of this syntax\nare acceptable in the \"user\" parameter to SNDMSG.\n\n    This extended MAIL syntax will be implemented by June 1.\n\nRTB/gjm\n\n\n\n\nBRADEN                                                          [Page 2]\n\f\nRFC 498                  ON MAIL SERVICE TO CCN               April 1973\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBRADEN                                                          [Page 3]\n\f\n"
}