{
  "series": "Request for Comments",
  "number": "93",
  "howpublished": "RFC 93",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0093",
  "url": "https://www.rfc-editor.org/info/rfc93",
  "title": "Initial Connection Protocol",
  "pagetotal": "1",
  "year": "1971",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        A. McKenzie\nRequest for Comments #93                                             BBN\nUpdates RFC's 66, 80                                        January 1971\n\n\n                      Initial Connection Protocol\n\n\n        A review of the Initial Connection Protocol (ICP) first\ndescribed in RFC #66 and restated in RFC #80 has revealed an area of\nambiguity, which in turn reflects an ambiguity in the Host-Host\nProtocol Document No. 1.  This is the definition of the message sent\nover the connection from \"Server socket #1\".  In both referenced\nRFC's, the message is defined as \"exactly an even 32 bit number\".  It\nis not clear, however, whether this 32 bit number is meant to follow\nan eight-bit \"message data type\" code or not, stemming from the fact\nthat the Host-Host Protocol makes provision for such codes but does\nnot seem to absolutely demand them.\n\n        Only one implementation of an ICP has been documented in the\nNWG literature - that at UCSB (RFC #74).  The implementers of this ICP\nhave apparently interpreted the Host-Host Protocol as demanding a\nmessage data type code, and therefore do transmit a code of zero.\n\n        Steve Crocker indicates (private communication) that the Host-\nHost Protocol was intended to require a message data type code.  We\ntherefore recommend that RFC numbers 66 and 80 be amended to show that\nthe \"even 32 bit number\" is preceded by a message data type code of\nzero (zero is the only code currently defined).\n\n\n       [ This RFC was put into machine readable form for entry ]\n        [ into the online RFC archives by James Thompson 4/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}