{
  "series": "Request for Comments",
  "number": "295",
  "howpublished": "RFC 295",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0295",
  "url": "https://www.rfc-editor.org/info/rfc295",
  "title": "Report of the Protocol Workshop, 12 October 1971",
  "pagetotal": "4",
  "year": "1972",
  "month": "jan",
  "body": "\n\n\n\n\n\nNWG/RFC #295                             JBP 2-JAN-72 15:35  8355\nProtocol Workshop Report\n\nReport of the Protocol Workshop\n\n   12 October, 1971\n\n   By Jon Postel.\n\nIntroduction\n\n   This is a report on the decisions reached at the protocol workshop\n   held in conjunction with the Network Working Group meeting held in\n   Cambridge from 10 to 14 October, 1971.\n\n   The workshop addressed itself to protocols of four types: IMP-Host,\n   Host-Host, Initial Connection, and Process-Process.\n\nIMP-Host Protocol\n\n   The idea of IMP provided status reports to be exchanged via new\n   IMP-Host protocol messages was discussed and rejected because it was\n   felt that the level of state information which could be reported was\n   not sufficient to be worth the trouble of implementing this mechanism.\n\nHost-Host Protocol\n\n   The Host-Host Protocol was discussed and several problems were brought\n   to light, among them were the following listed together with the\n   group's recommendations.\n\n      The GVB - RET mechanism may prove useful sometime in the\n      future so it will be retained though no one appears to be\n      using it now, however spontaneous RET commands are\n      explicitly prohibited.\n\n      The ECO - ERP commands are useful and should be supported,\n      but spontaneous ERP commands are explicitly prohibited.  A\n      further restriction is that a second ECO will not be sent\n      until the first ECO has been answered.  Note that any of\n      the following may be an answer to an ECO: ERP, RST,\n      \"Destination dead\", or \"Incomplete Transmission\".\n\n      The RST - RRP commands are useful, but the proper use of\n      these commands for determining the status of host software\n      is still open for discussion (please direct comments to Jon\n      Postel), however spontaneous RRP commands are explicitly\n      prohibited.\n\n\n\n                                                                [Page 1]\n\f\nNWG/RFC #295                             JBP 2-JAN-72 15:35  8355\nProtocol Workshop Report\n\n   The problem of unmatched CLS commands are discussed and four\n   \"solutions\" were proposed:\n\n      Hold forever\n\n      Send a RST and clear the entry\n\n      Clear the entry and possibly mess up a future connection\n\n      Assign socket numbers in a sequential fashion to reduce\n      the possibility of confusion and clear the entry.\n\n   Note that the first two suggestions follow the protocol while the last\n   two do not.\n\n   The idea of flow control on the control link was suggested.  A Request\n   for Comments is to be prepared exploring this idea more fully.\n\n   The usefulness of the ERR command is compromised if the receiver\n   mearly throws it out.  Thus ERR's are to be logged, if at all\n   possible, and checked out with the sending site.\n\n   The NCP document should make clear the implications of queueing or not\n   queueing STR \u0026 RTS commands.\n\nInitial Connection Protocol\n\n   The Initial Connection Protocol (ICP) was discussed and found to be\n   satisfactory however the following points were stressed:\n\n     The socket number sent by the logger (S) must be in\n     agreement with the socket numbers used in the STR \u0026 RTS\n     sent by the logger.\n\n     The implications of queueing or not queueing of RTS \u0026 STR\n     commands should be made clear in the ICP document.  This is\n     particularly important if the user chooses the \"listen\"\n     option.\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nNWG/RFC #295                             JBP 2-JAN-72 15:35  8355\n   Protocol Workshop Report\n\nTelnet Protocol\n\n   The Telnet committee has been reactivated to consider the following\n   problems:\n\n     Clarification of the terminology half duplex, full duplex,\n     character mode, line mode, ASCII, and echoing.\n\n     Clarification of the end of line convention. Especially to\n     answer the question \"Should there be a special end-of-line\n     character?\"\n\n     Clarification of the conditions for leaving Hide-your-input mode.\n\n     Clarification of the operation of Break and Synch.\n\n     Specification of a server-to-user Synch.\n\n     Clarification of the definition of the Network Virtual Terminal.\n\n     Preparation of a new document defining the Telnet protocol\n     with the above improvements.\n\nThe protocol workshop did agree that:\n\n  It is the servers option for disconnection to imply logout\n  or not.\n\n  It is the servers option for logout to imply disconnection\n  or not.\n\n  Extra characters used locally to fill the time for format\n  effectors to take effect should not be sent over the\n  network\n\n  Synch means to examine the data stream from the current\n  point to a data mark (x'80').  If any break type characters\n  (e.g. etx, sub, Break) are found they are to have their\n  normal effect.\n\n  Upper and lower case are to be available to all Telnet users.\n\nData and File Transfer Protocol\n\n   The Data and File Transfer Committee will report separately.\n\n\n\n                                                                [Page 3]\n\f\nNWG/RFC #295                             JBP 2-JAN-72 15:35  8355\nProtocol Workshop Report\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n"
}