{
  "series": "Request for Comments",
  "number": "336",
  "howpublished": "RFC 336",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0336",
  "url": "https://www.rfc-editor.org/info/rfc336",
  "title": "Level 0 Graphic Input Protocol",
  "pagetotal": "2",
  "year": "1972",
  "month": "may",
  "body": "\n\n\n\n\n\nNIC 9929                                                Ira Cotton\nNWG/RFC #336                                            Mitre\nLevel 0 Graphic Input Protocol                          5 May 1972\n\n        Level 0 Graphic Input Protocol\n\n           At its meeting on April 16-18 the network Graphics working\n           group began to consider the definition of levels of protocol\n           for graphic Input Protocol.  The following describes the\n           Level 0 graphics input protocol.\n\n           The philosophy guiding the establishment of this protocol is\n           the same as suggested in RFC #178, \"Network Graphic Attention\n           Handling.\" Briefly, all input will be described by type,\n           origin, and length, followed by the actual data.\n\n           Only two types of input are defined at Level 0: text and\n           simple position.\n\n              Text Input\n\n                  Text input will be conveyed in the following format:\n\n                   TEXTIN : DEVICE : COUNT: Text String\n\n\n\n                 TEXTIN is a protocol code indicating the nature of this\n                 input string.  For the present this code is defined to\n                 be 1.\n\n                 DEVICE is a code indicating the device from which the\n                 input originated.  The following codes are presently\n                 defined:\n\n                      0 - unspecified device\n                      1 - primary keyboard\n                      2 - tablet\n                      3 - mouse\n                      4 - joystick\n                      5 - lightpen\n                      6 - cursor\n                      7 - keyset\n                      8 - mouse \u0026 keyset\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNIC 9929\nNWG/RFC# 336\nLevel 0 Graphic Input Protocol\n\n                 Count is an integer number indicating the number of\n                 characters (bytes) which follow.\n\n                 Text String is a string of \"Count\" bytes of characters\n                 in network ASCII.\n\n              Position Input\n\n                   Simple position data will be conveyed in the\n              following format:\n\n                   POSIT : DEVICE : COUNT : x : y\n\n                 POSIT is a protocol code indicating that this string\n                 contains position data.  For the present this code is\n                 defined to be 2.\n\n                 DEVICE is a code indicating the input device on which\n                 this data was generated.  The codes are as defined\n                 above.\n\n                 COUNT is an integer number indicating the number of\n                 bytes of data which follow.  This includes data for\n                 both x and y coordinates.  Thus, the number of bytes of\n                 x coordinate data is COUNT divided by 2.  At level 0,\n                 COUNT should always be 4, since at this level all\n                 coordinates are expressed in 2 bytes of data.\n\n                 x and y coordinate data are represented as signed\n                 fractions in the same fashion that position data is\n                 represented in the Level 0 graphic output protocol.\n\n           It should be emphasized that input data from a level 0\n           graphics user which is not in a format described above should\n           be sent on a different link than the graphics input link.\n           This may be desirable for certain applications to avoid the\n           overhead of the protocol.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}