{
  "series": "Request for Comments",
  "number": "47",
  "howpublished": "RFC 47",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0047",
  "url": "https://www.rfc-editor.org/info/rfc47",
  "title": "BBN's Comments on NWG/RFC \\#33",
  "pagetotal": "4",
  "year": "1970",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group\nRequest for Comments #47                                    J. Postel\n                                                            S. Crocker\n                                                            UCLA\n                                                            20 April 70\n\n\n                     BBN's Comments on NWG/RFC #33\n\nBBN has given us the attached comments on NWG/RFC 33, but wouldn't\npublish them being relectant to embarrass us.  Embarrassment notwith-\nstanding, we found the comments particularly useful and decided to share\nthem with our friends.  Bill Crowther is the author.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nRFC 47               BBN's Comments on NWG/RFC #33            April 1970\n\n\nI found two substantial errors in the Host Protocol Paper, which was\notherwise an excellent paper.  Both concern a misunderstanding of the\nnature of the IMP as a communications device, and in particular the\nnature of buffering an IMP must do.  The authors consider the network as\na device into which one pushes a message which travels around some,\nwaits in buffers for substantial lengths of times, and then emerges at\nthe destination.  In fact a better model would be that the message pops\nout again an instant after it is inserted.  While it is true there is a\ndelay, it is imposed by phone line hardware for the most part.  The IMP\nbuffering is minimal, and devoted to error control and momentary traffic\nsurges.\n\nSince we cannot force a Host to take a message, we have built an elab-\norate RFNM mechanism to suspend new input until he does.  This mech-\nanism is an imperfect attempt to solve a very hard communications\nproblem.  The desire is to regulate traffic in such a way that as the\nHost takes its message from the IMP the next message is arriving on the\nphone line, and no buffering occurs at all.\n\nIn fact we cannot achieve this, and therefore have included buffering to\nhandle traffic surges.  These buffers are useless for their intended\npurpose unless they are empty.  Only empty buffers are available to soak\nup a traffic surge.\n\nThe two specific errors occur on pages 5 and 23.  On page 5 the authors\nsay \"Implicit in this purpose is the assumption that a user does not use\nmultiple links to achieve a wide band.\"  In fact one of the primary\npurposes of links is to achieve a wider band.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nRFC 47               BBN's Comments on NWG/RFC #33            April 1970\n\n\nWe wish to allow as much band width as possible.  Our troubles occur not\nwith wide band but with an imbalance of input and output.  The authors\nhave rightly noticed that multiple links subvert the RFNM mechanism,\nmaking our job harder, but have wrongly labeled the nature of the\nproblem.\n\nAgain on page 5 \"An even more basic assumption, of course, is that the\nnetwork's load comes from some users transmitting sequences of messages\nrather than many users transmitting single messages coincidentally.\"  We\nare in great shape against single message users when their messages are\nrandomly related.  The statistics are all in our favor and we have\nspecial procedures for the (rare) coincedences.  Our problems come with\nthe non-random coincidences, and we have taken special precautions\nagainst users transmitting bursts (sequences) of messages.  We assume\nall kinds of users, and protect ourselves accordingly.\n\nOn pages 23 and 24 there are 4 critical sentences which imply that the\nsystem design could have been improved by allowing the Host to specify\nwhich of several waiting inputs he might wish to accept.  We grant that\nthe Host needs to buffer these messages for its users, but violently\ndisagree that the IMP has the capability to do this buffering.\n\nIf we are operating in ideal mode, we would have at most one message for\nthe Host at any time.  If we have more than one we urgently need the\nHost to accept these messages, because our ability to handle traffic\nsurges is now below standard.  At present we allow three full\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\nRFC 47               BBN's Comments on NWG/RFC #33            April 1970\n\n\nlength messages in an IMP for its Host before we start backing traffic\nup in the network.  \"Three\" is not enough to help the Host in addition\nto keeping a reserve for the traffic surges.\n\nBut if buffering is needed why not get more memory and do it in the IMP?\nBecause buffering is a Host function, is different in each time share\nsystem, is hard to control over a busy serial channel, might not be\nneeded at all in some places, and is better done where the extra memory\ncan be efficiently shared by the Host operating system.\n\nI repeat:  the IMP's buffers must be empty or they are not serving their\ncommunication purpose.\n\nThe offending sentences are:\n\n     Paragraph 2 sentence 3\n           \"   3 all\n           \"   4 sentences 1 and 2 (80ms is hardware screw adjustable)\n           \"   4 sentence last\n\n\n          [ This RFC was put into machine readable form for entry ]\n      [ into the online RFC archives by Jeff \u0026 Christy McClellan 2/98]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n"
}