{
  "series": "Request for Comments",
  "number": "485",
  "howpublished": "RFC 485",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0485",
  "url": "https://www.rfc-editor.org/info/rfc485",
  "title": "MIX and MIXAL at UCSB",
  "pagetotal": "1",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                    John R. Pickens\nRFC # 485                                                UCSB\nNIC # 15063                                              19 March 1973\nReferences NWG/RFC #473\n\n\n                         MIX and MIXAL at UCSB\n\nThe following, in response to David Walden's MIX query (RFC#473) was\nwritten by a graduate student at UCSB.  Questions regarding \"cheap\"\nusage should be directed to Roland F. Bryan (RFB) at UCSB.\n-----------------------------------------------------------------------\n\nMark Scott Johnson\n18 March 1973\n\n    I wrote a MIXAL assembler and a MIX simulator last summer.  The\nassembler is written in SNOBOL4 and, unfortunately, is fairly expensive\nto run.  The assembler has been fairly well debugged and is documented.\nHowever, although the MIX simulator is written (in 360 Assembler), it\nhas only been partially debugged.  Due to the resumption of school and\nother commitments, I was unable to give the simulator a thorough\ndebugging.  All the simulated instructions except I/O instructions have\nbeen tested somewhat and appear to be operating well.  Also, card reader\ninput and printer output are operational, but my simulation of disk\nfiles and magnetic tape has not been completed.  There is presently no\ndocumentation for the simulator.  Very little documentation is needed,\nhowever, since the simulator follows almost to the letter the\nspecifications detailed in _Fundamental_Algorithms_.\n\n    If anyone is interested in using the assembler and/or the simulator,\nI will be happy to supply what documentation exists plus some\ninformation on how the programs can be accessed.  Also, if anyone is\ninterested in the source code for the programs, I will be happy to send\nit.  I hope to be able to finish the simulator this next quarter.  If\nanyone wants to use the system and if they should find any bugs, I will\ndo my best to maintain and correct the programs.\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\nPickens                                                         [Page 1]\n\f\n"
}