{
  "series": "Request for Comments",
  "number": "271",
  "howpublished": "RFC 271",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0271",
  "url": "https://www.rfc-editor.org/info/rfc271",
  "title": "IMP System change notifications",
  "pagetotal": "2",
  "year": "1972",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                              Bernard Cosell\nRFC # 271                                          BBN\nNIC 7819                                           3 January 1972\nCategories:  B.1\nUpdates:  None\nObsoletes:  None\n\n                     IMP System Change Notification\n                     ------------------------------\n\n\n    We are planning to install a new version of the IMP System,\nversion 2514.  The new version is scheduled for field installation\nThursday, January 13, 1972 between noon and 1 PM EST, and will require\nthe assistance of IMP-site personnel at each site.\n\n\n    There were two principal problems with version 2513, both related\nto the delay inserted between the time when a Host comes up and the\ntime when its IMP will accept the second packet from the Host.  The\nfirst was that the delay was lengthened to slightly over 40 seconds,\nwhich caused hardware difficulties for some Hosts.  The second was\nthat there was an ambiguity that could make the delay run as long as a\nminute and a quarter.  On the first point, the delay has been backed\noff from 40 seconds to 30 seconds, as it was for IMP systems prior to\n2513.  On the second point, the ambiguity has been entirely removed.\n(Note, however, that BBN Report No. 1822, on page 23, specifies that\nthe delay may range from 30 to 90 seconds, and that future versions\nmay require a longer delay.)\n\n\n    In summary, a Host may come alive in one of two ways, corres-\nponding to the two ways in which the Host can go down.  If the Host\nwent down voluntarily (by sending a \"Host going down\" to the IMP), the\nHost indicates his intention to come alive by sending the IMP\nsomething.  If the Host went down involuntarily (by dropping his ready\nline), the Host indicates his intention to come alive by bringing his\nready line back up.  In either case\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nthe IMP will refuse to accept more than one packet from the Host for\n30 seconds after the Host has indicated his intention to come alive.\nNotice, however, that the Host must be prepared to accept all messages\nfrom the Network from the instant that he indicates his intention to\ncome alive.* This particular point seems to have given many Hosts\ndifficulty in running through their standard initialization\nprocedures.  Don't forget this simple and universal rule, that when\nyou are telling your IMP that you are alive, you must be prepared to\nalways take every- thing from the Network whether or not the Network\nis taking any- thing from you.\n\n    Version 2514 will also incorporate a few other changes, mainly\nrelated to the operation of the NCC.  Since the Timeout is, for a\nchange, being made shorter, and the other modifications are minor,\nthere should be no appreciable transient with the coming of the new\nversion.\n\n_______________\n*In fact, if the Host does not accept messages from his IMP\npimmediately then the Host may see the IMP's Ready line go down\nfor 1/4 second sometime during the 30 second waiting period.\nThis is due to the following set of circumstances:\n\n    *  The IMP periodically places NOPs on the queue for a\n       dead Host as part of the process of checking the IMP/Host\n       interface.\n\n    *  If a message remains on a Host's queue for 30 seconds\n       without being taken, the IMP drops its Ready line for\n       1/4 second in order to clear the interface (see RFC #270).\n\n    *  The timeout periods for the Host queue and the delay\n       when the Host comes alive are _not_ synchronized.\n\nIf the Host is prepared to see the IMP's Ready line dropped\nduring the 30-second delay while coming alive, then no harm\nwill be done if messages from the IMP are not accepted immediately.\n\n\nBC/jm\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}