{
  "series": "Request for Comments",
  "number": "411",
  "howpublished": "RFC 411",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0411",
  "url": "https://www.rfc-editor.org/info/rfc411",
  "title": "New MULTICS Network Software Features",
  "pagetotal": "2",
  "year": "1972",
  "month": "nov",
  "body": "\n\n\n\n\n\nNetwork Working Group                             M. A. Padlipsky\nRequest for Comments #411                             MIT-MULTICS\nNIC 124D3                                       November 14, 1972\n\n                 NEW MULTICS NETWORK SOFTWARE FEATURES\n\nTwo recently-installed features of the Multics  Network  software\nmight be of general interest to the Network community, and should\nbe of particular interest to those who use Multics via TIP's:\n\nCase Mapping\n---- -------\n\nIn  order  to allow Network users at upper-case-only terminals on\nsystems which do not  furnish  case-mapping  to  access  Multics,\ntyping   \"MAP\"   (upper-case,   followed   by   Telnet  New-line)\nimmediately after receipt of the Multics  load  message  actuates\nMultics software which applies the following typing conventions:\n\n1) as most Multics  input  is  lower-case,  alphabetic  input  is\n    mapped  to  lower-case,  except  for  any  letter immediately\n    preceded by \"\n2) back (left) arrow  is  treated  as  underscore,  up  arrow  as\n    circumflex, apostrophe as acute (right) accent\n3) escape sequences exist for the following:\n    backspace = -\n    grave (left) accent = '\n    left brace =\n    vertical line =\n    right brace = )\n    tilde = =\n4) the sequence \"\\\" is treated as  \"\n    octal  escape, it is only necessary to type     a \"\n    them\n\nThe case-mapping software is also actuated if \"HELP\" (upper-case)\nis  typed  prior  to  login  in  response  to the system's \"login\nincorrect\" message, in which case the normal  information  (which\nwould  appear  in response to lower-case \"help\" as well) on login\nformat will be printed out.  (Note: the escape sequences are  the\nsame  as  existing Multics   conventions for direct-dialled Model\n33/35 TTY's.  On these particular devices, \"\nindicated on the key-caps: it is input as SHIFT-L.)\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nAllocate Handling\n-------- --------\n\nOutput  to  systems  which give small allocations has long been a\nproblem, both to the remote user (who experienced frequent pauses\nin the output at  his  terminal)  and  to  the  Multics  \"Network\nDaemon\"  process  (which  encountered  considerable  inefficiency\nbecause of being frequently awakened to process the  ALL  control\nmessages).   To alleviate this, we have introduced interrupt-time\ncode which processes the ALL's and  outputs  the  next  group  of\nbytes  without  causing  the Network Daemon to take a wakeup.  As\nattendees of the ICCC will have already observed, response is far\nsuperior under the new scheme.  (System  Programmers  responsible\nfor  NCP's  might  be  interested  to  know  that some 75% of our\ncontrol-message processing deals with ALL's.)\n\n\n    [ This RFC was put into machine readable form for entry ]\n    [ into the online RFC archives by BBN Corp. under the   ]\n    [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}