{
  "series": "Request for Comments",
  "number": "469",
  "howpublished": "RFC 469",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0469",
  "url": "https://www.rfc-editor.org/info/rfc469",
  "title": "Network mail meeting summary",
  "pagetotal": "10",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNWG/RFC#469                             Michael D. Kudlick MDK (SRI-ARC)\nNIC 14798                               8-MAR-73\n\n                      Network Mail Meeting Summary\n\nIntroduction\n\n   The purpose of this RFC is to briefly summarize, from the NIC's\n   viewpoint, the principal conclusions reached at the Network Mail\n   Meeting held Friday, February 23 1973, at SRI-ARC.\n\n      Please refer to RFC #475 (NIC 14919) for Abhay Bhushan's\n      comprehensive summary of the issues discussed at the meeting.\n\n      There is no major disagreement between the present RFC and RFC\n      #475.\n\n      RFC #453 (NIC 14317) contains background information on the\n      meeting.\n\n      RFC #479 (NIC 14948) describes what the NIC would like to see\n      included in the File Transfer Protocol for Network Mail purposes,\n      and also describes briefly how the NIC would use the information.\n\n   The present RFC is organized as follows:\n\n      Conclusions\n      Discussion\n      Attendees\n\nConclusions\n\n   Additional FTP mail requirements were decided upon.  These would be\n   implemented as a new mail command, with the following subcommands:\n\n      TO\n\n         This field is explicitly allowed to contain multiple\n         addressees, with a standard syntax:  user@host.\n\n      FROM\n\n         This field provides a return-address for notification of\n         undeliverable mail, as well as a clearcut identification of the\n         sender for the recipient's information..\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n      AUTHOR\n\n         This field denotes the author of the mail.  There may be\n         multiple authors\n\n      TITLE\n         The \"title\" (i.e. subject) of the mail is to be terminated by\n         period carriage return.\n\n      ACKNOWLEDEGMENT  success / failure (time out) / normal\n\n         For use by the intermediate host, probably the NIC in most\n         cases, to tell the sender what happened to his attempt to send\n         mail.  (Note:  \"normal\" wasn't defined.)\n\n      RECORDED  jnumber / null\n\n         Note: \"jnumber\" is the pre-assigned accession number (NIC\n         number), to be used when known.\n\n         The \"RECORDED\" subcommand provides for the option of having the\n         mail recorded.  Information given with this subcommand would be\n         recognized at the NIC. Options are:\n\n            to be recorded (in NIC journal) only,\n            to be recorded and distributed,\n            to be distributed only.\n\n         This field would also be used to inform the recipient that the\n         mail has been recorded.\n\n            (In retrospect, it may be preferable to have a separate\n            command to inform the recipient of this fact, but no\n            decision on this was made at the 23-Feb-73 meeting.)\n\n      TYPE  long / urgent / ordinary\n\n         This allows the recipient site to take whatever action it\n         thinks appropriate in storing the mail.\n\n      TEXT / FILE / CITATION\n\n         TEXT\n\n            This field is for the text of the mail message.\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n      FILE\n\n         The purpose of the field is unclear to me.  Does it contain a\n         machine readable pointer to the file that the sender wishes the\n         recipient to read?\n\n      CITATION\n\n         This field is a person-readable pointer to the file that the\n         sender wishes the recipient to read.  When the citation command\n         is used, no mail is sent other than the citation.\n\n\nDiscussion\n\n   Introduction\n\n      The key aspects in the solution are:\n\n         1) It is based on FTP.\n\n         2) It uses the NIC without requiring direct use of NLS.\n\n         3) There is a mechanism for uniformity in the use of\n         user identifications.\n\n         4) There is a mechanism for recording the mail for\n         later reference.\n\n      These issues are covered in the discussion that follows.\n\nNew FTP Mail Subcommands\n\n   TO\n\n      Addressee Format\n\n         The standard form of the address is:  user@host\n\n         \"User\" may be an individual's last name; or it may be whatever\n         other identification the recipient has chosen AND has made\n         known to the rest of the network.\n\n            If the intended host doesn't recognize the intended\n            recipient's identification, then it sends back an\n            \"undeliverable\" mail message to the sender's host.  It is up\n            to the individual to keep the NIC informed of his wherabouts\n            [sic]; otherwise, he may not get his mail on time.\n\n\n\n                                                                [Page 3]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n      NIC Role\n\n         The NIC need have no role at all for mail sent from point A to\n         point B, whenever that mail is not to be recorded at the NIC.\n\n         For mail that is to be recorded at the NIC, the RECORDED\n         subcommand is to be used.\n\n         Also, when the sender does not know the standard address of the\n         recipients, he may use the NIC to obtain this information.\n\n      Idents and Addresses\n\n         The NIC will modify its identification files to include the\n         \"user@host\" standard address for each individual.\n\n            Sites may ask the NIC to translate from NIC Ident, or from a\n            user's last name, to the standard address.  A query facility\n            will be made available at the NIC to do the translation on\n            request.  The translation service will also be available for\n            \"group idents\".\n\n            This service would be FTP-like, in term of the prootocol\n            [sic] it accepts, but would not be within FTP itself.  A\n            different server process would handle Ident translation\n            requests.\n\n            Translation will also be done at the NIC when the NIC is\n            used as an intermediate point on the delivery route.\n\n               The NIC could be an intermediate point for recording the\n               mail as a NIC journal item, and for forwarding the mail\n               to its ultimate destinations.  During this process, the\n               NIC would translate from NIC idents to standard\n               addresses.\n\n      In the NIC ident files, provision already exists to specify\n      hardcopy or on-line delivery of recorded (NIC Journal) mail.\n\n            This provision will be extended to include a \"network\"\n            attribute, which means \"deliver the mail to the host of this\n            person\".\n\n            The network attribute may be qualified by restricting all\n            mail to be kept at the sender, with only a notification\n            message actually mailed.\n\n\n\n\n\n                                                                [Page 4]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n            Notification would be in the form of a citation giving \"to\",\n            \"from\", \"title\", \"date of submission\", and \"location of\n            mail\".\n\n      TIP Users\n\n         To enable TIP users to have access to the mail system, both for\n         sending and receiving mail, it was suggested that some hosts\n         will have to be the \"home\" site for these users (but no more\n         than one \"home\" site per user).\n\n         That is, an account that allows a TIP user to send and receive\n         mail will have to be established at such a host.\n\n            For the present, any TIP user can use the SRI-ARC system for\n            his mail requirements.\n\n         An alternate solution, that TIP's be equipped with a hardcopy\n         device that is continuously available for printing mail, was\n         discarded in favor of the above approach.\n\n   FROM\n\n      The \"FROM\" command in FTP, identifies the sender in \"standard\n      address\" form.\n\n         This will allow \"undeliverable\" mail notices to be sent back to\n         the originator.\n\n            The default condition is that the sender's host must retain\n            the mail until it is \"delivered\" to the recipient's host.\n\n               \"Delivered\"  means that the recipient's host has accepted\n               the mail. It does NOT mean that the recipient has READ\n               the mail.\n\n            Alternatively, the sender may designate that an intermediate\n            host store the mail.  Then the intermediate host has the\n            responsibility of storing the mail until it is \"delivered\"\n            to all intended recipients.\n\n         The \"ACKNOWLEDGEMENT\" command will allow an optional, positive\n         acknowledgement to be given to the originator of the mail (the\n         \"FROM\" addressee), stating that the mail was delivered.\n\n\n\n\n\n\n\n                                                                [Page 5]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n   AUTHOR\n\n      The AUTHOR may be several persons. For recorded documents the\n      authors appear separately in the index of authors, to facilitate\n      searching for mail when an author is known, but the title and\n      location of the mail are unknown.\n\n   TITLE\n\n      The TITLE field is especially useful for recorded mail, since\n      indexes on key words in the title can be produced relatively\n      easily, and facilitate searching for mail.\n\n      For this reason, the title should be a succinct indicator of the\n      contents.\n\n   ACKNOWLEDGEMENT\n\n      Acknowledgement of failure to deliver should be given to the\n      sender.\n\n         An optional, positive acknowledgement of successful delivery to\n         the recipient's sitename will be given on request of sender\n         (like U.S. CERTIFIED mail).\n\n         No acknowledgement that the recipient actually saw the mail\n         will be given (comparable to not having U.S. REGISTERED mail).\n\n   RECORDED\n\n      The concept of \"recorded\" mail is that a permanent record of the\n      mail is kept centrally, to allow future references and re-readings\n      of the mail to be made.\n\n         For example, in the NIC Journal system, a record is kept of all\n         the items entered into the Journal.  From this record, author,\n         title-word, and NIC number indexes are produced to allow for\n         references and re-readings.\n\n         The key to retrieval of recorded Journal items is the use of an\n         accession number (the NIC number).  This essentially removes\n         the possibility of duplicate filenames being used.\n\n      The basic aspect of recorded mail which was discussed at the mail\n      meeting is the assignment of an \"accession\" number.\n\n\n\n\n\n\n                                                                [Page 6]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n         It was decided to get the accession numbers from the NIC on an\n         as-needed basis, without pre-assignment and without local\n         assignment of numbers.\n\n         This subject may be reviewed in the future.  Local assignment\n         may be desirable to prevent the NIC from becoming a bottleneck\n         in the mail process.\n\n         It was pointed out that local assignment of numbers would be\n         un-ambiguous if the numbers included some information such as\n         sitename, date, and time.\n\n      One other problem exits [sic], namely \"where is the recorded\n      document?\".\n\n         Initially the document should be in the NIC, but ultimately it\n         could be anywhere on the Network, provided only that there is a\n         central mechanism for indexing and cataloging all the recorded\n         documents.\n\n         The pathname to the recorded document would then include\n         filename and sitename.\n\n   TYPE\n\n      The TYPE subcommand was a result of a discussion on the\n      problems of large mail files, and the associated\n      question of who would pay for the processing and storing\n      of these files.\n\n      The main decisions made were:\n\n         a) The processing, transmittal, and storage costs of\n         sending mail should be borne at the sender's host.\n\n         b) The processing and storage costs of receiving\n         mail should be borne at the recipient's host\n         initially, as a default.\n\n      Information to enable the recipient host to make an\n      intelligent decision about where to store the incoming\n      mail are passed along via the TYPE command.\n\n         The recipient host will have the local option of\n         providing either of the following services:\n\n\n\n\n\n\n                                                                [Page 7]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n            a) free use of system to send mail;\n            b) free use of system to receive mail, i.e. login\n            not required for delivery over the Network.  (A\n            possible alternative is use of a \"mail\" account,\n            or use of the recipient's account, for processing\n            and storage of the incoming mail.\n\n   TEXT / FILE / CITATION\n\n      TEXT\n\n         This field is for the text of the mail message.\n\n      FILE\n\n         The purpose of this field is unclear to me.  Does it contain a\n         machine readable pointer to the file that the sender wishes the\n         recipient to read?\n\n      CITATION\n\n         The citation is a person-readable pointer to the file that the\n         sender wishes the recipient to read.\n\n         An alternative to sending entire messages or files over the\n         Network is to use the \"CITATION\" mechanism. With this, the\n         sender sends a short message (the citation) saying, in effect,\n         \"please read file X at site Y\".\n\n            This alternative would be especially useful for\n\n            a) mail that is distributed with group idents (to all\n            liaisons, for example), and\n\n            b) \"long\" files (size not defined) that the recipient may\n            not be immediately interested in.\n\n            However no method of enforcing use of this alternative was\n            discussed.  It will be up to the recipients to devise a\n            scheme satisfactory to them.\n\nOther General Discussion\n\n   Bob Kahn placed on the floor the following question (I paraphrase):\n\n      Can't the design of a mail system be made to include alternative\n      sources of data and alternative modes of operation, unless\n      exclusion of these alternatives can be quantitatively defended?\n\n\n\n                                                                [Page 8]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n      Particular aspects of this question are:\n\n      1) What is the desirability and difficulty of admitting different\n      data sources into the mail system?\n\n         What are the \"boundaries\" that divide permitted from prohibited\n         data sources?\n\n         What is the quantitative distinction between deferred and\n         realtime mail?\n\n         Will the design we come up with allow such things as\n\n            a) handling a calendar that reflects the known and\n            anticipated whereabouts of people so that meetings can be\n            scheduled sensibly?\n\n            b) formatting the mail contents for later query and other\n            information handling?\n\n      2) Whatever primitives we implement, can't they be designed so as\n      not to preclude things like Tenex \"linking\"?\n\n         This requires two-way data communication paths.\n\n         How do we specify and get the attention of a \"sink\" for the\n         data stream?\n\n            e.g., for interprocess communication, and for Tenex-type\n            \"linking\".\n\n   The general reaction to this discussion was one of perspective:\n\n      In the scheme of things that could be considered \"point-to-point\n      communication\", mailbox-type of communication is not the most\n      general kind.\n\n      AKB listed several types of communication problems:\n\n         program-program communication\n         people-people real-time communication,  e.g.\n         Tenex-type \"links\"\n         computer teleconferencing\n         mailbox communication: cataloging, storage\n         protocols: host-host, telnet, file transfer\n\n\n\n\n\n\n                                                                [Page 9]\n\f\nNIC 14798                                       MDK 8-MAR-73 17:24 14798\n\n\n      A design for a mailbox-type system won't be required to encompass\n      the problems of, say, a computer teleconferencing system, which\n      has attributes (real-time, video, very large volume of data to be\n      transferred, to name some) that are not attributes of a mail box\n      system.\n\nAttendees at the Network Mail Meeting 2/23/73 at SRI-ARC\n\n           Nancy Mimno             BBN\n   ACB     Alan Bomberger  AMES-67\n   AKB     Abhay Bhushan   MIT-DMOG\n   AWH     Wayne Hathaway  AMES-67\n   CHI     Charles Irby            SRI-ARC\n   DHC     Dave Crocker            UCLA-NMC\n   JBP     Jon Postel              UCLA-NMC\n   JDH     Dave Hopper             SRI-ARC\n   JEW     Jim White               SRI-ARC\n   LPD     Peter Deutsch           PARC-MAXC\n   MCK     Mark Krilanovich        UCSB-MOD75\n   MDK     Mike Kudlick            SRI-ARC\n   REK2    Bob Kahn                ARPA\n   RKK     Rajendra Kanodia        MIT-MULTICS\n   RST     Ray Tomlinson   BBN-TENEX\n\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Joseph Marshall 9/97  ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                               [Page 10]\n\f\n"
}