{
  "series": "Request for Comments",
  "number": "379",
  "howpublished": "RFC 379",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0379",
  "url": "https://www.rfc-editor.org/info/rfc379",
  "title": "Using TSO at CCN",
  "pagetotal": "5",
  "year": "1972",
  "month": "aug",
  "body": "\n\n\n\n\n\nNETWORK WORKING GROUP                                     R.T. BRADEN\nREQUEST FOR COMMENTS #379                                 UCLA/CCN\nNIC 11121                                                 AUGUST 11, 1972\nCATEGORIES :\nOBSOLETES:\nUPDATES:\n\n\n                            USING TSO AT CCN\n\n    IBM's Time Sharing Option (\"TSO\") is now available at CCN for use via\nthe Network with Telnet Protocol.  TSO is not yet considered \"production\"\nby CCN, since there are a number of restrictions and glitches to be removed\nor documented.  However, TSO is now quite stable and is up on a regularly\nscheduled basis; the system will allow an experienced programmer to work\nproductively at CCN.  To use TSO, you will need a valid CCN charge (billing)\nnumber, and a user-id.  To obtain a charge number (if you do not already\nhave one), or to obtain a TSO user-id, contact Barbara Noble at (213)\n825-7438 or (213) 825-7452.  At present we are not charging for TSO use\n(although any batch jobs submitted from TSO will be charged to your account).\nBarbara can assign on overhead charge number for experimental use of TSO if\nyou do not have a paid account.\n\nModes of TSO Use\n----------------\n\n    (1)  Conversational Remote Job Entry\n         -------------------------------\n\n         Using TSO you can prepare an OS job stream using the TSO EDIT command,\n         SUBMIT the job to batch execution, monitor its STATUS, and ship the\n         OUTPUT back to EDIT for examination.  This allows those of you with\n         TIP'S to process jobs at CCN without using NETRJS via a friendly\n         TENEX machine.  Any batch job can be submitted this way.\n\n\n    (2)  Foreground Execution\n         --------------------\n\n         Many OS/360 programs can be run, with varying degrees of inconvenience,\n         directly from the terminal.  There are TSO commands providing the\n         facilities of EXEC and DD cards; the output stream can be directed to\n         the user's terminal.  There are some important limitations to fore-\n         ground operation, however:\n\n              (1)  The foreground region size is limited; at present, it is\n                   128K, though this will be expanded.\n\n\n\n\n                                                                [Page 1]\n\f\n              (2)  All datasets referenced must be on resident disk packs;\n                   no disks or tapes can be mounted.\n\n              (3)  Since you are time-sliced and swapped, it can be very\n                   slow.\n\n    There are two important cases of foreground execution:\n\n         (A)  The TEST command provides DDT-like debugging capability\n              for foreground programs.\n\n         (B)  The user's own program can interact with his terminal.\n\nNOTE:  It is not yet possible for a program, either in batch or foreground,\n       to open direct Network connections.\n\nHours of Operation\n------------------\n\n     Monday through Friday, 6 A.M. - Noon PDT (or 9 A.M. - 3 P.M. EDT).\n     These hours will be extended before September 1, 1972.\n\nTelnet Protocol\n---------------\n\n     The document \"USING TSO VIA ARPA NETWORK VIRTUAL TERMINAL\", RFC #377\n     describes the use of a Telnet NVT to access TSO.  There are some signi-\n     ficant differences from using a real 2741 locally.  RFC #377 describes\n     the current server Telnet, complete with an annoying bug.  A later\n     version will include the following capabilities not presently available:\n\n          (a)  \"FULL DUPLEX\", i.e., CCN echoing.\n\n          (b)  Lower case input.\n\n          (c)  The special character translation included in NETRJS\n               users with Model 33 Teletypes. (see RFC #338).\n\n          (d)  Optional specification of single CR or single LF as end-of-line\n               indication\n\n          (e)  Hopefully, the input attention bug described in RFC #377 will\n               be fixed.\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nDisk Space\n----------\n\n     TSO will automatically place datasets created in the foreground (e.g., by\n     EDIT or ALLOC) on the proper resident disk pack.  All TSO datasets are\n     cataloged, and can be referenced by name alone (no volume or unit specifi-\n     cation is necessary).  For most purposes, you can pretend we have one big\n     disk.                                                             --- ---\n     ----\n\nDataset Names\n-------------\n\n     The standard IBM version of TSO uses the TSO user-id as the highest\n     index of each dataset name.  At CCN, the _two_ highest levels are the\n     charge number and the user-id of the person who created the dataset.\n     TSO has been modified accordingly.\n\nDataset Access Control\n----------------------\n\n     In general, under TSO a user can access for reading, writing, or\n     execution any dataset named with the charge number with which he is\n     logged on.  In addition, he can rename or scratch any dataset with the\n     logon charge number.  There is no provision for public or read-only\n     datasets a present.\n\nLogging On\n----------\n\n     Most Network users will need only the simple form of LOGON:\n\n                   logon     \u003cuser-id\u003e\n\n     EXAMPLE:                         NOTES:\n     -------                          -----\n\n          user:  logon uid            (Use your user-id)\n\n          TSO:   LOGON UID            (TSO repeats line for reasons of its own)\n\n          TSO:  ENTER PASSWORD        (TSO asks for password)\n\n          user:  xyz\n\n          TSO:  UID LOGON IN PROGRESS AT 11:37:43 ON AUGUST 9, 1984\n\n\n\n\n\n                                                                [Page 3]\n\f\n          TSO:  LOGON PROCEEDING      (It may take a while.  This message will\n                                      come every 30 seconds.)\n\n          TSO:  WELCOME TO TSO.  GOOD LUCK\n\n          TSO:  READY\n\n     User-id's are created in TSO with a blank password.  To add or change your\n     password, use the CHANGE command.  If you have TSO access under more than\n     one charge number, LOGON will prompt you for the charge number to be used\n     for the session.\n\nWhere to Get Help\n-----------------\n\n    1.  To obtain a list of TSO commands enter:  \"help commands\"\n\n    2.  To get detailed information on syntax and function of a particular\n        command, enter: \"help \u003ccommand name\u003e \u003cqualifiers\u003e\"\n        Type \"help help\" for details.\n\n    3.  The SEND command may be useful for on-line help from PCN (Pete Nielsen)\n        or WDD (Bill Drain), when they are signed on.  You can find out if PCN\n        or WDD is on by sending them a trial message.\n\n        EXAMPLE:\n        -------\n\n               User:  send 'hello' user(wdd)\n\n               TSO:   USER WDD NOT LOGGED ON\n\n               TSO:   READY\n\n               user:  send 'hello' user(pcn)\n\n               TSO:   READY\n\n               user:  send 'edit is acting funny' user(pcn)\n\n               TSO:   READY\n\n        Here \"PCN\" was logged on and got your message.  You can, therefore,\n        converse with him through SEND.  The text in one SEND is limited to\n        115 characters.\n\n    4.  You can also leave a message for wdd to receive when he logs on by\n        typing:  send '\u003cmessage\u003e' user(wdd) logon.\n\n\n\n                                                                [Page 4]\n\f\n    5.  To send a message to the CCN operator, enter simply:  send '\u003cmessage\u003e'\n\n    6.  You can call the CCN Telephone Consultant at (213) 825-7452, Monday\n        through Friday during the hours 10-12 A.M. PDT and 1-4 P.M. (except\n        3-4 P.M. on Thursday).  If the consultant does not know the answer,\n        he/she will investigate and call you back.\n\n    7.  You can call the general contact for Network user problems, Barbara\n        Noble, at (213) 825-7438.  Barbara is also one of the Telephone\n        consultants.\n\n    8.  If all else fails, call Bill Drain, the CCN Systems Programmer in\n        charge of TSO installation.  His telephone is (213) 825-7474 (if no\n        answer, call my secretary at (213) 825-7518 and leave a message for\n        Bill).\n\n    9.  You can also send a message to someone at CCN by submitting the\n        following pseudo-job through RJS at TSO:\n\n                   //\u003ccharge number\u003e  JOB 'BIN=9906',MSGLASS=C\n                   //*  \u003cmessage\u003e\n                   //*\n                   //*\n                   //*\n                   //*\n                   etc.\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 5]\n\f\n"
}