{
  "series": "Request for Comments",
  "number": "278",
  "howpublished": "RFC 278",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0278",
  "url": "https://www.rfc-editor.org/info/rfc278",
  "title": "Revision of the Mail Box Protocol",
  "pagetotal": "4",
  "year": "1971",
  "month": "nov",
  "body": "\n\n\n\n\n\nNWG/RFC# 278                            RWW 17-NOV-71 14:12  8056\nRevision of the Mail Box Protocol\n\nNETWORK WORKING GROUP             Abhay Bhushan, MIT-DMCG\nRequest for Comments #278         Bob Braden, UCLA-CCN\nNIC 8056                          Eric Harslem, RAND\nCategories: A.5, O.7              John Heafner, RAND\nObsoletes RFC 221, NIC 7612       Alex McKenzie, BBN-NET\n                                  John Melvin, SRI-ARC\n                                  Bob Sundberg, HARV\n                                  Dick Watson, SRI-ARC\n                                  Jim White, UCSB\n                                  17-Nov-1971\n\n                   REVISION OF THE MAIL BOX PROTOCOL\n\n   The file transfer committee met and discussed the Mail Box Protocol\n   RFC 221, NIC 7612.  The potential utility for the mechanism was\n   confirmed and a couple of changes suggested.  We first give the\n   changes and then restate the Protocol.\n\n                                  CHANGES\n\n   1) The Mail Box Protocol is only to allow ASCII stings of text\n   formatted for a network standard line printer rather than allowing\n   other data types.\n\n   2) A new command is to be added to the File Transfer Protocol called\n   \"Append With Create\" which appends to a file if the file exists, and\n   creates a file if it does not exist.\n\n   3) The standard path name for the mailbox is to be, using conventional\n   metalanguage symbols,\n\n      \"MAIL\" \u003cseparator\u003e (\"PRINTER\"/\u003cident\u003e)\n\n      \u003cseparator\u003e is the ASCII GS, octal 035.  The semantics of\n      the above are the following:\n\n      \u003cident\u003e is a NIC IDENT\n\n      \"MAIL\" \u003cseparator\u003e \"PRINTER\" would be interpreted by the\n      receiving site as meaning Append With Create the\n      transmitted file to a bulk mail file to be printed or\n      directly output it to a printer.\n\n      \"MAIL\" \u003cseparator\u003e \u003cident\u003e would be interpreted to mean\n      either\n\n\n\n\n                                                                [Page 1]\n\f\nNWG/RFC# 278                            RWW 17-NOV-71 14:12  8056\nRevision of the Mail Box Protocol\n\n         1) The same as \"MAIL\" \u003cseparator\u003e \"PRINTER\" i.e., ignore\n         \u003cident\u003e or\n\n         2) Append With Create the following file to a file\n         specifically for the person designated by \u003cident\u003e for\n         either online access or printing or both.\n\n   The problem of delivering mail to TIPs was discussed.\n\n   At the moment TIPs support only the Telnet Protocol, but it is planned\n   to support the Data Transfer Protocol.  TIPs will have an ASCII line\n   printer available as an optional device.  People desiring to send a\n   mail item to a TIP with a printer can open a standard published socket\n   and transmit to it with Telnet Protocol now, later also with the Data\n   Transfer Protocol.  The NIC's plans with regard to TIPs is not to do\n   automatic network delivery to them.  Messages to people using TIPs can\n   be sent to them through the NIC and will be delivered as with everyone\n   else directly to the person's initial file at the NIC. The TIP user\n   can read the item online or obtain a hardcopy at his terminal with the\n   Output Device Teletype command of NLS.\n\n                           MAIL BOX PROTOCOL\n\n   The Mail Box Protocol will use established network conventions,\n   specifically the Network Control Program, Initial Connection Protocol,\n   Data Transfer Protocol, and File Transfer Protocol (as described in\n   current Network Protocols, NIC 7104).\n\n   The transmission is to be Network ASCII.  The standard receiving mail\n   printer is assumed to have a print line 72 characters wide, and a page\n   of 66 lines.  The new line convention will be carriage return (Hex\n   per the Telnet Protocol, RFC 158, NIC 6768.  The standard printer will\n   accept form feed character (Hex '0C') (Octal '014') as meaning move\n   paper to the top of a new page.\n\n   It is the sender's responsibility to control the length of the print\n   line and page.  If more than 72 characters per line are sent, or if\n   more than 66 line are sent without a form feed, then the receiving\n   site can handle these situations as appropriate for them.  These\n   conventions can be changed by control codes as described below.  At\n   the head of the message or document sent there is to be two copies of\n   an initial address string each terminated by a form feed.  This\n   address string is to contain the sender's name and address, and the\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nNWG/RFC# 278                            RWW 17-NOV-71 14:12 8056\nRevision of the Mail Box Protocol\n\n   receiver's name and address formatted in some reasonable, easy-to read\n   form for a clerk to read and distribute.  Comments could also be\n   included in the address string.  The requirements for two copies are\n   to make one readable from a fan fold paper stack without effort.\n\n   Initial Connection\n\n   Initial Connection will be as per the Official Initial Connection\n   Protocol, Document #2, NIC 7101, to the standard File Transfer socket\n   #3.\n\n   File Transfer\n\n   The mail item (file) to be transferred would be transferred according\n   to the File Transfer Protocol.\n\n   As per the File Transfer Protocol, a file (mail item) can be sent in\n   more than one data transaction as defined in the Data Transfer\n   Protocol.  End of file is indicated by the file separator (as defined\n   in Data Transfer Protocol) or by closing the connection.\n\n   Order of Transactions\n\n   The only basic operation required is an Append With Create\n\n                   Append With Create Request\n\n     (Mailer) User --------------------\u003e  Server (Mail Box)\n\n                          \u003cFile -  data\u003e\n\n                      --------------------\u003e\n\n                     End of File indication\n\n                      --------------------\u003e\n\n                           Acknowledge\n\n                      \u003c--------------------\n\n   The data type default is network ASCII.  The Standard line printer\n   default is as defined above.  Other control transactions can be used.\n\n                    CONTROL TRANSACTIONS TO BE USED\n\n\n\n\n                                                                [Page 3]\n\f\nNWG/RFC# 278                            RWW 17-NOV-71 14:12 8056\nRevision of the Mail Box Protocol\n\n      OP CODE\n\n     Hex     Octal\n\n      09       011      Error or unsuccessful terminate\n\n      0A      012      Acknowledge or successful terminate\n\n      05      005       Append With Create request (add to\n                        existing file or create file if\n                        none exists)\n\n      5A      132       Change printer control settings\n\n                              ERROR CODES\n\n   All error codes defined in the file Transfer Protocol could be\n   returned.\n\n                         PRINTER CONTROL CODES\n\n     Hex     Octal\n\n      D1      321       Meaning: Set line width to 72 characters\n\n      D2      322       Meaning: Use the full width of your printer\n\n      03      323       Meaning: Set page size to 66 line\n\n      04      324       Meaning: Set page size to infinite\n\n   Other virtual printer control codes can be added in the future.\n\n   Other classes of control codes can be added as the need arises.\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n"
}