{
  "series": "Request for Comments",
  "number": "249",
  "howpublished": "RFC 249",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0249",
  "url": "https://www.rfc-editor.org/info/rfc249",
  "title": "Coordination of equipment and supplies purchase",
  "pagetotal": "2",
  "year": "1971",
  "month": "oct",
  "body": "\n\n\n\n\n\n                                                       NIC 7690\nNetwork Working Group                                  R. F. Borelli\nRequest for Comments #249                              University of Illinois\n                                                       Center for Advanced\n                                                         Computation\n                                                       October 8, 1971\n\n              Coordination of Equipment and Supplies Purchase\n              -----------------------------------------------\n\n        The purpose of this message is to pass on to all members of the\n   Network an agreement reached between Messrs. Steve Crocker of ARPA and\n   R. F. Borelli of the University of Illinois.  The Center for Advanced\n   Computation has agreed to study the feasibility of a coordinating point\n   for purchases of equipment and supplies to be used on the network.\n\n        To this end, the Center will compile a list of common equipment and\n   supplies needed by Network members and ascertain the value of contacting\n   the appropriate manufacturers and distributers in order to negotiate the\n   best possible group price.  Thereafter, the results of the negotiations\n   will be passed on to Network members with a resulting listing of items,\n   costs and supplies.\n\n        The two biggest pitfalls with this concept are:\n             1.  Insufficient demand for commonly required items.\n             2.  Not satisfying each organization's administrative\n                 requirements for competitive bidding on items\n                 which are not sole-source justified.\n\n        At this time, it appears to be premature to allow this to stop the\n   idea.  After the listing of items and range of sources are collected and\n   analyzed, these two points can be addressed.  In fact, this project may\n   have to be abandoned; however, there are sufficient reasons to believe\n   that these problems can be overcome to make the venture workable.\n\n       We request that all members of the Network forward to the Center,\n   ATTN. R. F. Borelli, a descriptive listing of equipment and supplies\n   they require in this fiscal year.  Particular attention must be paid to\n   listing all the acceptable alternates to increase the changes of\n   commonality.  For example: TI-725 terminals could be considered a\n   substitute for Teleterms 1030's, etc.  The only items excluded at this\n   time are 2400 ft. Magnetic Computer Tapes, tabulating cards, and\n   conventional computer printer paper.  Any added suggestions or ideas are\n   both encouraged and welcomed.\n\n        A sample format of information is attached.\n\n\n\n\n\n                                                                [Page 1]\n\f\n          Sample Format of Information Requirement is as Follows:\n          ------------------------------------------------------\n                                                                  Current\n                                                                 Estimated\n   Quantity      Description and Special Needs      Mfgr.           Cost\n   --------      -----------------------------      -----       -----------\n\n       3         Remote Terminals                 Texas Instr.  $4,200.00 @\n                 Model TI-725 with upper and            or\n                  lower case                      Teleterms\n\n   100 rolls/mo  Electro Static Printer Paper      Gould        $10.00/roll\n\n\n   Requested by:\n\n                     University of Illinois\n                     Center for Advanced Computation\n                     Urbana, Illinois  61801\n                     Telephone:  (217) 333-6375\n\n\n   A listing of items not intended as all-inclusive are:\n\n       1.  Gould Electrostatic Printers and printer paper.\n       2.  Computek graphics terminals.\n       3.  ARDS graphics terminals.\n       4.  CRT alphanumeric terminals (Hazeltine, Datapoint, DEC, etc.).\n       5.  Hard-copy portable terminals (TI-725, Teleterm 1030, NCR etc.).\n       6.  Teletype (ASR and KSR-33, 35 and 37)\n       7.  Plasma panels.\n       8.  Plotters (CalComp, Bendix, Calma, etc.).\n       9.  Digitizers and scanners.\n      10.  Computers (PDP-11, PDP-10).\n      11.  Computer peripherals (TU-56, TC-11, etc.).\n      12.  IMLAC's.\n\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by BBN Corp. under the   ]\n         [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}