{
  "series": "Request for Comments",
  "number": "291",
  "howpublished": "RFC 291",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0291",
  "url": "https://www.rfc-editor.org/info/rfc291",
  "title": "Data Management Meeting Announcement",
  "pagetotal": "2",
  "year": "1972",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                          14 January 1972\nRequest for Comments 291                       D. B. McKay, IBM\nNIC                 8301                       (Area Code 914)- 945-1159\nCategories:  A.2, D.4, D.7\n\n\n                  Data Management Meeting Announcement\n                  ------------------------------------\n\n\n        Mitre will host a Network Data Management Meeting, February 23,\n   24.  As a follow-on from past meetings, the meeting is being held to\n   accomplish two objectives.  As a result of the first data management\n   meeting in Aug- ust, the general consensus was a need to learn about\n   applications of net- work data facilities, and how networks will\n   better help users achieve their objectives.  There are several people\n   that have expressed an inter- est in discussing applications.  The\n   attached schedule is a list of people who have agreed to talk.  If\n   anyone knows of other people interested in discussing applications,\n   please have them contact me.\n\n        Secondly, the meeting will discuss and try to arrive at a\n   specifica- tion for a network data management protocol.  It was\n   decided that the best way to come up with a design would be to discuss\n   a tentative written proposal or proposals.  I will try and have copies\n   of a written proposal available to meeting attendees before the\n   meeting date.  I would like to encourage anyone else interested in\n   submitting a 3rd level protocol for sharing network data to do so.\n\n        The protocol design would hopefully achieve the objectives of a\n   data facility described in stage 2 of RFC-146.\n\n        Since the facilities are limited and the second half of the\n   meeting is to be a working session, it will be necessary to limit the\n   attendance.  First priority will be the people or representatives from\n   groups that have participated in the past two meetings.  I will inform\n   any other people who contact me of any openings.\n\n        All reservations should be made by contacting Mrs. Madeline\n   Cornell at Mitre, Telephone (Area Code 703) 893-3500 Extension 2395 as\n   soon as possible.\n\n\n                                        D. B. McKay\n\n\n   DBM:eb\n\n\n\n\n                                                                [Page 1]\n\f\n                 LIST OF SPEAKERS FOR FEBRUARY 23, 1972\n                 --------------------------------------\n\nCaptain Roger Moore - U.S.Army R\u0026D Command\n\n     Sharing and Accessing of medical files at all specialized locations.\n\n\n\nDr. John Senior - National Medical Board of Examiners\n\n     Dr. Senior will discuss their need to access all test results at\n     the various medical testing centers across the country.\n\n\n\nThomas McCauley* - Hughes Aircraft\n\n     Mr. McCauley will discuss applications they are familiar with in\n     their work at Hughes.\n\n\n\nDick Watson - SRI-NIC\n\n     Mr. Watson will discuss the advantages and the feasibility of dis-\n     tributing parts of NIC through the network.\n\n\n\nUndecided as yet - MITRE\n\n     A discussion of MITRE's work in designing a system for IRS.\n\n\n*Tentative.\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}