{
  "series": "Request for Comments",
  "number": "241",
  "howpublished": "RFC 241",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0241",
  "url": "https://www.rfc-editor.org/info/rfc241",
  "title": "Connecting computers to MLC ports",
  "pagetotal": "2",
  "year": "1971",
  "month": "sep",
  "body": "\n\n\n\n\n\nNetwork Working Group                           A. McKenzie\nRFC # 241                                       BBN\nNIC # 7671                                      29 September 1971\nCategories: B.1, C.1, I.1\nUpdates: none\nObsoletes:  Our Previous Verbal Comments\n\n\n\n                   CONNECTING COMPUTERS TO MLC PORTS\n                   ---------------------------------\n\n        Several times we have been asked if computers can be con- nected\n   through serial communication lines to ports on the Terminal IMP's\n   Multi-Line Controller (MLC) [related questions about the level of\n   software support provided by the Terminal IMP to such a connection,\n   have also been raised].  In the past we have said, \"Please don't!\" We\n   now say, \"Sure, but will that really help you the way you think it\n   will?\"\n\n\n        (1) Connections between computers and IMPs (i.e., the Host\n   interfaces) have been assumed to be error-free.  This assumption is\n   justifiable on the basis that the IMP and Host computers were\n   expected to be either in the same room (up to 30 feet of cable) or,\n   via the Distant Host option, within 2000 feet on well- controlled,\n   shielded cables.  A connection through common carrier facilities is\n   not comparably free of errors.  Usage of common- carrier lines for\n   connecting a terminal to an IMP, including the assumption of a human\n   at the terminal, is a situation in which the typical errors which do\n   occur can be accommodated.  Usage of the same wire, with the same\n   typical errors, for a computer-to- computer connection is likely to\n   be a situation in which the errors are unacceptable.  The present\n   version of the Terminal IMP does not provide error control either\n   within its hardware or within its software on any ports of the\n   Multi-Line Controller.  Further, we feel that computer-to-computer\n   connections over common carrier circuits should employ strong error\n   control, such as that\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nRFC # 241\n\n\n\n\n   used on the IMP/IMP circuits, and that attempts to use minimal error\n   control (e.g., character parity) is an undesirable technical choice.\n   Strong error control, with its retransmission scheme, not only would\n   imply significant changes in the Terminal IMP, but a non-trivial\n   hardware/software implementation at the remote computer end of the\n   circuit.\n\n\n        (2) Because the Terminal IMP has many obligations, the share of\n   its bandwidth which can be given to a Host coming in over the MLC\n   will be small.\n\n\n        (3) The command language provided at a port of the Multi- Line\n   Controller was designed with terminals and people in mind.  It\n   provides very few of the capabilities which a computer requires in\n   order to effectively utilize the communication network.  For example,\n   only a single pair of connections can be made from a given Terminal\n   TMP port; Host computers generally desire a larger number of\n   simultaneous connections to other Hosts on the network.  Assuming the\n   present Host/Host protocols, such a Host could not conveniently act\n   as a server.\n\n\n        If, despite these potential difficulties, connection of a\n   computer to the network through an MLC port appears to be useful, BBN\n   has no objection.  In fact, we would be extremely interested in\n   hearing about actual experience with this type of network connection.\n\n\n\n   AMcK:jm\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by BBN Corp. under the   ]\n         [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}