{
  "series": "Request for Comments",
  "number": "471",
  "howpublished": "RFC 471",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0471",
  "url": "https://www.rfc-editor.org/info/rfc471",
  "title": "Workshop on multi-site executive programs",
  "pagetotal": "2",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                     Bob Thomas\nRequest for Comments: #471                                BBN-TENEX\nNIC #14800                                                March 13, 1973\n\n\n                 Announcement Of A (Tentative) Workshop\n                    On Multi Site Executive Programs\n\n\nAn executive program is one which accepts and interprets commands from a\nuser, calling upon other programs to provide the resources required to\nsatisfy each command. There is currently interest in making resources on\nthe ARPANET available to the user via a standard, conversational\nfacility which one might call an ARPANET Executive. With such a facility\na user at a Host site or a TIP could conveniently access a wide range of\nresources at other sites without mastering the idiosyncrasies of each\nHost operating system which is contributing resources.\n\nFor example, the ARPANET executive could make it possible to locate (by\nname) a user logged in anywhere on the network and to establish a\nteletype link to that user in order to engage in an on-line dialogue. It\ncould also provide status information on the subnet and on all Hosts,\non-line ARPANET news service, on-line collections of trouble reports,\netc.  The range of possible services is practically unlimited once a\nbasic structure is devised for calling upon these services.\n\nMajor areas of interest here are:\n1.  How can the interfaces to resources of interest be standardized so\n    as to be accessible by \"server\" processes;\n\n2.  How can communications with such server processes be standardized?\n    (an ARPANET Executive protocol?)\n\n3.  To what extent can the conversational user interface be standardized\n    in the user processes? (an ARPANET Executive language?)\n\n4.  How can access authentication and accounting procedures be modified\n    to permit a user to \"login\" only once, yet use resources at many\n    Host sites?\n\nIf you are interested in discussing these and related issues forward\nyour name to Bob Thomas (BTHOMAS @BBN-TENEX), Bolt Beranek and Newman,\nInc., 50 Moulton Street, Cambridge, Massachusetts 02139, (617) 491-1850,\nextension 483.  If there is sufficient response, a Workshop (tentatively\nplanned for April) will be hosted by the BBN TENEX and BBN TIP groups.\nThe Workshop will permit participants to present relevant work and to\ndiscuss the issues raised above.\n\n\n\n\nThomas                                                          [Page 1]\n\f\nRFC 471        Workshop On Multi Site Executive Programs      March 1973\n\n\nIn the meantime, an example of an executive program which interprets a\nlimited set of commands in a multi-site context is available for\nexperimental use by TIP and TENEX users. The \"N\" command of the TIP and\nthe RSEXEC (Resource Sharing Executive) subsystem on TENEX, provide\ncommand interpretation in the context of TENEX and ITS sites. Users\nwhose access to the network is neither via a TIP or a TENEX may use the\nRSEXEC by directing their user TELNET to ICP to socket 367 (Octal) at\nBBN-TENEX.\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThomas                                                          [Page 2]\n\f\n"
}