{
  "series": "Request for Comments",
  "number": "355",
  "howpublished": "RFC 355",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0355",
  "url": "https://www.rfc-editor.org/info/rfc355",
  "title": "Response to NWG/RFC 346",
  "pagetotal": "3",
  "year": "1972",
  "month": "jun",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 John Davidson\nRequest for Comments #355                             UH-ALOHA SYSTEM\nNIC # 10597                                           9 June 72\nCategory:  Local Echoing, Remote Echoing, Satellite\nReferences:  RFC 346\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                        RESPONSE TO NWG/RFC 346\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                             John Davidson\n\n                              June 9, 1972\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n   Long transmission delays such as those inherent in satellite\n   communication are most certainly a cause for concern among users of\n   remote interactive systems.  Since the University of Hawaii will, by\n   the end of this year, be linked to the ARPANET via satellite, the\n   consequences of such delays are perhaps of more immediate concern to\n   us than to current members of the surface net.  Consequently the BCC\n   500 research group here has been studying various solutions to the\n   problems of buffer allocation, partitioned echoing, etc. re-introduced\n   in RFC 346.\n\n        Generally, the solutions come from extensions to the original\n   design concepts of the BCC 500 distributed communication system.  The\n   500 was designed to serve a large number of geographically-scattered\n   users each of whom accessed the central computing facility through one\n   of several remote concentrators.  [The concept is not too unlike that\n   of users at different TIPs all accessing a single host.] Since it was\n   felt that in full-duplex, character-by-character interaction, echo\n   delays of any noticeable length should not be tolerated, a facility\n   was provide whereby the concentrator could provide local (to the\n   terminal) echoing when deemed appropriate.  (A character input/output\n   microprocessor, the CHIO, in implicit conjunction with the terminal\n   user's process executing in the CPU dictated when it was appropriate.)\n   The problems associated with coordinating the concentrator and CHIO in\n   the partioning of echoing were solved for the BCC 500, but are not\n   immediately extensible to the asynchronous message transmissions of\n   the ARPANET - especially with the introduction of satellite delays.\n   As stated, we are working on some viable alternatives.\n\n        It is not known, at present, what effects the incorporation of\n   these partitioned echoing techniques might have on the existing net.\n   Perhaps local echoing will become a function of User TELNETs; most\n   certainly local echoing should be available in the TIP.  But could it\n   be incorporated into the IMP so that TIP and User TELNETs can be used\n   without change?  If so, what happens to the concentrator's local\n   echoing capability in a system such as the BCC 500?\n\n        These questions do not have immediate answers.  Other problems\n   obviously exist because of the differences in serving system\n   conventions for terminal control.  We, in conjunction with the ILLIAC\n   group at NASA-AMES, are seeking solutions to such problems in general,\n   with an eye toward their implementation\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n   on the net.  I would appreciate hearing of any other research being\n   performed in this area, and will be happy to discuss the findings of\n   our group with any interested parties.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by BBN Corp. under the   ]\n         [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n"
}