{
  "series": "Request for Comments",
  "number": "490",
  "howpublished": "RFC 490",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0490",
  "url": "https://www.rfc-editor.org/info/rfc490",
  "title": "Surrogate RJS for UCLA-CCN",
  "pagetotal": "6",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                    John R. Pickens\nRFC # 490                                                UCSB\nNIC # 15355                                              6 March, 1973\nreferences RFC # 436\n           RFC # 477\n\n\n                       SURROGATE RJS FOR UCLA-CCN\n\n\n    By using UCSB's Network Standard RJS* users can now gain access to\nUCLA-CCN's RJS without converting to the UCLA protocol.  In addition,\nthe need to use and create files in an intermediate host is avoided.\nFor example, TIP users may operate with hot card readers and printers\nthrough UCSB's Remote Job Server and have their jobs execute at UCLA-\nCCN.  The disadvantages of this scheme as compared to direct connections\nto UCLA are as follows:\n\n    1.  A small amount of additional JCL is required to route jobs from\n        UCSB to UCLA.\n\n    2.  A UCSB batch account must be opened.\n\n    3.  Turnaround time includes waits in UCSB batch queues.\n\n    4.  The current implementation requires separate submission and\n        retrieval steps.\n\n    5.  The RJS terminal used for submission/retrieval at UCLA-CCN\n        should not be accessed online until all transfers to/from UCSB\n        are complete.\n\nHopefully, these disadvantages are outweighed by the convenient\ninterface to standard RJS.\n\n    Attached is the document which describes this procedure to access\nUCLA-CCN.\n\n\n\n\n\n\n\n\n\n_________________________________\n*RFC #436 announces RJS at UCSB and RFC #477 describes its use.\n\n\n\nPickens                                                         [Page 1]\n\f\nRFC 490                SURROGATE RJS FOR UCLA-CCN             March 1973\n\n\n                  UCLA REMOTE JOB SUBMISSION FROM UCSB\n\n\nIntroduction\n------------\n\n    Users of the IBM 360/75 at UCSB may now route jobs to and from\nUCLA-CCN (IBM 360/91).  Only the reading, printing, and punching are\nhandled at UCSB while the scheduling, allocation of resources, and\nexecution are handled at UCLA. The program described below operates by\nestablishing operator and data connections with UCLA's Remote Job\nService through the ARPA Network and issuing operator commands to\ncontrol the submission and retrieval of jobs.  Thus it is possible for a\nuser to run jobs on UCLA's 360/91 almost as if he were at UCLA.\n\nProcedure\n---------\n\n    Submission and retrieval are two separate phases which the user must\ninitiate for each of his UCLA destined jobs.  Usually, two UCSB jobs\nwill be required for the two phases of one UCLA job.  Exceptions do\noccur using the BATCH options described below and jobs with a guaranteed\nfast UCLA turnaround (e.g. QUICKRUN jobs.)\n\n    Commands are issued through JCL to the local process and resultant\nactions and messages are recorded in the RJS system log on the user's\nlisting.  The user must be aware of the timing of his commands, e.g. a\nrequest to retrieve print output for a specific job will result in an\nerror condition if the job has not finished executing at UCLA.\nAvailable commands are READ, PRINT, PUNCH, STATUS, and TERMID.\n\n    Effort has been made to provide the user with fairly intelligible\nerror diagnostics although this is not always possible.  Error\nconditions are described in the section \"ERRORS\".\n\nJob Submission\n--------------\n\n    The READ command is used to send jobs to UCLA.  It is the default\ncommand if none other is specified.  UCLA jobs may be batched together\nunder a single read operation.  Great care should be taken to terminate\nthe batch with the correct delimiter (see DD Cards below) so that any\nfollowing non-UCLA jobs won't be sent to UCLA by mistake.  A suggested\nprocedure, if submitting jobs from the campus computer center, would be\nto indicate on the job submission card the intended destination.  If the\njob is accepted by UCLA a message from UCLA will be recorded indicating\nthe job name and number of cards received.\n\n\n\n\nPickens                                                         [Page 2]\n\f\nRFC 490                SURROGATE RJS FOR UCLA-CCN             March 1973\n\n\nSingle Job Retrieval\n--------------------\n\n    PRINT (JOBNAME) and PUNCH (JOBNAME) are used to explicitly fetch\nprint and punch output, respectively.  The UCLA RESET command is used to\nset all job priorities the same, and then to set the named job's\npriority to the highest value.  An unknown command, HEREIAM, is used for\nsynchronization purposes only.  If the named job is not ready for output\nthe local process will terminate with a timeout error (the current timer\nis set at one minute).\n\nMultiple Job Retrieval\n----------------------\n\n    PRINT (*) and PUNCH (*) are used to fetch all waiting output.  These\ncommands should always be preceded by the TERMID command.  Users who\nhave their own RJS terminal assigned to them will use this mode.\n\nUCSB Job Control Cards\n----------------------\n\n    EXEC Card\n\n    The catalogued procedure to executed is named UCLARJS.  Parameters\nare used to specify which functions are to be performed.  The general\nform of the execute card is:\n\n        //anyname EXEC UCLARJS, PARM.RJS-'...functions...'\n\n\nPARM Field\n----------\n\n    The following list defines the allowable parameters and their\nindicated functions.  All parameters are executed in sequence and\nseparated by commas.\n\n    READ - Open the reader channel and send 80 column records from the\n           SYSIN data set.\n\n    PRINT(JOBNAME) - Set indicated job's priority to highest value and\n           retrieve the print output to the SYSPRINT data set. Records\n           over 132 characters are folded to the next line.\n\n    PRINT (*) - Retrieve all print jobs.\n\n    PUNCH(JOBNAME) - Set indicated job's priority to highest value and\n           retrieve 80 column punch output to the SYSPUNCH data set.\n\n\n\nPickens                                                         [Page 3]\n\f\nRFC 490                SURROGATE RJS FOR UCLA-CCN             March 1973\n\n\n    PUNCH (*) - Retrieve all punch jobs.\n\n    STATUS - Query UCLA about the status of all jobs assigned to this\n           RJS terminal.\n\n    TERMID(NAME-PASSWORD) - Sign on as named RJS terminal.  PASSWORD is\n           optional and should be declared only if the terminal has a\n           password.  The local process always signs on initially as\n           NETUCSB.\n\nDD Cards\n--------\n\n    1.  Reader - The SYSIN data set should have the following format to\n          be able to send JCL and /* cards:\n\n       // RJS.SYSIN DD DATA,DLM=$$,DCB=(RECFM=F,LRECL=80,BLKSIZE=80)\n                       .\n                       .\n                       .\n                    job(s)\n                       .\n                       .\n                       .\n       $$ (note, this special delimiter is required)\n\n    2.  Printer - The default RJS.SYSPRINT data set is specified as\n          SYSOUT=A\n\n    3.  Punch - The default RJS.SYSPUNCH data set is specified as\n          SYSOUT=B\n\n    4.  RJS log - The default RJS.MESSAGES data set is specified as\n          SYSYOUT=A\n\nProblems and Errors\n-------------------\n\n    Most problems encountered fall into one of the following categories:\n\n    1.  UCLA-CCN or ARPANET down.\n          This condition is usually noted when the local process\n          attempts connection with UCLA.  The error message is usually\n          \"INITIAL CONNECTION OPEN ERROR.\"\n\n    2.  RJS terminal in use by a non-UCSB-jobshop process.\n          This can occur if a user submits a job but signs on to his\n          UCLA RJS terminal online prior to the local batch process\n\n\n\nPickens                                                         [Page 4]\n\f\nRFC 490                SURROGATE RJS FOR UCLA-CCN             March 1973\n\n\n          coming into execution.  This condition is usually noted by the\n          appearance of \"FAILURE OR TIMEOUT IN OPERATOR, PRINT OR PUNCH\n          CHANNEL\" with completion code 252.\n\n    3.  Job not ready to be retrieved.\n          The local process attempts to set the priority of the\n          indicated job but receives no successful response.  This\n          condition is also noted by the appearance of \"FAILURE OR\n          TIMEOUT IN OPERATOR, PRINT OR PUNCH CHANNEL\" with completion\n          code 252.\n\n    4.  UCLA is unable to retrieve output because of an age-old bug.\n          Unfortunately this condition can occur for very small amounts\n          of output.  It is usually noted by the message \"BEGINNING\n          RETRIEVAL OF\" followed by \"(PROBABLE UCLA BUG)..  PREVIOUSLY\n          GOOD CONNECTION NOW HAS STATUS = 8\".  The output in this case\n          is usually lost.\n\nCases 1 through 3 are corrected by waiting and then trying again.  Other\nerror messages may require reference to the NETWORK USER GUIDE or\nconsultation with Computer Center or Computer Systems Lab personnel.\n\n\nExamples\n--------\n1.  Submit a job to UCLA-CCN through RJS terminal NETUCSB.\n\n    //SUBMIT JOB (0000,ROBERTS),'PSYCH BOX'\n    //STEP1 EXEC UCLARJS\n    //RJS.SYSIN DD DATA,DLM=$$,DCB=(RECFM=F,LRECL=80,BLKSIZE=80\n    //AAA000IC JOB......\n                .\n                .\n                .\n                .\n                .\n\n    $$\n    //\n\n2.  Retrieve print job AAA000IC from terminal NETUCSB.\n\n    //RETR JOB (0000,ROBERTS),'PSYCH BOX'\n    //STEP1 EXEC UCLARJS,PARM.RJS='PRINT(AAA000IC)'\n    //\n\n\n\n\n\n\nPickens                                                         [Page 5]\n\f\nRFC 490                SURROGATE RJS FOR UCLA-CCN             March 1973\n\n\n3.  Retrieve all prints jobs from terminal NETRAND0\n\n    //RETR JOB (0000, ROBERTS),'PSYCH BOX'\n    //STEP1 EXEC UCLARJS,'TERMID(NETRAND0),PRINT(*),STATUS'\n    //\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPickens                                                         [Page 6]\n\f\n"
}