{
  "series": "Request for Comments",
  "number": "273",
  "howpublished": "RFC 273",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0273",
  "url": "https://www.rfc-editor.org/info/rfc273",
  "title": "More on standard host names",
  "pagetotal": "3",
  "year": "1971",
  "month": "oct",
  "body": "\n\n\n\n\n\nNetwork Working Group                      Richard W. Watson\nRequest for Comments #273                  SRI-ARC\nNIC 7837                                   18 October 1971\nCategories:\nRelated: 7625, 7626, 7661, 7688, 7650, 7646\nObsoletes: 7662\n\n                      MORE ON STANDARD HOST NAMES\n\n   The Network Information Center is a logical place to handle this\n   problem of Standard Host Names and so the ball now rests here.\n   This is clearly a delicate subject with people having strong\n   feelings and attachments to names.  No past proposal, including\n   RFC 247, NIC 7668, has yet achieved any acceptance.  This\n   identification seems a natural thing and should be taken into\n   account in setting up a naming scheme.  Therefore, the following\n   proposal is offered which I hope may be satisfactory to everyone.\n\n   Any naming scheme must:\n\n      (1)  Recognize the expanding character of the Network, with\n      the potential eventually of several hundred sites.\n\n      (2)  Recognize the need for abbreviations to simplify typing.\n\n      (3) Recognize the use of names on hardcopy and online\n      documentation\n\n      (4)  Recognize people's strong identification with historical\n      names associated with their project.\n\n   To meet these needs, we propose adoption of a hybrid scheme\n   related to those in the other past proposals.\n\n   Each host will have a formal name of the form:\n\n      \u003cInstitution Mnemonic\u003e    \"-\"   \u003cHost or NIC Station Mnemonic\u003e\n\n      and an optional nickname of the form:\n\n                  \u003cNickname\u003e\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nRWW 20 OCT 71 7837                                More on Standard Names\n\n\n   We have heard no arguments to support severe restrictions on name\n   length and, therefore, human considerations should probably\n   prevail, but would suggest the following guidelines.\n\n      \u003cInstitution Mnemonic\u003e will be at most 4 characters, formed as\n      per RFC 247, NIC (7688,).\n\n         Examples of Institutions being:  AMES, CASE, BBN, UCLA,\n         SRI, MIT, HARV, MITR, etc.\n\n         We must recognize that in the future there may be multiple\n         IMPS and TIPS and combinations at a given institution, so\n         that there is not a one-to-one correspondence between\n         \u003cInstitution Mnemonic\u003e and IMPS or TIPS.  Also affiliated\n         with the Network, there will be groups and individuals\n         without an IMP or a TIP, or with just a terminal to a TIP,\n         whose organizations need unique names.\n\n      \u003cHost or Nic Station Mnemonic\u003e will not have any restriction\n      on length, but should if possible be short.  In picking \u003cHost\n      or NIC Station Mnemonic\u003e, an order of priority for choosing\n      this mnemonic might be\n\n         (1)  Suborganization within the \u003cInstitution Mnemonic\u003e.\n\n         (2)  Project mnemonic.\n\n         (3)  Machine designation.\n\n         (4) The suggestion in RFC 247, NIC 7688 to include the\n         designation TIP or TEST should probably be followed as\n         conveying useful information.\n\n         Examples might be:\n\n            ARC, NMC, NCCTIP, TENEXA, TENEXB, MULTICS, ILLIAC, SAIL,\n            DMCG, IMP, TX2, etc.\n\n      The \u003cnickname\u003e should be unique within the network community,\n      short, and preferably should be the same as \u003cHost or NIC\n      Station Mnemonic\u003e to make life easy for people having to learn\n      them.\n\n   I would strongly recommend that Telnets recognize both the Formal\n   Name and the Nickname.\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nRWW 20 OCT 71 7837                                More on Standard Names\n\n\n   Now the sticky question:  who chooses the names?  The only\n   satisfactory answer is to allow the hosts, through their liaison,\n   to choose their own names, possibly subject to some discussion if\n   duplicate or extra long names are picked.  Hosts or stations at a\n   given institution should use the same \u003cInstitution Mnemonic\u003e.\n\n   Let's settle this issue as soon as possible, say by November 5;\n   each liaison please send me your names by then.\n\n   If there are any implementation hardship cases, other than TIPs,\n   caused by the above scheme, please let me know as soon as\n   possible.\n\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by BBN Corp. under the   ]\n         [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n"
}