{
  "series": "Request for Comments",
  "number": "328",
  "howpublished": "RFC 328",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0328",
  "url": "https://www.rfc-editor.org/info/rfc328",
  "title": "Suggested Telnet Protocol Changes",
  "pagetotal": "2",
  "year": "1972",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                 Jon Postel\nRequest for Comments: 328                             Computer Science\n                                                      UCLA-NMC\nNIC 9635                                              29 April 72\nCategories: Telnet\nReferences: RFC 328\n\n                   Suggested Telnet Protocol Changes\n\n    I hereby propose the following changes to the Telnet protocol.  If\nno substantial negative response is received by 15 May 72 it will be\nassumed that these changes are desired and should be incorporated in\nany \"Official Telnet Protocol\".\n\n    First I suggest that we drop the idea of a \"minimum\"\nimplementation and require a standard implementation which includes all\naspects of the protocol.\n\n    Second I suggest that we eliminate the DATA TYPE signals.\n\n    Third I suggest that we do away with HIDE YOUR INPUT signal.\n\nArguments:\n\n    Standard Implementation:\n         The idea of an accepted implementation which does not include\n         whole protocol is an admission that the parts of the\n         protocol left out are either not useful or not expected to be\n         used, and that other mechanisms will be constructed to provide\n         those functions.  Thus there should be no minimum\n         implementation, but only the standard implementation which\n         includes the whole protocol.\n\n    Data Types:\n         The DATA TYPE signals are supposed to allow the communicating\n         processes to switch from ASCII to some other code set.  However,\n         the other code sets suggested do not allow for the Telnet\n         signals, and thus once the switch is made the Telnet\n         protocol is no longer applicable.  There is no way to specify\n         how to get back to ASCII or Telnet thus the\n         conversation is \"out of control\".\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n    Hide Your Input:\n         The HIDE YOUR INPUT signal is supposed to tell the user Telnet\n         process to do whatever it can to hide the user's\n         subsequent input.  One problem with this is determining\n         how much input is to be hidden.  It is very difficult to find a\n         method of hiding input which works for all combinations of\n         systems and terminals, but the HIDE YOUR INPUT signal dosen't\n         help in any real way.\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}