{
  "series": "Request for Comments",
  "number": "463",
  "howpublished": "RFC 463",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0463",
  "url": "https://www.rfc-editor.org/info/rfc463",
  "title": "FTP comments and response to RFC 430",
  "pagetotal": "3",
  "year": "1973",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                                  Abhay K. Bhushan\nRFC # 463                                              MIT-DMCG\nNIC # 14573                                            February 21, 1973\n\n\n                  FTP Comments and Response to RFC 430\n\n\n    Most of the comments in RFC 430 by Bob Braden are useful suggestions\nwhich should be included in the forthcoming official FTP specification.\nThis RFC represents my response to Braden's comments and other views.\nThese comments should be useful for the FTP meeting on March 16 at BBN\n(announcement warning AAM NIC #14417). The results of the FTP subgroup\nmeeting held at BBN on January 25 will be published in RFC 4541 (are\npublished?).\n\nSPECIFIC RESPONSES TO RFC 430.\n\n    Item A1 - I will let Bob Braden handle the \"print file\" issues (the\n    \"still\" should be removed).\n\n    Item A2 - I agree that concessions are undesirable and should be\n    removed unless people cannot \"live\" without them.\n\n    Item A3 - I strongly support \"bit flag coding\" for descriptors.\n    Other definition improvement suggestions are ok too.\n\n    Item A4 - The diagram was useful. An alternate one is given on page\n    17 of RFC 454. I prefer the latter.\n\n    Item A5 -  The FTP may not be privileged enough to alter passwords\n    in many Host systems (e.g. Multics). I know that CCN allows changing\n    passwords on-line. We can define a format for changing passwords in\n    the pass command, but I don't think we can require that all servers\n    allow password changing. This is a minor problem that can be easily\n    solved.\n\n    Item A6 - Yes, the comment that TYPE should be before BYTE was for\n    bad implementations. The server should reject data transfer\n    parameters only when the data transfer command is received. The\n    order of the parameter-change commands is not important.\n\n    Item A7 - I do agree that NCP's should be fixed.  A 255 (socket\n    number) reply should be required at a specific time, and NCP's\n    should be able to provide it (this also permits the proposed GSOC\n    command). Let us find out at next meeting if there is anyone who\n    cannot live with this new requirement.\n\n\n\n\nBhushan                                                         [Page 1]\n\f\nRFC 463           FTP Comments and Response to RFC 430     February 1973\n\n\n    Item A8 - Yes.\n\n    Item B - There are at least two ways to solve the FTP parameter\n    encoding problem presented by Bob Braden. One is to allow multiple\n    letter in the TYPE command as suggested by Bob and the other is to\n    have a new command such as FORM (which could be P or U). Other\n    solutions are equally acceptable to me.\n\n    Item C - Our emphasis should be on working protocol as well as\n    elegance. I like the proposed GSOC command over the listen.  In fact\n    GSOC can be used for all data connection security checking. The 255\n    reply should be sent with GSOC only, and the server should use only\n    those sockets for data connection.\n\n    Item D - We need more discussion on the issue of site dependent FTP\n    parameters. I will put it on the agenda for the forthcoming FTP\n    meeting.\n\nFURTHER COMMENTS\n\n    1. The command-reply sequence needs to be tightened in both\n    specification and implementations to allow convenient use of FTP by\n    programs or \"automatons\".\n\n    2. A 300 reply greeting upon first connecting to the FTP server\n    should be required and not optional. This avoids the programs having\n    to wait an arbitrary time for such a greeting before issuing\n    commands. Commands may only be sent after the 300 reply is received\n    from the server.\n\n    3. RFC 454 needs a discussion of transfer between two FTP servers\n    arranged by the user via the LSTN or GSOC commands.\n\n    4. Perhaps we should allow specification of data transfer parameters\n    in a single command line (for reasons of efficiency).  A suggested\n    format is to have \u003cSP\u003e separate the parameters bunched together in a\n    single line (requiring only a single reply).  Consider the following\n    sequences:\n            STRU F TYPE I BYTE 36 MODE S \u003cCR\u003e\u003cLF\u003e\n            reply - 200 OK\n\n    5. Further discussion of MAIL and MAIL.file commands seems\n    necessary. Perhaps we will get some useful input from the MAIL\n    meeting at SRI on February 23, The following issues seem\n    particularly relevant to me:\n        a) Allowing mail to multiple users. It should be required that\n    FTP servers allow this.\n\n\n\n\nBhushan                                                         [Page 2]\n\f\nRFC 463           FTP Comments and Response to RFC 430     February 1973\n\n\n        b) Using NIC idents. FTP servers should accept some standard\n    form of user name. This could be NIC idents or last name with\n    optional use of initials.\n        c) Uniform conventions for who the mail is from, day, time,\n    etc., and how the mail is delivered to user. The mail usually gets\n    tagged twice or sometimes not tagged at all.  Perhaps we need a\n    different mechanism for indicating who the mail is from than\n    provided by the USER command.\n        d) handling bulk or junk mail (particularly the NIC documents\n    that may be sent on-line by the NIC). Perhaps mail.file should put a\n    file in user's directory and notify him of the same. The user does\n    not see all the junk on his console but can print the file on a\n    printer and read that class of mail at his leisure.\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBhushan                                                         [Page 3]\n\f\n"
}