{
  "series": "Request for Comments",
  "number": "346",
  "howpublished": "RFC 346",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0346",
  "url": "https://www.rfc-editor.org/info/rfc346",
  "title": "Satellite Considerations",
  "pagetotal": "1",
  "year": "1972",
  "month": "may",
  "body": "\n\n\n\n\n\nNetwork Working Group                           Jon Postel\nRequest for Comments: 346                       Computer Science\n                                                UCLA-NMC\nNIC : 10425                                     30 May 72\n\nCategories :  Echo Plex, Satellite\nReferences :  RFC's 1, 5, 51\n\n                        Satellite Considerations\n\nThe consideration of using space satellite transmission links in the\nARPANET should be cause for some thought by the parties making use of\nthe network.  The satellite transmission path will not necessarily affect\nthe transmission rate but it will affect the delay.  The change in the\ndelay characteristics can be approximated by the change in path length.\nThus if the satellite is in synchronous orbit about 22,000 miles above\nthe earth, the path length is about 44,000 miles compared to (worst\ncase) 3,000 miles or about a 15 to 1 increase in path length and delay.\n(The time for light to travel 3,000 miles is .016 seconds, to travel\n44,000 miles is .236 seconds.)\nIn the current (surface) ARPANET delays are such that interactive\nservers with character-at-a-time remote echo are only marginally useful.\nWhile I believe that this delay (unmeasured) is largely due to the host\nsystems, adding a half second transmission delay will cause these\nmarginal systems to become unusable.\nThought should also be given to buffer allocations.  If a receiving\nsystem allows only one line of text to be buffered at a time and\nrefreshes the allocation as each line is output to a human user there\nwill be at least a half second delay between the arrival of each line at\nthe receiving system.  This need not be a problem until the speed of the\noutput device is above about 150 characters/second.  This \"small buffer\"\nproblem can be expected to occur even with lower speed devices since\nhost delays are estimated to be in the range 0.1 second to 1.0 second.\nI suggest that it is appropriate to resume a discussion of measures to\ncircumvent the difficulties brought about by these large delay\ncharacteristics. Some areas of discussion could be: buffer sizes in\nservers and users, echo plex techniques, moving part of the input\nprocessing to the user system.  If it is decided to move the echo plex\nfunctions to the user system, it would be wise to try for a \"standard\"\npackage, thus reducing a M times N problem to a M plus N problem.\nPlease dig out and read RFC's #1 Crocker, #5 Rulifson, #51 Elie to see\nsome previous thinking about this type of problem.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}