{
  "series": "Request for Comments",
  "number": "32",
  "howpublished": "RFC 32",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0032",
  "url": "https://www.rfc-editor.org/info/rfc32",
  "title": "Some Thoughts on SRI's Proposed Real Time Clock",
  "pagetotal": "1",
  "year": "1970",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                                   Jerry Cole, UCLA\nRequest for Comments: 32                                February 5, 1970\n\nSOME THOUGHTS ON SRI'S PROPOSED REAL TIME CLOCK\n\nRe: NWG/RFC's #28 and 29.\n\nThe addition of a clock in one or more of the network HOST's seems to be\nvery desireable since it (or they) would allow user-oriented message\ndelay measurements.  Our present network measurement facilities do not\ninclude any internal HOST delays, and these delays may be an appreciable\nportion of the total delay encountered by a HOST-to-HOST message\ntransmission.  We may find that an extension of our \"Trace\" capabilities\nto include internal HOST delays would be an appropriate mechanism for\nutilizing such a clock.  Such usage would require a clock at both the\nsource and the destination of the message, although such clocks would\nnot have to be particularly accurate nor synchronized.  Other tests,\nsuch as the absolute overall message delay from HOST A to HOST B would\nrequire synchronization of the two clocks.\n\nA reasonable specification for the SRI real-time clock would seem to\ninclude a resolution of about 1 msec., an accuracy of about 1 part in\n10E7 (so that two such clocks could maintain reasonable relative\naccuracies over periods of many hours), and a range of about 24 hours.\nA crystal controlled clock should easily meet these requirements at a\nmoderate cost.\n\nThe choice of the mechanism by which the HOST can read the clock appears\nto be of concern also.  The 1 msec. resolution may require that the\nclock be entirely hardware (as opposed to a core location which would be\nincremented at each clock pulse), and therefore the clock may require\nsome rather compli- cated interface circuitry.\n\nAt UCLA, we presently have two clocks on the Sigma 7, and one of these\nhas a resolution of about 2 msec. which might be usable for some\ninternal HOST measurements.  However, it does not have the long term\naccuracy for the absolute measurements mentioned above.\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Richard Ames 1/98 ]\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}