{
  "series": "Request for Comments",
  "number": "152",
  "howpublished": "RFC 152",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0152",
  "url": "https://www.rfc-editor.org/info/rfc152",
  "title": "SRI Artificial Intelligence status report",
  "pagetotal": "1",
  "year": "1971",
  "month": "may",
  "body": "\n\n\n\n\n\nNetwork Working Group                                            M. Wilber\nRequest for Comments #152                                        10 May 71\nNIC #6756                                                        SRAI\nCategory: G.3\nObsoletes: None\nUpdates: None\n\nResponse to RFC #116\n\n\n                SRI ARTIFICIAL INTELLIGENCE STATUS REPORT\n\n\n     The Stanford Research Institute's Artificial Intelligence Group (SRAI\nin the four-letter abbreviations) expects connection to the ARPA net as a\nresearch center after conversion this summer to a TENEX from our current\nPDP-10. Our connection will be through the IMP already at SRI for the\nNetwork Information Center and through a PDP-15 serving our PDP-10 as a\ncontroller of peripherals. Our hardware interface to the IMP is currently\nin the bidding process, and we intend to use as much as possible of the\nTENEX network software. (Probably all we will need to change is the lowest\nlevel, most strongly hardware-oriented part of the NCP.)\n\n     The most optimistic estimate we can give for functional connection to\nthe network is mid-July 1971. We are currently devoting the energies of\nour system support group to the accomodation of various hardware and design\nchanges, and so our contact with the Network Working Group has been only\nminimal and passive. It is entirely conceivable that we may find our par-\nticipation tending to strength and activeness as we cross our other bridges.\n\n     We can project our participation in the network into the first few\nmonths of our connection. We can support several simultaneous outside\nusers on a system nominally up during the business day and often up at\nother times. Lapses in continuity of system operation are usually due to\nscheduled maintenance or hardware failures and tend to occur at intervals\nof either an hour or several days with remarkable consistency. The prin-\ncipal service we offer to other network participants is the availability\nof various parts of our own research software. The most notable examples\nare QA3.6, a first-order resolution theorem prover;  STRIPS, an extra-\nlogical problem solver;  and possibly QA4, a language oriented toward\nproblem-solving strategies. The services we can anticipate requesting\nof the network are of two kinds: We could conceivably use other people's\nartificial intelligence programs on a trial basis; and we might use the\nnetwork to make occasional contact with other people in the network.\n\n        [ This RFC was put into machine readable form for entry ]\n        [ into the online RFC archives by BBN Corp. under the   ]\n        [ direction of Alex McKenzie.                   12/96   ]\n\n\n\nKreznar                                                         [Page 1]\n\f\n"
}