{
  "series": "Request for Comments",
  "number": "339",
  "howpublished": "RFC 339",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0339",
  "url": "https://www.rfc-editor.org/info/rfc339",
  "title": "MLTNET: A \"Multi Telnet\" Subsystem for Tenex",
  "pagetotal": "4",
  "year": "1972",
  "month": "may",
  "body": "\n\n\n\n\n\nNETWORK WORKING GROUP                                   R.Thomas\nREQUEST FOR COMMENTS #339                               BBN\nN.I.C. #9932                                            May 5,1972\n\n\n             MLTNET - A \"MULTI-TELNET\" SUBSYSTEM FOR TENEX\n\nINTRODUCTION\n\nMLTNET is a TELNET-like facility for TENEX which enables a user to\ncontrol a number of jobs, running on different ARPANET hosts. It\nmultiplexes the user's local console among the remote jobs. MLTNET is\nuseful in applications which require coordinated behavior of several\nnetwork hosts.  In particular, we have found it helpful in debugging\nprograms which make use of the network. The MLTNET program is designed\nto be easy to use and, while used in remote mode, to be as transparent\nas possible to the user. It is somewhat less sophisticated than the\nTENEX user-TELNET program. MLTNET is currently a subsystem on the BBN-\nTENEX host.\n\nUSING MLTNET\n\nMLTNET operates in two modes:\n\n1.      Local Mode Operation:\n        When in local mode MLTNET interprets input types by the\n        user as commands to it. Commands consist of a mnemonic\n        command name followed by zero or more parameters.\n        Included in the commands recognized by MLTNET are ones\n        which enable the user to associate a name of his choice\n        with a connection to an ARPANET site, to establish a\n        connection with a named site, to list the network status\n        as seen from the user's TENEX etc.\n\n2.      Remote Mode Operation\n        When operating in remote mode MLTNET makes the user's\n        console appear to be directly connected to a remote\n        site. It transmits input typed by the user to the\n        remote site and prints output recieved from the remote\n        site. Output received from a remote site while the user\n        is in local mode or is interacting with another remote\n        site is buffered for the user by MLTNET.\n\n        MLTNET has been designed to be transparent to the user\n        while operating in remote mode. In particular, when in\n        remote mode it transmits user-types ^C (CONTROL-C, the\n        TENEX \"attention\" character) and ^T (CONTROL-T, the\n        TENEX \"time used query\" character) to the remote site.\n\n\n\n                                                                [Page 1]\n\f\n        When in local mode ^C and ^T have their usual TENEX\n        effect.\n\n        Occasinally a user may find it necessary to modify the\n        characteristics of a connection to a particular remote\n        site. For example, he may want to have MLTNET echo\n        typed input as it is transmitted. Or, he may be using a\n        remote host which requires both upper and lower case\n        characters from a local terminal which has only upper\n        case; in such a case he would want MLTNET to transmit\n        upper and lower case as appropriate. In remote mode\n        operation MLTNET recognizes \"!\" as an escape character\n        and interprets the character following it as a command\n        to change the characterristics of the connection currently\n        in use. Commands recognized by MLTNET in remote mode\n        are summerized in the next section. To have MLTNET\n        transmit \"!\" to the remote site the user types \"!!\".\n\nMLTNET Command Summary\n\nLocal Mode Commands\n\nMLTNET uses the character \"\u003c\" to signal the user that it is in local\nmode ready to accept input. Commands and command parameters may be\neditted as they are input.The character ^A (CONTROL-A) deletes the last\ncharacter input. In response to a ^A MLTNET types \" deleted. The\ncharacter ^R (CONTROL-R) causes the input string as collected so far to\nbe retyped (with all editting carried out). MLTNET responds to the\ncharacter RUBOUT (octal 177) by aborting the current input collecting\noperation and typeing the ready character \"\u003c\". The ALTMODE character\n(octal 175) may be used to invoke command recognition and completion. If\ninsufficient information is availble to recognize an input string as a\ncommand MLTNET responds to ALTMODE by ringing the terminal bell. Any\nprefix which uniquely identifies a command is recognized as that command\nby MLTNET.\n\nIn the following, \u003cname\u003e and \u003csite\u003e denote command parameters. They are\nstrings terminated by a space or carriage return. \u003cname\u003e is a user\nchosen string of 14 characters or less; site is either the name of an\nARPANET host or the string \"LOCAL\".\n\nThe commands recognized by MLTNET in local mode are:\n\nASSIGN:\n        syntax: ASSIGN \u003cname\u003e \u003csite\u003e\n        effect: Associates the user chosen string \u003cname\u003e with a\n                connection to the ARPANET site \u003csite\u003e.\n\n\n\n\n                                                                [Page 2]\n\f\nTALK:\n        syntax: TALK \u003cname\u003e\n        effect: Switches from command mode to remote mode\n                directing subsequent console input to the site\n                associated with \u003cname\u003e. If no ARPANET site is\n                currently associated with \u003cname\u003e, the user is\n                asked to spesify a site. The first time the\n                user \"talks\" to a particular named site MLTNET\n                goes through the ARPANET initial connection\n                protocol with the remote site in order to\n                establish a duplex connection with it.\n\nNAMES:\n        syntax: NAMES\n        effect: Prints on the console the \u003cname\u003e/\u003csite\u003e\n                associatins currently known to MLTNET.\n\nQUIT:\n        syntax: QUIT\n        effect: Returns control to the TENEX EXEC breaking all\n                connections with remote hosts. It is good\n                practice to log out of each remote host before\n                using the QUIT command.\n\nNETSTAT:\n        syntax: NETSTAT\n        effect: Prints on the console the network status as seen\n                from the local TENEX.\n\nRENAME:\n        syntax: RENAME \u003cname\u003e1 \u003cname\u003e2\n        effect: Associates \u003cname\u003e2 with the ARPANET site\n                previously associated with \u003cname\u003e1.\n\nFLUSH:\n        syntax: FLUSH \u003cname\u003e\n        effect: Breaks the network connection with the ARPANET\n                site associated with \u003cname\u003e and, in addition,\n                breaks the association between \u003cname\u003e and that\n                site.\n\nHOSTS:\n        syntax: HOSTS\n        effect: Prints on the console the list of hosts\n                currently known to the MLTNET subsystem.\n\nHELP:\n        syntax: HELP\n\n\n\n                                                                [Page 3]\n\f\n        effect: Prints on the console a breif summary of how to\n                use MLTNET.\n\nRemote Mode Commands\n\nIn remote mode MLTNET recognizes the escape character \"!\" as a signal to\ninterpret the following character as a command.  Currently MLTNET\nrecognizes the following characters as commands to it:\n\nQ:      (quit) Causes MLTNET to switch from remote mode to local\n        mode.\n\nL:      (local echo) Causes MLTNET to echo characters as it\n        transmits them to the remote site. ;L is the inverse of\n        R. The default case.\n\nR:      (remote echo) Causes MLTNET to transmit characters typed\n        to it without echoing them; invers of L.\n\nU:      (upper case) Causes MLTNET to transmit upper case letters\n        as typed; the inverse of S. The default case.\n\nS:      (small letters - lower case): Causes MLTNET to transmit\n        upper case letters typed to it as lower case letters.\n        In this mode of operation \"^\" acts as a shift key; \"^\"\n        may be transmitted by typing \"!^\". S is the inverse of\n        U.\n\nX:      (where X is any character other than Q, L, R, U or S):\n        Causes MLTNET to transmit X.\n\nThe following is an annotated scenario which illustrates the use of\nMLTNET; in it characters typed by  the users are underlined.\n\n\n       [ This RFC was put into machine readable form for entry ]\n        [ into the online RFC archives by Tor Fredrik Aas 1/98 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n"
}