{
  "series": "Request for Comments",
  "number": "311",
  "howpublished": "RFC 311",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0311",
  "url": "https://www.rfc-editor.org/info/rfc311",
  "title": "New Console Attachments to the USCB Host",
  "pagetotal": "2",
  "year": "1972",
  "month": "feb",
  "body": "\n\n\n\n\n\n                                                  UCSB Computer\nNETWORK WORKING GROUP                             Research Lab.\nREQUEST FOR COMMENTS # 311                        Roland F. Bryan\nNIC #9341                                         29 February 1972\n\n\n                NEW CONSOLE ATTACHMENTS TO THE UCSB HOST\n\n\n\n   The MLC/360M\n   ---------------\n\n   The UCSB 360-75 is equipped with an interface unit that allows\n   attachment of any type of I/O device to the Multiplexor Channel and\n   for that device to be operated by program control as though it were a\n   standard IBM Control Unit.  The interface, referred to as the\n   Multi-Line Controller/360M (MLC/360M), operates on the Multiplexor\n   Channel and provides 32 independently addressed I/O connections that\n   are grouped into 16 pairs to accommodate full- duplex I/O operation.\n   Each input group has a 16-bit input buffer plus related synchronizing\n   and control logic to make it a stand-alone control unit on the 360\n   channel.  Similarly, each output group has a 32-bit buffer plus logic.\n   Attachment is achieved by connection through a data-set type connector\n   and I/O signal levels conform to EIA standards (RS-232 Spec.).\n\n\n   Both the I/O group hardware and the supporting software for the\n   MLC/360M are readily modified to produce any variations required for\n   attachment and operation of non-standard devices.\n\n\n   Since our primary support was for 201B data-sets at 2400 baud, we\n   first implemented the 16 I/O group pairs to accommodate this type of\n   modem in our time-shared user environment.  The I/O groups have now\n   been variously modified to support a wide range of applications, from\n   300 baud acoustic coupled use to 9600 baud for multi-station classroom\n   operation.\n\n\n\n   New Consoles\n   ---------------\n\n\n   In addition to our standard attachments, which are mostly Culler-Fried\n   graphic display consoles and educational classrooms\n\n\n\n\n                                                                [Page 1]\n\f\n   using such consoles, we have a Tektronix 4002A and an NIH General\n   Purpose Graphics Terminal (GPGT).\n\n\n   The Tektronix terminal can now be operated on the ARPANET and will\n   provide our users with upper and lower case ASCII for easier operation\n   with other sites.  A report on this console's capability will be\n   forthcoming.\n\n\n   The GPGT was developed by the University of IOWA for use in\n   Bio-Medical applications.  The unit is a delay-line refreshed video\n   display with graphic capability and is the only dynamic type display\n   in use on our host computer at present.  We are evaluating its\n   performance in our On-Line System environment.  Since a user at this\n   terminal is also able to reach into the network, we will have some\n   future comments on its operation for interested persons.\n\n\n\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}