{
  "series": "Request for Comments",
  "number": "3",
  "howpublished": "RFC 3",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0003",
  "url": "https://www.rfc-editor.org/info/rfc3",
  "title": "Documentation conventions",
  "pagetotal": "2",
  "year": "1969",
  "month": "apr",
  "day": "1",
  "body": "Network Working Group                                                 4689\nRFC-3                                                           April 1969\n                                                             Steve Crocker\n                                                                      UCLA\n\n\n                        DOCUMENTATION CONVENTIONS\n\n\n\nThe Network Working Group seems to consist of Steve Carr of Utah, Jeff\nRulifson and Bill Duvall at SRI, and Steve Crocker and Gerard Deloche\nat UCLA.  Membership is not closed.\n\nThe Network Working Group (NWG) is concerned with the HOST software, the\nstrategies for using the network, and initial experiments with the network.\n\nDocumentation of the NWG's effort is through notes such as this.  Notes\nmay be produced at any site by anybody and included in this series.\n                        \n\nCONTENT\n\nThe content of a NWG note may be any thought, suggestion, etc. related to\nthe HOST software or other aspect of the network.  Notes are encouraged to\nbe timely rather than polished.  Philosophical positions without examples\nor other specifics, specific suggestions or implementation techniques\nwithout introductory or background explication, and explicit questions\nwithout any attempted answers are all acceptable.  The minimum length for \na NWG note is one sentence.\n\nThese standards (or lack of them) are stated explicitly for two reasons.\nFirst, there is a tendency to view a written statement as ipso facto \nauthoritative, and we hope to promote the exchange and discussion of \nconsiderably less than authoritative ideas.  Second, there is a natural\nhesitancy to publish something unpolished, and we hope to ease this\ninhibition.\n\nFORM\n\nEvery NWG note should bear the following information:\n\n        1.  \"Network Working Group\"\n            \"Request for Comments:\" x\n            where x is a serial number.\n            Serial numbers are assigned by Bill Duvall at SRI\n\n        2.  Author and affiliation\n\n        3.  Date\n\n        4.  Title.  The title need not be unique.\n\nDISTRIBUTION\n\nOne copy only will be sent from the author's site to\"\n\n        1.  Bob Kahn, BB\u0026N\n        2.  Larry Roberts, ARPA\n        3.  Steve Carr, UCLA\n        4.  Jeff Rulifson, UTAH\n        5.  Ron Stoughton, UCSB\n        6.  Steve Crocker, UCLA\n\nReproduction if desired may be handled locally.  \n\nOTHER NOTES\n\nTwo notes (1 \u0026 2) have been written so far.  These are both titled HOST\nSoftware and are by Steve Crocker and Bill Duvall, separately.\n\nOther notes planned are on\n\n        1.  Network Timetable\n        2.  The Philosophy of NIL\n        3.  Specifications for NIL\n        4.  Deeper Documentation of HOST Software.\n\n\n\n"
}