{
  "series": "Request for Comments",
  "number": "141",
  "howpublished": "RFC 141",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0141",
  "url": "https://www.rfc-editor.org/info/rfc141",
  "title": "Comments on RFC 114: A File Transfer Protocol",
  "pagetotal": "2",
  "year": "1971",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                      E. F. Harslem\nRequest for Comments: 141                                  J. F. Haefner\nNIC 6726                                                            Rand\n                                                           29 April 1971\n\n             COMMENTS ON RFC 141 (A FILE TRANSFER PROTOCOL)\n\n   1.  A file transfer protocol is needed.  Bushan's proposal would\n   satisfy a particular current need that we have, as well as short-term\n   envisioned needs.\n\n   2.  Bushan's protocol would apear to be straight-forward in\n   implementation, and extensible as claimed.\n\n   3.  We would like to see implementations of such protocol be\n   accomplished such that the file transfer program has general and\n   complete access to the local file storage.  That is, it should be\n   able to access a file that it did not create.  For example, if a\n   program or user creates a file at site X (completely independent of\n   the file transfer program), it would then be desirable to be able to\n   retrieve the file via the file transfer program.  This is not a\n   requirement of RFC #114 but we would like to see it implemented where\n   possible.\n\n   4.  Since implementation of a subset of transaction types is\n   specifically permitted, we suggest inclusion of the following\n   commands (in addition to append).\n\n      insert records     within a file\n      delete records     from within a file\n      replace records    within a file\n\n   Although these operations are not directly supported under IBM\n   OS/360, we have used them with a non-standard file subsystem under\n   IBM OS/360 and find them quite useful.\n\n   5.  In addition to retrieve and lookup, get names of files under my\n   access control would be useful.\n\n   6.  The absence of status requests and responses is apparent.\n   Although this is typically a function associated with a remote job\n   entry (RJE) system, since the execute request is present it would\n   seem appropriate to inquire about the status of the process created\n   by the execute command.  This becomes increasingly more important\n   where the execute is implemented as an RJE-like operation and\n   scheduling time of the job might be prolonged.\n\n\n\n\n\nHarslem \u0026 Haefner                                               [Page 1]\n\f\nRFC 141                   Comments on RFC 141                 April 1971\n\n\n   7.  When requesting execute, the using host sends parameters upon\n   receipt of the rr response.  Executing a task can be implemented in\n   several ways.  The options our 360 affords are RJE at job level and\n   the attach macro.  Our preference would be the attach macro which\n   immediately initiates an independent OS task within the partition of\n   the program issuing the attach (presumably the File Service).  Such a\n   task normally receives parameters upon initiation and can thereafter\n   receive parameters from a program via some mechanism such as an event\n   control block.  The second method requires special modifications to\n   the program being executed; hence, it is not desirable.  Therefore,\n   we either need the parameters included in the execute command or will\n   not actually start execution until parameters are received.\n\n   8.  Upon abnormal termination, one should include part or all of the\n   spurious request as well as an identify- ing code to facilitate\n   precise error recognition.\n\n   9.  We would be interested in the outcome of the MIT/ Harvard\n   experiments with the RFC #114 protocol.  What were the pitfalls,\n   etc.?\n\n\n\n         [ This RFC was put into machine readable form for entry ]\n          [ into the online RFC archives by Simone Demmel 4/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHarslem \u0026 Haefner                                               [Page 2]\n\f\n"
}