{
  "series": "Request for Comments",
  "number": "212",
  "howpublished": "RFC 212",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0212",
  "url": "https://www.rfc-editor.org/info/rfc212",
  "title": "NWG meeting on network usage",
  "pagetotal": "2",
  "year": "1971",
  "month": "aug",
  "body": "\n\n\n\n\n\nNetwork Working Group                             NWG Steering Committee\nRequest For Comments: 212                                August 23, 1971\nNIC 7192\nUpdates: 207\n\n\n                      NWG Meeting On Network Usage\n\n\n     M.I.T.'s Project MAC has agreed to host the next Network Working\nGroup Meeting in Cambridge, Massachusetts.  Due to several scheduling\nconflicts, the meeting dates indicated in RFC #207 have been moved\nahead two weeks.  Therefore, the meeting is scheduled to commence on\nSunday, October 10 at 12 noon and is scheduled to adjourn on Thursday,\nOctober 14.\n\n     Prior to the time, the NWG has been almost entirely concerned\nwith issues of communications and protocol implementation.  However,\nwe are now in a transitional phase; implementation efforts have been\nsubstantially completed and usage of the Network has emerged as a\nprimary concern.  Consequently, the theme of this Network Working\nGroup Meeting is Network usage.\n\n     The meeting will provide an opportunity to 1) demonstrate current\ncapabilities of host systems, 2) identify areas of application, 3)\naddress issues concerning users and service centers, 4) provide\nupdated information on status and recent developments.\n\n     There will be three sequential phases to the meeting as indicated\nin RFC #207.  The first phase, the system programmers workshop, will\ncommence on Sunday, October 10 at 12 noon and continue through Monday,\nOctober 11.\n\n     The second phase will begin on Tuesday, October 12 at 9:30 a.m.\nIn addition to any workshops that may be organized the following\nactivities are scheduled:\n\n     a)  A Protocol review - this session will be jointly\n         chaired by John Postel (UCLA) and Alex McKenzie (BBN)\n         and is open to concerned and knowledgeable persons.\n         The session is intended to review current standard\n         protocols.\n\n     b)  A course in NIC usage - this session will be a tutorial\n         in the use of the NIC.  The size of the group is\n         limited by the number of available consoles.  To\n         register, contact Dick Watson at SRI, (415) 326-6200.\n\n\n\n\n                                                                [Page 1]\n\f\n     c)  TIP Users - this session will be devoted to a\n         presentation of the characteristics of a Terminal\n         Interface MessAge Processor (TIP) and the use of a\n         TIP for accessing remote services.  There will also\n         be a discussion period.  The session will be conducted\n         by BBN and is open to interested participants.\n\n     The third phase will begin on Wednesday, October 14.  Wednesday's\nsession will consist of reports on status and recent developments.  In\nthe morning the following developments will be reported -- the outcome\nof the system programmers workshop, results of the Protocol review,\nspecifications for Network on-line co-operative interaction, NIC\nphilosophy, status report on user level Protocol development.  The\nafternoon will highlight the status of the ILLIAC IV development,\nTENEX development, Data Computer development and current activities in\nNetwork Climate Dynamics.  The session will conclude with a discussion\nof Network Management.\n\n     On Thursday morning representatives of Network service centers\nand user groups will hold a round table discussion on access to\nservice centers via the Network.  This discussion will be open to the\npublic and audience participation will be invited.\n\n     Cocktails and dinner are planned for Wednesday evening beginning\nat 5:30 p.m.\n\n     More information on the October NWG meeting along with a schedule\nlisting workshop meeting times and rooms will be available at a later\ndate.\n\n     All NWG meeting attendees should register for the meeting by\ncalling Anne Speare at (617) 864-6900 x1458.  A block of rooms has\nbeen reserved at the Hotel Sonesta in Cambridge, Massachusetts.\nMeeting attendees can obtain a reservation at the Hotel Sonesta from\nAnne Speare.  The rooms will be allocated on a first come first served\nbasis.\n\nS. Crocker\nJ. Heafner\nR. Kahn\nJ. Melvin\nA. Vezza\n\n\n       [ This RFC was put into machine readable form for entry ]\n          [ into the online RFC archives by John Colton 6/97 ]\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}