{
  "series": "Request for Comments",
  "number": "436",
  "howpublished": "RFC 436",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0436",
  "url": "https://www.rfc-editor.org/info/rfc436",
  "title": "Announcement of RJS at UCSB",
  "pagetotal": "1",
  "year": "1973",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                                   Mark Krilanovich\nRFC #436                                                UCSB\nNIC #13700                                              Jan. 10 1973\n\n                      Announcement of RJS at UCSB\n\n    There now is resident under socket 5 at UCSB a server program which\nsupports a subset of the Remote Job Entry Protocol of RFC #407.  This\ndocument includes enough information to allow the user to gain access\nto, and use the more basic function of UCSB's RJS.  An RFC containing\nmore detailed documentation will be forthcoming shortly.\n\n    The accounting parameters needed to login to RJS are a userid and a\npassword, each consisting of one to eight alphameric characters, the\nfirst of which must be alphabetic.  The userid is, at present,\ncompletely arbitrary.  The password is arbitrary the first time it is\nused with a particular userid; in subsequent logins with that userid,\nthe same password must appear.  Eventually, users will be assigned\nuserid-password pairs by UCSB Computer Center.\n\n    The only transmission mode supported currently is T (TELNET-like\ncarriage control); any other is treated as T.  The other modes will soon\nbe added.  The only disposition supported is the default transmit-and-\ndiscard; any other is treated as transmit-and discard.  The other\ndispositions may or may not be added later.\n\n    For consistency and user convenience, the command 'INUSER' may be\nsubstituted for 'INID' and 'OUTPATH' for 'OUT'.  The following commands\nare not as yet implemented: ABORT, ALTER, BACK, HOLD, OP RECOVER,\nRESTART, AND SKIP.  At least some of these will be implemented\nrelatively soon.\n\n    In order to accommodate users of TENEX FTP servers, the commands\n'INACCT' and 'OUTACCT' have been added.  These are used to set the\naccount number used in the file retrieval and storage operations,\nrespectively.  The command 'ACCT' may be used to get both account\nnumbers.  If one of these account numbers has not been specified, the\nFTP 'ACCT' command will be omitted from the appropriate file operation.\nThese commands have the familiar syntax of \u003ccommand verb\u003e followed by\n\u003cspace\u003e or optionally '-', followed by \u003cparameter\u003e and \u003cCR\u003e \u003cLF\u003e.  The\n\u003coperand\u003e is an account number consisting of one to six alphameric\ncharacters.\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\nKrilanovich                                                     [Page 1]\n\f\n"
}