{
  "series": "Request for Comments",
  "number": "274",
  "howpublished": "RFC 274",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0274",
  "url": "https://www.rfc-editor.org/info/rfc274",
  "title": "Establishing a local guide for network usage",
  "pagetotal": "5",
  "year": "1971",
  "month": "nov",
  "body": "\n\n\n\n\n\nNETWORK WORKING GROUP                                E. FORMAN\nREQUEST FOR COMMENTS # 274                           MITRE\nNIC # 7901                                           1 November 1971\nCATEGORIES  F, G\nUPDATES:    NONE\nOBSOLETES:  NONE\n\n\n              ESTABLISHING A LOCAL GUIDE FOR NETWORK USAGE\n\n\n     Actual experiences and experimentation with network systems and\nsubsystems will be an important supplement to existing NIC\ndocumentation.  For this reason, MITRE, to facilitate local user\naccess to network resources, is planning to establish a local GUIDE TO\nNETWORK USAGE to supplement the Resources Notebook and other NIC\ndocumentation.  The Guide will be tailored to the needs of MITRE users\nand will contain information on network systems and subsystems.  (We\ncannot precisely define systems and subsystems at this time but as an\nexample of what we have in mind, TENNEX at SRI is a system and NLS is\na subsystem.)\n\n     The Guide will be implemented under NLS in much the same fashion\nas the NIC LOCATOR SYSTEM.  Information gathered that is appropriate\nfor the NIC but not yet included will be submitted for inclusion in\nthe NIC.\n\n     Attached is an outline of the proposed NLS files for the Guide\nSystem.  The information included in the Guide will be sufficiently\ndetailed to enable local users who are unfamiliar with the network,\nits terminology, and stores of reference material to utilize resources\nat foreign hosts via the network.\n\n     Sites will be included in the Guide as local users gain\nexperience with systems and subsystems located at the remote sites.\nTherefore, the sites most likely to be in the Guide will be those that\ncan be used to support MITRE projects.\n\n     We are planning to coordinate our efforts in this undertaking\nwith a similar effort at the National Bureau of Standards.  We believe\nthat such endeavors will result in valuable contributions to the NIC,\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nparticularly to the Network Resources Notebook.  Although the Guide\nwill be tailored for MITRE users, it will contain information of\ngeneral interest to other network users and will be made accessible to\nthem through NLS.\n\n     The Guide should become operational during December 1971.  Any\ncomments on proposed contents of the Guide are welcome.  Anyone\nwishing to cooperate in this effort should contact E. Forman at MITRE.\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nATTACHMENT\n\n\n     An NLS \"Site File\" will be built for each site at which a\nresource is presently available to network users at MITRE.  Initial\nfiles will be for those sites that offer resources that are of\nspecific interest to the local community.  A RESOURCE LOCATOR FILE\nwill contain a table of contents of the SITE FILES and a list of the\nsubsystems surveyed for each of these sites.  The headings in the\ntable of contents will contain links to the corresponding online site\nfile documents.\n\n\n\n\u003cMITRE\u003e RESOURCE-LOCATOR\n\n  O         Output processor directives\n\n  1         Text indicating how to use this file\n\n  2         Site identification\n               (Link)\n     2A     Subsystem list (with links)\n\n  3         Next site\n\n  4         Next site\n\n    ...\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n\u003cMITRE\u003e SITE-FILE (one for each site)\n\n  O         Output processor directives\n\n  1         Text indicating how to use this file\n\n  2         Subsystem list (with links)\n\n  3         Periods of system availability\n  4         Accounts\n  4         Accounts\n     4A        List of accounts at site established by MITRE personnel\n       4A1     For each account indicate:\n               -  users\n               -  who is allowed to use this account\n               -  restrictions on use of system or subsystem with\n                  with this account\n               -  who to ask for password and ID (if the account\n                  is open to use by all, list password and allowable\n                  ID's)\n       4A2     Next account\n     4B        How to establish a new account\n\n  5         System charges (special subsystem charges--if any--\n            will be listed with subsystem entry)\n\n  6         System Documentation\n     6A        Title\n               -  Brief description\n               -  NIC reference number\n               -  link\n               -  on hand at local station\n               -  local users who have copy\n               -  where to order\n\n  7         Log in procedures (special log in procedures for sub-\n            systems (if any) will be listed with the subsystem entry)\n\n  8         Special considerations when used with the following\n            local (network user) equipment:\n     8A        With devices -----, -----\n               -  NIC reference numbers\n               -  links\n               -  list of special considerations when used with this\n                  system (e.g., special characteristics, half or\n                  full duplex)\n     8B        With devices\n    ...\n\n\n\n                                                                [Page 4]\n\f\n\u003cMITRE\u003e SITE-FILE (continued)\n\n  9         Comments on system usage and performance such as\n            reliability, availability, recent user experience,\n            bugs, differences from documentation (similar to NIC\n            Journal Folklore)\n\n 10         Subsystem \" \"\n    10A       Brief capability description\n              References and links\n    10B       Subsystem documentation\n     10B1       Title\n                -  brief description\n                NIC reference number\n                -  link\n                -  on hand at local station?\n                -  local users who have copy\n                -  where to order\n     10B2       Next document\n\n    10C       Periods of availability--same as system or list\n              special subsystem availability times\n    10D       Special subsystem charges if any\n    10E       Log in procedures-if special log in procedure needed\n              for subsystem\n    10F       Special considerations when used with the following\n              local (network user) equipment:\n     10F1       With devices -----, -----\n                  -  NIC reference numbers\n                  -  links\n                  -  list of special considerations when used with\n                     this subsystem (e.g., special characteristics,\n                     half or full duplex)\n     10F2       With devices -----, -----\n    ...\n\n    10G       Comments on subsystem usage and performance such as\n              reliability, availability, recent user experience, bugs,\n              differences from documentation (similar to NIC\n              Journal Folklore)\n\n 11           Subsystem \" \"\n    ...\n\n\n\n\n\n\n\n\n                                                                [Page 5]\n\f\n"
}