{
  "series": "Request for Comments",
  "number": "372",
  "howpublished": "RFC 372",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0372",
  "url": "https://www.rfc-editor.org/info/rfc372",
  "title": "Notes on a Conversation with Bob Kahn on the ICCC",
  "pagetotal": "4",
  "year": "1972",
  "month": "jul",
  "body": "\n\n\n\n\n\nNWG/RFC #372                                           Richard W. Watson\nNIC 11022                                              (SRI-ARC)\n                                                       12-JUL-72\n\nNOTES ON A CONVERSATION WITH BOB KAHN ON THE ICCC\n\nI called Bob Kahn and had a good chat with him about some aspects\nof the ICCC meeting demonstration.  The points discussed and his\nanswers were the following.\n\nWhat is the physical environment going to be like?\n\n   Bob has arranged for the Georgetown Ballroom of the Hilton\n   Hotel; it has 3000 square feet probably about 75x40 (exact\n   dimensions are not known to Bob at this time).\n\n   A carpeted false floor is to be installed and there will be\n   a partition for an area to show a movie on resource sharing\n   which will run more or less continuously.\n\n   There will not be booths in the normal sense but details\n   are not yet worked out.  Bob expects to have tables\n   arranged around the room holding 1 or 2 terminals and low 4\n   ft. partitions to break up the space.\n\nWho will man the booths?\n\n   Bob presently expects many terminals to be unmanned,\n   although manufcturers could have a sales rep.\n\n   There will probably be people from net sites at some of\n   them from time to time to demonstrate their programs.\n\n   We discussed the need for lots of experts from the network\n   around who can answer questions and help people.  Bob is in\n   favor of such a thing but has not had time yet to pull such\n   a group together and there is some uncertainty if enough\n   people will volunteer, his initial approach to people\n   yielded lots of people interested but with other things to\n   do.\n\nWhen will the equipment be on the floor and available to try\nthere?\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nNWG/RFC# 372                            RWW 12-JUL-72 9:39  11022\nNotes on a Conversation with Bob Kahn on the ICCC\n\nThe conference is tues-thurs oct 24-26 and at the moment\nthe room is only going to be available from the 22nd.  This\nseems to be a short time to install floor, TIP, terminals,\nphone lines, etc and Bob is going to try to get the room\nthe previous Wed or Fri, but doesn't know yet.\n\nBob would like to have working demo with terminals,\nresources at BBN in Aug.\n\nWhat resources are presently committed?\n\n   UCLA Klinerock will have some network measurement stuff to\n   demonstrate.\n\n   Stanford AI has indicated they will have some programs to\n   demone.\n\n   Utah Tony Hearn will have his Reduce program to demo, Berry\n   Wessler plans to demo something, Harvey Greenfield has some\n   sort of mdical program.\n\n   RAND before recent sakeup indicated iterest, status now not\n   known.\n\n   SDC will have some natural language programs and their\n   data management systems.\n\n   MIT Vezza and Kahn are looking into having some hardcopy\n   device such as Photon attached to a GE TS system.  Al has\n   some other things to demo.\n\n   Bob has contacted a number of non net sources such as the\n   NY Times (data base), Eastern Airlines etc., but has no\n   definite commitments yet.\n\n   We at ARC will of course have a number of things to\n   demonstrate.\n\nThis ARPANET demo is the only show at the conference.  Larry\nRoberts has invited the ASIS people over for Thurs afternoon.\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nNWG/RFC# 372                            RWW 12-JUL-72 9:39  11022\nNotes on a Conversation with Bob Kahn on the ICCC\n\nThe TIP has at this time never been tested with 64 terminals,\nbut they are going to be putting as many terminal on as\npossible during July and testing the terminal to be supplied\nford the conference.\n\nStarting about AUg 1 he expects to start testing to see what\nterminals work with what resources and what glitches exist.\n\nI asked Bob if we could have enough space for a ARC NIC booth\nwith an IMLAC TI and room for people to watch our demo's.  Bob\nsaw no problem there; IMLAC has committed 2 terminals and we\ncan have one.  TI has not indicated they plan to loan terminal\nfor the show.  Hiram French is the man from IMLAC who is\nsupposed to call us.  If there are more than 64 terminal or\nthe TIP can't support all, then they will have to schedule\nterminal connections to the TIP.\n\nBob is not sure who will be at the conference, its theme is\nnetworks and their impact on soceity, implications for\nregulation etc. so ther should be a broad spectrum of people;\nwill send me a program.\n\nWe talked about what kind of documentation help, signs etc\nwill be around to help people connect and use resources and\ngenerally understand wha the deomo is allabout.\n\n   Bob's present picture is some large 2x3 signs in the lobby\n   outside the main lecture room directing people to the demo\n   and then some signs inside explaining what's happening, a\n   card with some TIP commands,resources, a brochure with\n   actual scenerios of resource usage, the movie and some\n   people as the main on the floor sources of help.\n\n   We talked about the need to coordinate all this with NIC\n   documentation and our desire to help design all this.  Bob\n   and I are tentatively planning to get together the weekend\n   of July 7 here to plan this.  We need to have\n   thoughtcthrough ahead of time what we think should be done.\n\nARPA except for Bob does not seem to have set up any budget for\nthis show except what their contractors are essentially willing\nto give as part of their ongoing research, therefore he has a\nvery difficult job of pulling off such a large show without more\nhelp than he seems to have gotten so far (these are my\nconclusions not satements of his).\n\n\n\n                                                                [Page 3]\n\f\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n"
}