{
  "series": "Request for Comments",
  "number": "140",
  "howpublished": "RFC 140",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0140",
  "url": "https://www.rfc-editor.org/info/rfc140",
  "title": "Agenda for the May NWG meeting",
  "pagetotal": "4",
  "year": "1971",
  "month": "may",
  "body": "\n\n\n\n\n\nNWG                                                Steve Crocker\nRFC - 140                                          UCLA\nNIC - 6725                                         4 May 71\n\n\n                     AGENDA FOR THE MAY NWG MEETING\n                     ------------------------------\n\n    The NWG meeting will be from 8 p.m., Sunday, May 16 through\nWednesday evening May 19.  All meetings except Sunday night will take\nplace in the Wicker Room of the Dennis Hotel.  The Sunday even- ing\nmeeting will take place in the Royal Box Room of the Dennis Hotel.\nEvening meetings will start at 8 p.m.  Afternoon meetings at 1:30 p.m.\nand morning meetings at 9 a.m.  We will meet Sunday evening, all day\nMonday (three sessions), Tuesday morning and evening and Wednesday\nevening.  At times when we are not meeting you are invited to use the\nWicker Room for private meetings or whatever.  It is reserved thru\nThursday afternoon.\n\n    Below are the topics to be discussed in each meeting and the list\nof relevant RFC numbers which should be read prior to coming.\n\n\nTIME: Sunday evening\nTITLE: Short Reports                         (RFC's 113, 131, 134)\n\nEach host will give a very short -- five minutes or less -- report on\ntheir state of development, including hardware, NCP and Telnet and\nincluding any applications in progress or planned.  In addition, the\ncommittees will summarize their progress and new sites will introduce\nthemselves.  More extended committee reports and discussions will take\nplace later.\n\n\nTIME: Monday morning\nTITLE: NIC and Telnet                        (RFC's 103, 106, 112, 109,\n                                              110, 115, 118, 137, 139)\n\nAt 9:00 a.m. Dick Watson will talk about the status, plans and policies\nof the NIC.\n\nAt 10:00 a.m. Tom O'Sullivan will present the Telnet committee's\nproposed protocol and lead a discussion concerning it.\n\n\nTIME: Monday afternoon\nTITLE: File Transfer, TIP, Network Planning   (RFC's 114, 122, 133, 136)\n       and other ARPA Projects\n\n\n\n                                                                [Page 1]\n\f\n1) Abhai Bhushan of MAC and Jim White of UCSB will discuss their file\ntransfer protocols.\n\n2) BBN representatives will talk about the TIP, including\nspecifications, delivery schedules, prices and protocols.\n\n3) Bob Kahn and Larry Roberts will talk about several aspects of the\nNetwork management and the long-range network planning.  This will be an\nopportunity for questions on who will manage the Network, how it will\ngrow and what sites will come on to be directly addressed to Larry.\n\n4) Some other projects are in progress which affect many of the ARPA\nsites and are not centered in any particular site.  These include\nefforts to produce a list-processing system and a speech understanding\nsystem.\n\n\nTIME: Monday evening\nTITLE: Operating Systems and Networks\n\nThe protocols being developed in the Network Working Group are similar\nto interprocesses communication facilities within operating systems.  It\nis not fully understood how these protocols should be built, and what\nthe tradeoffs are for alternatives; the same can be said for\ninterprocess communication facilities in operating systems.  From time\nto time it is suggested that there would be some payoff in studying\nthese matters from an academic point of view, not quite so tied to the\npressure of producing a particular system.\n\nProfessor Art J. Bernstein of SUNY Stonybrook writes:\n\n     \"The problem of designing an operating system for a computer which\n     is to be imbedded in a network has received little attention.  In\n     addition to providing those capabilities one normally expects from\n     an advanced multi-programmed system such as file sharing, inter-\n     process communication and a hierarchical process structure, such a\n     system should be structured so that, as nearly as possible, a user\n     process is ig- norant of the actual location in the network of the\n     files and processes with which it is interacting.\"\n\nHe is building an operating system for a PDP-15 based on this philosophy\nand will come to make a short presentation on his system, after which we\nwill discuss how to organize interaction among various academic efforts,\nincluding those not within the ARPA community.\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nTIME: Tuesday morning\nTITLE: Data of Reconfiguration Service and    (RFC's 138 and one yet to come\n       Data Management Systems                 by Shoshani)\n\nAt 9:00 a.m. John Heafner of RAND will meet with his committee and\ndiscuss some of the open issues regarding the proposed data\nreconfiguration service.  This meeting is open to other interested\nparties.\n\nAt 10:00 a.m. Arie Shoshani of SDC will chair a meeting on data sharing\non computer networks.  He writes:\n\n     \"The main purpose of the meeting is to discuss the subject of\n     sharing data on Computer Networks.  First, an intro- ductory paper\n     will be presented which will attempt to classify the issues\n     involved, discuss some approaches that one can take to achieve data\n     sharing and to point out some ad- vantages and disadvantages of\n     these approaches.  Then, an open discussion will be conducted.  As\n     a result, recommenda- tions will be attempted as to what approach\n     is best for the ARPA-Network, and possibly set up a commitee of\n     interested people to further investigate the problems.  It is\n     expected that participants will be prepared to discuss briefly data\n     management system they have or plan to have on the ARPA network.\"\n\nPeggy Karp of MITRE will attend and talk about the data management\nsystem she is building to use facilities at BBN and UCSB.\n\n\nTIME: Tuesday evening\nTITLE: Remaining Technical Matters        (RFC's 107, 117, 123, 124, 127\n                                           128, 129 and 132)\n\nThe issues scheduled for this meeting are discussions of the socket\nnumbers, procedures for testing NCP's and Telnets, discussion of ways to\nexperiment with protocol, the initial connection protocol and remaining\nglitches in the second level protocol.\n\n\nTIME: Wednesday evening\nTITLE: Non-Technical Matters              (RFC 113)\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\nThe Network Working Group has grown and changed considerably in the last\ntwo years.  It now represents a strong voice in network planning but is\nperhaps not optimally organized for technical work. At this meeting we\nwill consider what we expect to happen by the end of 1971, what steps\nshould be taken to achieve this and, in particular, how the Network\nWorking Groups should be organized and managed.\n\n\n       [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Gert Doering 4/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n"
}