{
  "series": "Request for Comments",
  "number": "331",
  "howpublished": "RFC 331",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0331",
  "url": "https://www.rfc-editor.org/info/rfc331",
  "title": "IMP System Change Notification",
  "pagetotal": "1",
  "year": "1972",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                              J. McQuillan\nRFC #331                                           BBN-NET\nNIC #9924                                          19 April 1972\nCategory:  B.1\n\n                     IMP System Change Notification\n\n     We are planning to release IMPSYS 2600 on May 15, 1972, be- tween\n12 noon and 3 p.m. E.D.T.  As discussed at the March 16 seminar held\nat BBN, this release constitutes a major change to the IMP program.\nBecause of the magnitude of the change, the system will be released on\nan experimental basis.  If problems develop, then the current system,\nIMPSYS 2514, will be reloaded and the cutover for IMPSYS 2600 will be\nrescheduled for some later time.\n\n     The actual transfer over to IMPSYS 2600 will require assis- tance\nfrom site personnel, and we hereby request this assistance.  A new\ntape of IMPLOD 2600 will be mailed to all sites shortly, and the staff\nat BBN will request each site in turn on May 15 to load the new IMPLOD\ntape and will detail other procedures to follow thereafter.  We prefer\nthat each site have someone who is familiar with IMP system operation\non hand at this time.  At some sites, we may request additional\nassistance from the computer operations staffs or programmers in the\ncase of any problems.  We also advise site personnel to refrain from\nscheduling produc- tion over the Network during the hours of\nswitchover, since unforeseen difficulties may arise.\n\n     It is anticipated that the Hosts will not see any first- order\neffects from the switchover.  Leader formats and message types are not\nchanged.  On the other hand, the statistics package has been\nextensively modified, and the NMC has been notified of these changes.\nThe Very Distant Host option will also be included in this new system\nrelease, and it is expected to be activated for use about June 1.  The\ndetailed changes to the IMP system will be described in a forthcoming\nrevision to BBN Report 1822.\n\n     Finally, your patience is requested if the new system causes\nunforeseen problems.\n\n\nJMcQ/jm\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}