{
  "series": "Request for Comments",
  "number": "472",
  "howpublished": "RFC 472",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0472",
  "url": "https://www.rfc-editor.org/info/rfc472",
  "title": "Illinois' reply to Maxwell's request for graphics information (NIC 14925)",
  "pagetotal": "2",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        Steve Bunch\nRFC # 472                                                    ILL-ANTS\nNIC # 14801                                                  March, 1973\n\n\n    Illinois' reply to Maxwell's Request for Graphics Information,\n                          NIC Document 14925.\n\n\nThis is a reply to Craig Maxwell's (UCLA-NMC) \"Request for graphics\ninformation\" of 3/7/73.  Further details can be obtained by contacting\nme directly.\n\nTo date, our work in graphics has been primarily centered about support\nfor several applications groups.  To make the generation of beam-\noriented graphics as painless as possible for these groups, our policy\nfor supporting this type of graphics has been to emulate as closely as\npossible the CALCOMP plotter support package on the host machine, but\nwith NGP0 output.  (Presently, before the resulting NGP can be sent to\nsome of our peripherals, e.g., Gould 4800, it must be converted to\ndevice specifics.  With the advent of ANTS MARK II and a PDP-11/45, all\nconversions will be handled locally, so all graphics flowing into our\nsystem will be NGP).  We find this approach very labor-saving, even at\nthe present slightly kludgey level.\n\nWe also have some grey-scale work taking place on our GOULD and IMLAC.\nOne group is processing satellite pictures on Illiac and will soon need\ngrey-scale output, another is producing natural-resource maps, and a\nthird is generating holograms.  No standardization plans have been made\nfor grey scale work, but if an acceptable standard is established, we\nwill most likely use it.\n\nA small group, including myself, is currently planning an interactive\ngraphics system.  The system will use multiple hosts, possibly using a\nremote E\u0026S machine for rotation, scaling, etc.  We have a number of\nlarge hurdles that have to be jumped before we can do anything, though.\nSeveral of these are not graphics-specific, such as process-controlled\nFTP, inter-process coordination among hosts, and others.  We had\nintended to let efficiency dictate the format of intermediate results\nshipped via the Net, with standardization being applied where it is\nhelpful for minimizing effort.  Since the system will be highly\ninteractive and will also manipulate grey-scale data, we will need a\nhigher level of graphics protocol to handle the user interface.  A\n\"proto-prototype\" system is being used now to do some simple\nmanipulations of meteorological data (e.g., contouring, 3-D plotting)\n\n\n\n\n\n\nBunch                                                           [Page 1]\n\f\nRFC 472        Reply to Request for Graphics Information      March 1973\n\n\nwith an IMLAC passively displaying the NGP0 pictures created.  Soon, I\nhope to finish an IMLAC program that will handle some interaction with\nthe mouse/keyset.  I have decided to implement the following (outgoing)\ncommands.\n\n    MOVE  beam to mouse position\n\n    DRAW  from last to present beam position.\n\n    TEXT  at present beam position.\n\n    UNDO  the last command (to facilitate freehand drawing and\n          backspacing in TEXT).\n\nOther commands may be implemented as needed to do what people want to\ndo, at least until an adequate interaction standard comes along.\n\nNote that there is implicit in the UNDO command the assumption that\nthe other end of the line possesses a certain amount of memory and\nintelligence.  Two possible philosophies for standardizing interaction\nare that (1) all \"nodes\" (\"generators\" or \"users\" of data) understand\nsome set of commands and possess at least a certain amount of\nintelligence, and (2) a distinction is made between \"displays\" and\n\"computers\" (quotes because the line is fuzzy).  I favor the first for\nits generality, but I suggest that the lowest level of interactive\ngraphics might want to use the second for ease of implementation with\nunintelligent devices, e.g., COMPUTEK 400's.  (I do not mean to\nimply in (1) that the actual \"computer\" would not have a larger\nvocabulary than the actual \"display\" --this is inevitable with higher\nlevel capabilities in the protocol).\n\nSince we have almost no local computing power for applications work,\nall our graphics computation is done remotely (our work has been\nprimarily at UCSD (B6700), USC-ISI (TENEX), and UCLA-CCN (360)).\nBecause we do our work at scattered sites and are basically economic\nof labor (pronounced \"lazy\"), we have a lot to gain by standards and\nwill be glad to cooperate as much as possible with standardization\nefforts.\n\nSteve Bunch\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\nBunch                                                           [Page 2]\n\f\n"
}