{
  "series": "Request for Comments",
  "number": "421",
  "howpublished": "RFC 421",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0421",
  "url": "https://www.rfc-editor.org/info/rfc421",
  "title": "Software Consulting Service for Network Users",
  "pagetotal": "2",
  "year": "1972",
  "month": "nov",
  "body": "NETWORK WORKING GROUP                           Alexander McKenzie(BBN)\nRequest For Comments #421                       27-NOV-72\nNIC #12897\n\n            A SOFTWARE CONSULTING SERVICE FOR NETWORK USERS\n\n     As actual or attempted Network use has grown, it has become\nincreasingly apparent that users with real problems to solve are not\nafforded the kinds of software assistance and consulting services\nnormally provided by computer service facilities. Two mechanisms which\nwere designed to help fill the void in the past are the Resources\nNotebook and the designation of Techincal Liaisons. Unfortunately, the\nResources Notebook tends to have a long undate cycle, and Technical\nLiaisons are frequently systems programmers who may work at odd hours\nand are sometimes impatient with the questions of naive users.\n\n     In an attempt to deal with this problem in a more satisfactory way,\nBBN recently aided a \"software consultant\", Nancy Neigus, to the\nNetwortk Control Center staff. Nancy has extensive software experience\non a number of systems, and has spent the last few months familiarizing\nwith server systems and subsystems via the network.\n\n     This consulting service is experimental in nature, and as such its\nlimits, even its continued existance, will be influenced by the\nexpressed needs of the user community. Altough the primary goal is for\nNancy to provide assistan ce in using existing resources, we do not\n(currently) exclude the possibility of her participation in such\nprojects as the checkout of protocol implementations and resolution of\nany discovered conflicts. In some cases, it may turn out that successful\nnetwork operation of a subsystem requires changes to Host software; we\nwill attempt to act as a repository and dispatch point of reported\ndifficulties of its kind.\n\n        Nancy can be contacted via the Network Control Center\ntelephone:\n        (617) 611-0100\nCollect calls will be accepted. She will normally be available between\n9am and 5pm (Eastern Time) weekdays, but the NCC has round-the-clock\noperator coverage and the operators will take messages for her at\nother times. Online messages may also be left at the NIC for \"NJN\",\nor, for TIP users, vis the \"Gripe\" service (see TIP news).\n\n        Please inform users at your site of the this software\nconsulting service, and encourage them to try it.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Chakravarthy Paila 4/97]\n\n\n\n\n\n\n\n\n\n\n\n\n\n"
}