{
  "series": "Request for Comments",
  "number": "146",
  "howpublished": "RFC 146",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0146",
  "url": "https://www.rfc-editor.org/info/rfc146",
  "title": "Views on issues relevant to data sharing on computer networks",
  "pagetotal": "6",
  "year": "1971",
  "month": "may",
  "body": "\n\n\n\n\n\nNetwork Working, Group                                P.M. Karp, MITRE\nRequest for Comments #146                             D.B. McKay, IBM\nNIC 6742                                              D.C. Wood, MITRE\n                                                      12 May 1971\n\nCategories: D.4, D.7\nObsoletes: none\nUpdates: none\n\n\n                Views on Issues Relevant to Data Sharing\n                          on Computer Networks\n\n\nIntroduction\n\nThe formation of a committee to address the problems of achieving\ndata sharing on the ARPA Network, as suggested by Arie Shoshani\n(RFC #140) is desirable at this point of network development.  We\nconcur with Shoshani's ideas (presented in an introductory paper\nto the network data sharing meeting, scheduled for Tuesday, May 18)\nand believe that purpose of the committee should be -\n\n        a) to classify the issues involved and to propose various\n           approaches;\n\n        b) to integrate the hitherto independent network activities\n           that address problems in the area of data sharing, and;\n\n        c) to set up and coordinate appropriate experiments to test\n           the services developed and to evaluate alternative\n           approaches.\n\nThis position paper is intended to augment Shoshani's as a basis\nfor discussion at the data sharing meeting. No attempt is made\nto discuss specific means of implementation since many approaches\nto data handling problems are possible and have been proposed.\nRather, our viewpoint on what the committee's role should be in\ngiving some cohesion to various existing implementations is\npresented.\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nOur Views\n\n    One approach to achieving data sharing on the ARPA Network can\nbe thought of as having three stages, which roughly correspond to\nthe modes of use or operation. Within each stage are various levels\nof development required to get to the next stage. This development\nis not necessarily sequential. A description of the three stages\nfollows.\n\nStage 1: Data handling services are provided at various Hosts.\n         The user talks directly to the serving Host (via TELNET\n         or by addressing a known socket) to explicitly access\n         the service.  This mode of operation corresponds to\n         Bhushan's category of \"direct\" usage (RFC #114).  The\n         data services provided by the serving Host range from\n         simple ones, such as White's file transfer system (RFC #122)\n         to sophisticated systems such as the CCA's data machine\n         (NIC 5791 and 6706).\n\nStage 2: The user has access to an intermediate process or data\n         control facility* that routes his requests for a particular\n         data service to the serving system. The user must explicitly\n         identify the data services to the used.  This mode of\n         operation corresponds to Bhushan's category of \"indirect\"\n         access. The data control facility provides the necessary\n         control commands, data transformations, and accessing\n         methods. A single request would include the use of several\n         interacting services. For example, Heafner's Data\n         Reconfiguration Service (RFC #l38) could be used in\n         conjunction with the use of CCA's data machine.\n\n\n\n\n\n\n_______________\n*The data control facility is not necessarily located at his local\nHost. Such a facility may exist on from one to all Host (i.e.,\nranging from centralized to completely distributed).\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\nStage 3: The user treats the network as a single resource and is\n         unconcerned with the location of the services, data files,\n         etc. All references are by name. In this mode of opera-\n         tion, the data control facility can function as a referral\n         center for data service requests by using the most ap-\n         propriate data service available and by automatically\n         combining the use of several services that may be needed\n         to satisfy a request.  For example, data could be retrieved\n         from several files, each managed by a different data\n         management system. The data control facility must be\n         cognizant of the location of data files, their structure,\n         data management system capabilities, etc.\n\nSome approaches to the design of the data control facility have\nbeen suggested by Shoshani, notably the integrated data management\nsystem (IDMS) and the unified data management system (UDMS). The\nnotion of the network machine (RFC #51) is closest to the capabilities\none would see in Stage 3.\n\nRelevant Areas of Development\n\nThe data control facility can range anywhere from a simple inter-\nface to an intelligent front-end processor to a network-wide re-\nferral system.  In any case, a common means is desirable for\nhandling applications such as file transfer, on-line update and\nretrieval of data, information gathering and reporting, and program\naccess to data. To attain this end, a few of the areas in which\ndevelopments will be required include:\n\n     a)  a data description language, permitting the user to define\n         the physical structure of files, to define logical files,\n         and to categorize data fields for name referencing. The\n         language should be designed to facilitate the resolution of\n         physical discrepancies in data and file structures. The\n         user should be able to superimpose logical restructuring of\n         data without any change in the physical structure.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\nb) a control or access language that can be mapped into\n         various data management languages. Considered here is\n         Shoshani's suggested two-level approach with perhaps a\n         meta-language implementation to facilitate conversions\n         among already existing languages.\n\n     c)  methods for managing and merging distributed data, search\n         mechanisms for file directories, error recovery techniques,\n         etc.\n\nIndependent ARPA Network activities that in effect constitute\nStage 1 have touched on these areas and should be incorporated into\nthe overall data sharing scheme such that all of the isolated\npieces are compatible.  For example,\n\n      a) the data reconfiguration service (RFC #138) would be\ninvoked by the data control facility whenever data transformations\nare required.\n\n      b) the file transfer protocol (RFC #114, #122)\nshould be consistent with other data handling services.\n\n      c) CCA's data machine should be a subset or part of any data\ncontrol facility. The network data language and set of data\nmanagement services that they plan to implement can perhaps be\nadopted network-wide.\n\n      d) the network machine concept (RFC #51) for defining the pro-\ngram and data environments should be resurrected. The data control\nfacility should be a subset of a network machine architecture.\n\nSome other relevant topics include NIL (RFC #51), DEL (RFC 5), the\nnotion Of MYLOCAL n, YOUR LOCAL n, and STANDARD n (RFC #42), user\nlevel protocol objectives as described in RFC #76 and #91.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\nExperimentation and Testing\n---------------------------\n\nAs data services are developed on the network, a coordinated\neffort is desirable\n\n     a)  to exercise individual implementations to see\n         if they work, both alone and in conjunction with\n         other data services, and\n\n     b)  to evaluate alternative approaches.\n\nSome examples of experimentation to test data services follow:\n\n     1.  File Transfer Protocol\n\n         The file transfer protocol should be used to\n         manipulate data files controlled by various\n         systems.\n\n     2.  Data Transfer to Data Computer\n\n         The ability to transfer existing data bases and\n         their structures onto the data computer should be\n         demonstrated.\n\n     3.  Data Restructuring\n\n         The ability to define logical restructuring of\n         data for users needs which would be accessible by\n         name should be demonstrated. The original physical\n         structure would be maintained.\n\n     4.  Data Transformation\n\n         The ability to access various data management\n         systems on the network without the user being\n         concerned with the data transformation involved\n         should be demonstrated. Necessary calls to forms\n         available on the Data Reconfiguration Service\n         should be handled automatically and should be\n         transparent to the user.\n\n\n\n\n\n\n\n\n\n                                                                [Page 5]\n\f\n5.  Data Consistency\n\n         Problems of maintaining consistency when duplicate\n         copies of a data file exist and updates to the file\n         are made should be investigated. Automatic use of\n         file transfer protocol and DRS to generate new\n         duplicate copies should be included.\n\n     6.  Data Privacy\n\n         Access controls for privacy Of data files in the\n         network environment should be designed and evaluated.\n         This includes controls on parts of distributed files.\n\nOur recommendation is that the committee on data sharing be\nresponsible for coordinating development in these areas, for\nattempting to maintain consistency among data services, and for\ntesting services in a series of experiments as they are implemented.\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 6]\n\f\n"
}