{
  "series": "Request for Comments",
  "number": "207",
  "howpublished": "RFC 207",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0207",
  "url": "https://www.rfc-editor.org/info/rfc207",
  "title": "September Network Working Group meeting",
  "pagetotal": "2",
  "year": "1971",
  "month": "aug",
  "body": "\n\n\n\n\n\nNetwork Working Groug                           NWG Steering Committee\nRequest For Comments #207                       per A. Vezza\nNIC #7178                                       August 9, 1971\n\n\n               A SEPTEMBER NETWORK WORKING GROUP MEETING\n\n    The next meeting of the Network Working Group will be hosted by\nM.I.T.'s Project MAC in Cambridge, Massachusetts.  The Meeting is\nscheduled to commence at 12 noon on September 26 an is tentatively\nscheduled to adjourn on September 30.  This Network Working Group\nmeeting is structured such that most participants will wish to attend\nonly one or two of the three phases of the meeting.\n\n    The first phase is a system programmers workshop. It commence Sunday\nSeptember 26, and continues through Monday the 27th. System programmers\nshould come prepared too: create a working demonstration of the use of\ntheir host over the Network, discuss host to host protocol\nimplementation, and teach other system programmers how to use their\nsystems.  The Dynamic Modeling/Computer Graphics PDP-10 system will be\nplaced at the disposal of the system programmers workshop, and DMCG\npersonnel will be available to assist in the creation of the\ndemonstrations. System programmers with operational Network capability\nshould plan to attend.\n\n    Those planning to attend the system progammers workshop should\ncontact Bob Metcalfe by leaving a message for him with Anne Speare at\n(617) 864-6900 x1458.\n\n    The second phase of the September meeting, which will begin on\nTuesday the 28th and continue through Wednesday 29th, will be devoted to\nworkshops exploring and discussing issues associated with Network use.\nTentatively, the following five workshops are planned: (1) Network\nclimate research, (2) the Network service centers, (3) the Network NIC,\n(4) Network on-line cooperative interaction, (5) a planning workshop for\nan ICCC (The International Computer Communications Conference to be held\nin Washington, D. C. in October of 1972) session and a demonstration.\n\n    The workshops will be small and intensive. Attendence at a workshop\nis by invitation. How to make an application to a workshop, the scope of\neach workshop, the workshop chairman, and a workshop meeting schedule\nwill be announced on August 16. Persons wishing to make an application\nto form a workshop my do so by contacting Bob Kahn at BBN (617) 491-\n1850) x340, or by leaving a message with his secretary.\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n    The third phase, wich will begin on Thursday September 30, is a\nplenary session open to all Network Working Group members and visitors.\nIts purpose is to present reports on the work- shops an to present some\nprepared reports on Network activities.\n\n    All NWG meeting attendees should register for the meeting by calling\nAnne Speare at (617) 864-6900 x1458. Assistance, for those who need it,\nin procuring a room reservation may be obtained from Anne Speare.\n\n    More to come on August 16, 1971. The Network Steering Committee\nmembers are: S. Crocker, J. Heafner, R. Kahn, J. Melvin, and A. Vezza.\n\n       [ This RFC was put into machine readable form for entry ]\n        [ into the online RFC archives by Gruss Gottfried 6/97 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}