{
  "series": "Request for Comments",
  "number": "251",
  "howpublished": "RFC 251",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0251",
  "url": "https://www.rfc-editor.org/info/rfc251",
  "title": "Weather data",
  "pagetotal": "2",
  "year": "1971",
  "month": "oct",
  "body": "\n\n\n\n\n\nNetwork Working Group                           D. Stern\nRequest for Comment No. 251                     CCA\nNIC No. 7692                                    13 October 1971\nCategory:\nUpdates:  None\nObsoletes:  None\n\n\n\n\n\n\n\n\n\n\n\n\n\n                              WEATHER DATA\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nThe USAF Environmental Technical Applications Center (ETAC) is\nproviding weather data for the ARPA Network.  Ultimately there\nwill be ten years of high quality surface and upper air weather\nobservations, as well as hemispheric grid point analyses.  The\nobservations are generated by approximately 5000 surface and\n1200 upper air stations, distributed all over the world.\n\nThe data is to be available via the datacomputer, a specialized\nnode of the ARPA Network that is dedicated to the management of\nshared data bases and designed to accommodate large ones.  The\ndatacomputer, currently under development by Computer Corporation\nof America (CCA), will provide services* for the use of these\ndata bases, including the weather data.\n\nA working group has been formed to design the data base,\ncoordinate its implementation with the development of the\ndatacomputer, plan testing, project uses, and resolve a variety\nof technical issues associated with its size and complexity.\n\nProspective users, working members, or interested parties should\ncontact:\n\n            Dale H. Stern\n            Computer Corporation of America\n            575 Technology Square\n            Cambridge, Massachusetts 02139\n            617-491-3670\n\n\n\n* See RFC 219\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}