{
  "series": "Request for Comments",
  "number": "321",
  "howpublished": "RFC 321",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0321",
  "url": "https://www.rfc-editor.org/info/rfc321",
  "title": "CBI Networking Activity at MITRE",
  "pagetotal": "13",
  "year": "1972",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                  Peggy M. Karp\nRequest for Comments:  321                             MITRE\nNIC #9608                                              24 March 1972\nRelated RFCs:  313\nCategories: F\n\n\n                    CBI Networking Activity at MITRE\n\n\n     This RFC is in response to Tom O'Sullivan's probe for comments\n\non Computer Based Instruction. MITRE is currently doing some pre-\n\nliminary work in the area,at the present time limited to use of CAI-\n\nrelated network resources.\n\n     The most expedient way for me to respond is by attaching excerpts\n\ntaken from a recent status report prepared for internal MITRE use,\n\nintended for staff not generally familiar with the ARPANET. Comments\n\ndirected at specific items in Tom's attachment will follow in a future\n\nRFC.\n\n     We welcome comments on our activities and would like to partici-\n\npate in any CBI dialogs that take place.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n                       STATUS OF IR\u0026D TASK 9780\n                  ARPA NETWORK STUDIES AND EXPERIMENTS\n\n\n1.0  OBJECTIVES\n\n     MITRE/Washington became a node in the ARPA computer network in\n\nSeptember 1971 when a Terminal Interface Message Processor (TIP) was\n\ninstalled. Since that time MITRE's use of the network has largely\n\nbeen supported by IR\u0026D funds. The objectives of the IR\u0026D Network\n\nStudies are:\n\n     (a)  to promote the use of the network resources in an\n\n          operational mode within MITRE to increase the computer\n\n          capabilities available for supporting sponsor's work;\n\n     (b)  to use the ARPANET itself as a research tool for\n\n          conducting computer networking experiments; and\n\n     (c)  to demonstrate the use of ARPANET resources to extend\n\n          the capabilities of existing systems.\n\n     Specifically, the proposed objectives are:\n\n     (1)  to select ARPANET resources that can be used to support\n\n          identified MITRE projects and to demonstrate how these\n\n          resources can be used;\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n     (2)  to use the ARPANET as a research tool to conduct data\n\n          sharing experiments to study techniques for data handling\n\n          on a computer network; and\n\n     (3)  to demonstrate the feasibility of using remote\n\n          resources on the ARPANET to augment the capabilities\n\n          of the TICCIT* system.\n\n\n\n*The principle use of the TICCIT (Time-Shared Interactive Computer\n Controlled Information Television) system has been for Computer\n Assisted Instruction (CAI). A TICCIT/CAI system is currently being\n developed by MITRE under a National Science Foundation (NSF) grant.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 3]\n\f\n2.0  APPROACH\n\n     The IR\u0026D Network Studies and Experiments project requires soft-\n\nware development on selected ARPANET Host computers and extensive\n\nexercising of network resources. The approach taken to fulfill the\n\nproject objectives involves effort in three areas.\n\n     Task area I is designed to build up ARPANET usage by MITRE.\n\nTask II involves conducting data sharing experiments on the network\n\nutilizing software being built by MITRE at several network sites.\n\nTask III is intended to demonstrate the use of CAI-related network\n\nresources to augment the TICCIT/CAI system.\n\n     The specific activities involved in each task area are discussed\n\nbelow.\n\n2.3  Task III - Demonstrate Extensions to TICCIT System Capabilities\n     ---------------------------------------------------------------\n     That Are Possibly by Drawing on ARPANET Resources\n     -------------------------------------------------\n\n     The structure of the ARPANET is such that it is technically\n\npossible to combine resources on the network to form a \"distributed\n\nsystem.\" A first step in this direction would be to use network\n\nresources to augment a special-purpose system connected at one of the\n\nnodes. The special-purpose system would serve as the vertex of the\n\ndistributed system, dynamically drawing on network resources to\n\nperform specific functions.\n\n\n\n\n\n\n\n\n\n                                                                [Page 4]\n\f\n     The TICCIT/CAI system is a good candidate for demonstrating the\n\nfeasibility of the concept of a distributed system. However, rather\n\nthan initially connecting TICCIT to the network, resources on the\n\nnetwork will first be used to demonstrate how they could augment the\n\ncapabilities of TICCIT\n\n     Task III is organized as three subtasks to demonstrate that the\n\nrange of curriculum material can be extended, to demonstrate that the\n\nTICCIT/CAI system can be supplemented with specialized CAI systems\n\nthat use AI techniques, and to demonstrate that TICCIT system resources\n\nand capabilities can be augmented by using computing and storage\n\nresources available on the network.\n\n     (a)  Demonstrate that the range of curriculum\n          material can be extended.\n\nThe range of curriculum material offered by the TICCIT/CAI system can\n\nbe extended by using network resources.  Two areas that were selected\n\nfor the demonstration are mathematics and computer science.\n\n     The Culler-Fried On-Line Graphics-Oriented system available on\n\nthe IBM 360/75 at the University of California at Santa Barbara (UCSB)\n\nwas selected for use in mathematics courses.  A collection of diverse\n\nsystems and languages will be selected to demonstrate how they can be\n\nincorporated in a computer science curriculum.\n\n     The following tasks are necessary for demonstrating that the\n\nrange of curriculum material can be extended:\n\n     *  learn the use and structure of the Culler Fried system.\n\n     *  use the Culler-Fried system over the network using an\n\n\n\n                                                                [Page 5]\n\f\nIMLAC graphics display terminal.\n\n     *  design sample courses for demonstration of the use of\n\n        the Culler-Fried system in a mathematics curriculum.\n\n     *  develop software to incorporate the use of the Culler-\n\n        Fried system in the sample courses and demonstrate.\n\n     *  prepare a sample computer science curriculum and demonstrate\n\n        how the wide range of systems on the network can be utilized\n\n        in a typical computer science curriculum.\n\n     *  determine and document the technical specifications required\n\n        for a TICCIT/CAI system interface.\n\n     (b)  Demonstrate that the TICCIT/CAI system can be supplemented\n          with specialized CAI systems that use AI techniques.\n\nThere are two network resources utilizing AI techniques that have been\n\napplied to computer assisted instruction tasks: SCHOLAR and LOGO.\n\nSCHOLAR is a mixed-initiative rather than a frame-oriented CAI system.\n\nLOGO is a LISP-based programming language designed to study whether\n\nnotions and skills of formal reasoning and problem-solving can be\n\ntaught. We will investigate if these systems can be used to supple-\n\nment the TICCIT system and, if possible, will demonstrate their use.\n\n     The following tasks are required:\n\n     *  investigate the use of SCHOLAR on the TENEX system\n\n        at BBN over the network.\n\n     *  investigate the use of LOGO and the \"turtle\" over the\n\n        network from the PDP-10 at MIT/AI and/or from TENEX at BBN.\n\n     *  demonstrate the use of the systems over the network.\n\n\n\n                                                                [Page 6]\n\f\n     *  determine and document the requirements for an interface\n\n        with the TICCIT system.\n\n     (c)  Demonstrate that TICCIT system resources and capabilities\n          can be augmented by using computing and storage resources\n          available on the network.\n\nIt should be possible for the TICCIT/CAI system to substantially in-\n\ncrease its capacity by using large data storage devices on the ARPANET\n\nfor storing student records and curriculum and by using some Host\n\ncomputer to run complex statistical analysis programs to analyze and\n\nevaluate student progress and course content.\n\n     In order to demonstrate that such a scheme is possible, the\n\nfollowing tasks are necessary:\n\n     *  determine format and requirements for curriculum\n\n        material and student records.\n\n     *  develop a method to store and retrieve data on a\n\n        demand basis.\n\n     *  select a Host on the network and develop software\n\n        for a demonstration.\n\n     *  determine and document requirements for an interface\n\n        with the TICCIT system.\n\n3.0  PROGRESS OF WORK\n\n     In this section the progress of the work associated with each\n\ntask is presented.  Both achievements and problems encountered are\n\ndiscussed.  The manpower expended thus far for each subtask is given\n\nin graphic form, together with a proposed schedule for completing\n\n\n\n\n                                                                [Page 7]\n\f\nthe work.\n\n3.3  Task III - Demonstrate Extensions to TICCIT System Capabilities\n     ---------------------------------------------------------------\n     That Are Possible by Drawing on ARPANET Resources\n     -------------------------------------------------\n\n     Many of the resources on the ARPANET were designed as stand\n\nalone systems not intended for use over the network nor for facile\n\ninterfacing with other systems.  Thus we have found that more work\n\nthan initially was estimated is needed to use the selected CAI-related\n\nsystems over the network.  Therefore we plan to fulfill the goals of\n\neach subtask by demonstrating the use of selected resources over the\n\nnetwork but will not attempt to interconnect the systems in any\n\nfashion during FY1972.  A proposal to investigate the notion of a\n\ndistributed CAI system using ARPANET resources is under preparation.\n\n     The status of our progress in using CAI-related resources over\n\nthe network is presented below.\n\n     (a)  Demonstrate that the range of curriculum material\n          can be extended.\n\nThe Culler-Fried (C-F) On-Line Graphics-Oriented system at UCSB was\n\nselected to demonstrate its use in mathematics curriculum.  The system\n\nhas been used successfully in a variety of courses at UCSB, including\n\nchemistry, mathematics, and economics(30,31,32,33,35).\n\n     The Culler-Fried system's normal mode of operation is with two\n\nkeyboards and a Tektronics graphics display device. The keys on the\n\nsecond keyboard are \"function\" keys; for example, by pressing a single\n\nkey the user can initiate complex actions such as displaying a plot\n\n\n\n\n                                                                [Page 8]\n\f\nof a convolution function(35). The system can also be used to provide\n\nonline access to the 360/75 system to remotely control the execution\n\nof programs. The latter service is currently available on the network\n\nthrough TELNET. Access to the system was made possible by defining a\n\nmapping from ASCII characters (sent as the \"network virtual terminal\")\n\nto characters expected by the OLS. Thus it is often necessary to type\n\na sequence of characters on a TTY-type device to invoke the action of\n\na single function key. Under the current implementation, graphics\n\noutput to the network is suppressed.\n\n     We plan to demonstrate the use of the C-F system on an IMLAC\n\ngraphics device attached to our TIP. During the first phase of our\n\nimplementation, we will not simulate the C-F function keyboard but\n\nwill enter our graphics input using the procedures defined for use\n\nvia TELNET. For output, UCSB agreed to provide a new output processor\n\nwhich will no longer suppress graphics output, but will map it into\n\nthe remote graphics capabilities as provided by IMLAC (Figure 3).\n\nSuch a system was implemented in early February but due to the\n\ncharacter-oriented nature of the IMLAC device available to us, the\n\nresolution was unsatisfactory. We have now defined a low-level\n\ngraphics protocol.  UCSB has agreed to send graphics output to us\n\nusing this protocol.  We have had to program new processes for the\n\nIMLAC and are now debugging the new programs.  Due to the limited\n\ncore available on the particular IMLAC that we are using (4K 16 bit\n\nwords) which limits the size of internal display lists, we will not\n\n\n\n\n                                                                [Page 9]\n\f\nbe able to plot very complex graphs.  However, the software being\n\ndeveloped is general and can be moved to an IMLAC with larger core\n\ncapacity.  We currently send alphanumeric input from a TTY or 3300\n\nand divert the graphics output to the IMLAC.\n\n     When we can access the Culler-Fried system for graphics output\n\nsuccessfully via the network, we plan to modify the IMLAC programs to\n\npermit alpha input from the IMLAC keyboard.  We also plan to investi-\n\ngate the possibility of attaching a function keyboard to the IMLAC.\n\nLastly, we intend to investigate the use of TICCIT display devices\n\nwith the TIP.  A sample mathematics course will be designed to assist\n\nin demonstration of the CAI applications of the Culler-Fried system.\n\nWe are currently studying the past uses of the system in a CAI mode.\n\n     We have not yet investigated computer science curriculums.  We\n\nplan to get inputs from the ACM Committee on Computer Science Educa-\n\ntion(36,37) and to visit universities in the Washington area.  This\n\nactivity is scheduled to commence in April.\n\n     (b)  Demonstrate that the TICCIT/CAI system can be supplemented\n          with specialized CAI systems that use AI techniques.\n\nThe two network resources selected for demonstration are SCHOLAR and\n\nLOGO.  Both systems are implemented in LISP and are currently avail-\n\nable over the network on the TENEX system at BBN.  A version of LOGO\n\nwith a \"display turtle\" is available on the PDP-10 at MIT/AI, however,\n\nthey do not yet have their NCP implemented and thus are not currently\n\naccessible over the network. There is also a version of LOGO on the\n\nTENEX system at SRI/AI. They also are not currently connected to the\n\n\n\n                                                               [Page 10]\n\f\nnetwork and we have not investigated their version.\n\n     We used SCHOLAR over the network in January with a data base\n\nprovided by BBN to review the knowledge of a student in the geography\n\nof South America(38,39).\n\n     The LOGO system at MIT/AI is perhaps the most impressive system\n\nfor use in a demonstration due to the availability of a \"display\n\nturtle\". The system is currently being used remotely by the Bridge\n\nSchool in Lexington, Massachusetts. We visited the school and observed\n\na class in session. We also attended an undergraduate class in Applied\n\nMath at MIT that was learning turtle geometry.\n\n     Seymour Papert of MIT expects the MIT/AI PDP-10 to be up on the\n\nnetwork by the middle of April(40). He has agreed to modify his system\n\nto interface with our IMLAC via the network using the low-level graphics\n\nprotocol that we specified. He has developed many courses and games\n\nusing LOGO(41,42,43,44,45) that provide sufficient material for use\n\nin demonstrating the system. A real turtle may be available in early\n\nsummer to run from our TIP.\n\n     We have used the LOGO system at BBN via the network. Since the\n\nsystem is continually being modified, Dr. Feurzeig agreed to put a\n\nclean version on the RAND TENEX for our use. BBN's LOGO does not\n\ncurrently have a display turtle, however, they are willing to imple-\n\nment one. Even without the display turtle, courseware that has been\n\ndeveloped for teaching mathematics provides sufficient material for\n\nus to work from(46,47). A radio controlled turtle has been designed\n\n\n\n\n                                                               [Page 11]\n\f\nat BBN. It may be possible to obtain the specifications and have one\n\nbuilt at MITRE to run from our TIP.\n\n     (c)  Demonstrate that TICCIT system resources and capabilities\n          can be augmented by using computing and storage resources\n          available on the network.\n\nWork has not begun on this subtask.  However, much of the software\n\ndeveloped for the data sharing experiments can be used to store and\n\nretrieve data on a demand basis.\n\n     We have received preliminary curriculum material from TICCIT\n\npersonnel. We expect to interact with them to determine more speci-\n\nfically the format and requirements for curriculum material and student\n\nrecords.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                               [Page 12]\n\f\nREFERENCES\n\n30.  Ewig, C. S., Gerig, J. T., and Harris, D. P., \"An Interactive\n     On-Line Computing System and Its Use in Chemistry Education\",\n     Department of Chemistry, UCSB.\n\n31.  Howard, J. A., and Wood, R. C., \"Computer Assisted Instruction\n     in Engineering Using On-Line Computation\", _Journal_of_Engineering_\n     _Education_.\n\n32.  Sullivan, J. J., \"Computer Based Instruction in Economics: A\n     Report on Facilities and Applications at UCSB\", paper presented\n     at a conference on Computers in Undergraduate Curricula,\n     University of Iowa, Iowa City, Iowa, 1970.\n\n33.  Wood, R. C., and Bruch, J. C., Jr., \"Teaching Complex Variable\n     with an Interactive Computer System\", article submitted for\n     review and publication in _IEEE_Transactions_on_Education_, July\n     1970.\n\n34.  Wood, R. C., and Howard, J. A., \"An Interactive Computer Class-\n     room, _Educational_Research_and_Methods_Journal_, Vol. 2, No. 4,\n     June 1970, pp. 29-31.\n\n35.  \"UCSB On-Line System Manual\", NIC #6502, September 1971.\n\n36.  \"Curriculum 68\", _Communications_of_the_ACM_. Vol. 11. No. 3.\n     March 1968, pp. 151-197.\n\n37.  Teichroew, D., ed., \"Education Related to the Use of Computers\n     in Organizations\", _Communications_of_the_ACM_, Vol. 14, No. 8,\n     September 1971, pp. 573-588.\n\n38.  Carbonell, Jaime R., \"AI in CAI: An Artificial Intelligence\n     Approach to Computer-Assisted Instruction\", _IEEE_Transactions_\n     _on_Man-Machine_Systems_, Vol. MMS-11, No. 4, December 1970,\n     pp. 190-202.\n\n39.  Carbonell, Jaime R., \"Mixed-Initiative Man-Computer Instructional\n     Dialogues\", BBN Report No. 1971, 31 May 1970.\n\n40.  Williams, R. W., \"LOGO Manual\", MIT/AI, Draft memo, 9 April 1971.\n\n41.  Papert, S., and Solomon, C., \"Twenty Things To Do with a Computer\",\n     MIT Artificial Intelligence Laboratory internal report, June 1971.\n\n42.  Papert, S., \"A Computer Laboratory for Elementary Schools\",\n     MIT/AI Memo No. 246, LOGO Memo No. 1, October 1971.\n\n\n\n                                                               [Page 13]\n\f\n43.  Papert, S., \"Teaching Children Thinking\", MIT/AI Memo No. 247,\n\n     LOGO Memo No. 2, October 1971.\n\n44.  Papert, S., \"Teaching Children to be Mathematicians vs. Teaching\n     About Mathematics\", MIT/AI Memo No. 249, LOGO Memo No. 4,\n     July 1971.\n\n45.  Papert, S., and Solomon, C., \"NIM: A Game-Playing Program\",\n     MIT/AI Memo No. 254, LOGO Memo No. 5, January 1970.\n\n46.  INFORMATION PROCESSING MODELS AND COMPUTER AIDS FOR HUMAN\n     PERFORMANCE\n\n     Final Report, Section 3: Feurzeig, W., and Lukas, G., \"Program-\n     ming Languages as a Tool for Cognitive Research\", BBN Report\n     No. 2187, 30 June 1971.\n\n47.  PROGRAMMING-LANGUAGES AS A CONCEPTUAL FRAMEWORK FOR TEACHING\n     MATHEMATICS, BBN Report No. 2165, 30 June 1971.\n\n          Volume 1, Part 1: Feurzeig, W., Lukas, G., \"An Introductory\n             LOGO Teaching Sequence\".\n\n             Part 2: Lukas, J. D., and Lukas, G., \"LOGO\n                Teaching Sequence on Logic\".\n\n             Part 3: Feurzeig, W., Lukas, G., and Grant, R.,\n                \"LOGO Reference Manual\".\n\n          Volume 2, Part 1: Grant, P., Falflick, P., and Feurzeig, W.,\n             \"LOGO Teaching Sequences on Numbers\".\n\n             Part 2: Feurzeig, W., Lukas, G., and Grant, R.,\n                \"LOGO Functions and Equations\".\n\n          Volume 3, Part 1: Lukas, G., Falflick, P., and Feurzeig, W.,\n             \"LOGO Strategy in Problem-Solving\".\n\n             Part 2: Lukas, G., and Feurzeig, W., \"LOGO\n                Story Problems in Algebra\".\n\n          Volume 4: Weiner, W. B., Morgan, C. R., and Feurzeig, W.,\n             \"The LOGO Processor, A Guide for System Programmers\".\n\n\n\n\n\n\n\n                                                               [Page 14]\n"
}