{
  "series": "Request for Comments",
  "number": "126",
  "howpublished": "RFC 126",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0126",
  "url": "https://www.rfc-editor.org/info/rfc126",
  "title": "Graphics Facilities at Ames Research Center",
  "pagetotal": "1",
  "year": "1971",
  "month": "apr",
  "day": "1",
  "body": "\n\n\n\n\n\nNetwork Working Group                                     John McConnell\nRequest for Comments: 126                           Ames Research Center\nCategory: D.6                                                 April 1971\n\n            Ames Graphics Facilities at Ames Research Center\n\n   This note is intended as a response to an RFC which suggested that\n   nodes describe their graphics environment. The following graphics\n   facilites are now at Ames for the IBM 360/67 TSS:\n\n      a.   An SC 4020 off line microfilm system.\n      b.   Calcomp plotters.\n      c.   ARDS storage tube CRTs.\n      d.   IMLAC PDS-1 refresh CRTs.\n      e.   One IBM 2250 CRT.\n\n   Devices which will be in use in the near future are:\n\n      a.   An Evans and Sutherland LDS-2 system.\n      b.   Hazeltine alphanumeric CRTs.\n\n   Because of the diverse nature of the devices and the varying software\n   support provided by the manafacturers, work has been undertaken to\n   provide a device independent package. This package is currently being\n   implemented. The basic entity is a device independent intermediate\n   language which describes the picture to be displayed. When a device\n   is selected, the intermediate language is converted to specific\n   device orders.\n\n   Other features include the definition and storage of subpictures for\n   later construction of more complex pictures. An interface has been\n   specified so that graphic data sets can be transmitted to other\n   installations on the TSS network.\n\n   A note to those who plan to use the ILLIAC IV when it becomes a\n   functioning node at Ames. I would like information concerning the\n   graphics environment at your sites and any thoughts you have on how\n   you will be using graphics with the ILLIAC IV.\n\n\n         [ This RFC was put into machine readable form for entry ]\n         [ into the online RFC archives by Andrew Crawford 4/97 ]\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\n"
}