{
  "series": "Request for Comments",
  "number": "446",
  "howpublished": "RFC 446",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0446",
  "url": "https://www.rfc-editor.org/info/rfc446",
  "title": "Proposal to consider a network program resource notebook",
  "pagetotal": "2",
  "year": "1973",
  "month": "jan",
  "body": "\n\n\n\n\n\nNetwork Working Group                                   L. Peter Deutsch\nRFC # 446                                               SRI\nNIC # 14068                                             January 25, 1973\n\n\n        Proposal to consider a Network Program Resource Notebook\n\n\nThe recent requests by Jean Iseli of MITRE for information about all\nresources of type X available on the network (where X=macro processors,\ndata management systems, and electromagnetic wave analysis programs)\nlead me to suggest that the NIC be a repository for the replies.\n\n    Since the exchange of knowledge and techniques (not to mention\n    programs) is a central motivating factor in the development of the\n    ARPANET, it seems only reasonable that we begin to systematize the\n    process now that someone (MITRE and the government agencies on whose\n    behalf it is acting) feels there is enough information to be worth\n    collecting.\n\n    Obviously, the network community should be in a position to profit\n    from such compilation at least as much as outside agencies.\n\nThe NIC already has catalog and keyword capabilities for the Journal and\na large index of computer-related documents which are not on-line.  I\nwould presume that extending this system to include programs and\ndocumentation would not be a major task and would probably bring\nimmediate payoffs in terms of increased effectiveness of research sites.\n\nThis suggestion does not touch on the important larger issue, namely,\nwhat obligations does the network community have to act as a service and\ninformation resource to the outside world (government agencies in\nparticular) as opposed to its presumed major function of learning about\nhow to build and use computer networks and its actual major function of\nresearch in many areas of computing which have nothing to do with\nnetworks at all.\n\n    I feel that the confusion between the ARPANET as a service network\n    and the ARPANET as an experiment in the line of network research,\n    and the frustrations and communication failures resulting from\n    superimposing network responsibilities on top of existing research\n    projects, have not received adequate contemplation by the network\n    community.\n\n\n\n\n\n\n\n\nDeutsch                                                         [Page 1]\n\f\nRFC 446            Network Program Resource Notebook        January 1973\n\n\n    I also feel that the ambiguous status of the network has lead to a\n    sharp division between research/maintenance sites and government\n    agency user sites, a situation which only can exacerbate my own\n    feeling that to some extent the former are being exploited for non-\n    research purposes in a manner that has been fairly rare in the\n    history or ARPA/IPT.\n\n\n\n\n\n\n\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDeutsch                                                         [Page 2]\n\f\n"
}