{
  "series": "Request for Comments",
  "number": "340",
  "howpublished": "RFC 340",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0340",
  "url": "https://www.rfc-editor.org/info/rfc340",
  "title": "Proposed Telnet Changes",
  "pagetotal": "2",
  "year": "1972",
  "month": "may",
  "body": "\n\n\n\n\n\nNetwork Working Group                                Tom O'Sullivan\nRequest for Comments:  340                           Raytheon Company\nNIC          9933                                    Sudbury, Mass.\nCategories:  Telnet\nReferences:  RFC 328                                 15 May 1972\n\n\n                        PROPOSED TELNET CHANGES\n\n   The proposed change to the TELNET protocol calling for one standard\nprotocol and dropping the idea of minimum implementation seems\nreasonable at this time.\n\n   I suggest that both Data Types and Hide Your Input be kept for the\nfollowing reasons:\n\n   Data Types:\n\nThe objection stating that switching out of ASCII results in an\nirreversible change and loss of control can be met by requiring other\ncodes to provide to a return to ASCII.  Each other code may have its\nown return code, however, it may not always be employed.  Other codes\nare important for alphanumeric terminals that have special devices\nattached.  Several potential cases can be cited:\n\n   1.  Cal comp plotter attached to a teletype has logic permitting a\n       program to turn the plotter on and off.  When operating I believe\n       it uses an 8 bit code which could conflict with Telnet signals.\n\n   2.  Numerically controlled machines, either controlled from a user\n       terminal or code prepared by a HOST computer to be punched on the\n       paper tape punch at a teletype way require the use of an arbitrary\n       8 bit code.\n\n   3.  Experiments controlled from alphanumeric terminal or sensor data\n       collected through a cal-comp like connection may require the use\n       of a full 8 bit code.\n\nIn these cases a transparent data type with a provision for a return\nto ASCII mode seems desirable.\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nHide Your Input:\n\nAs more and more use of data base systems in the network is\nconsidered, the need for and importance of using access keys,\npasswords, etc. grows.  The fact that it is difficult to select the\nlength of input to be hidden is not a persuasive argument.  Potential\nsolutions seem to exist, e.g. the protocol could provide for accepting\nlength statements from the user program, data base system, operating\nsystem, etc. and in default of this, use a default length representing\nthe server system expected optimum length.\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by BBN Corp. under the   ]\n       [ direction of Alex McKenzie.                   12/96   ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}