{
  "series": "Request for Comments",
  "number": "34",
  "howpublished": "RFC 34",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0034",
  "url": "https://www.rfc-editor.org/info/rfc34",
  "title": "Some Brief Preliminary Notes on the Augmentation Research Center Clock",
  "pagetotal": "2",
  "year": "1970",
  "month": "feb",
  "body": "\n\n\n\n\n\nNetwork Working Group                            Bill English   SRI/ARC\nRequest for Comments No. 34                      26 February 1970\n\n\nSOME BRIEF PRELIMINARY NOTES ON THE ARC CLOCK\n\nThe ARC clock system provides a time reference that is written into the\ncore memory of the XDS 940 Computer. There are two types of time\ninformation available--absolute and relative.\n\nThe absolute time is written into two adjacent words of core with the\nfollowing format:\n\n   First word --\n\n      Bits 0 thru 7 contain the month code in straight binary with a\n      range of 1 to 12\n\n      Bits 8 thru 15 contain the day code in straight binary with a\n      range of 1 to 31\n\n      Bits 16 thru 23 contain the year code in straight binary with\n      range of 0 to 99\n\n   Second word --\n\n      Bits 00 thru 7 contain the hour code written in straight binary\n      with a range of 0 to 23\n\n      Bits 8 thru 15 contain the minute code written in straight binary\n      with a range of 0 to 60\n\n      Bits 16 thru 23 contain the second code written in straight binary\n      with range ofr 0 to 60\n\nThese 2 words are written once each second.  It is anticipated that the\naccuracy of the initial setting will be on the order of 1 second, as\nreferred to WWV, and that the oscillator drift rate will not account for\nan accumlated error of more than 1 second every 250 days.  The\noscillator and clock are provided with standby power in order to\nmaintain the accuracy of the system.  Because of variable delays in time\nrequired to obtain access to the 940 core memory, it is anticipated that\nthe short-term accuracy will be on the order of 10 to 20 microseconds.\n\nThe relative time, which is written into one word of core memory, is\nsimply the contents of a 24 bit binary accumulator.  The rate at which\nthe accumulator is updated can be chosen to be either once very 100\nmicro seconds or once every millisecond.  In either case the core\n\n\n\n                                                                [Page 1]\n\f\nRFC 34              Prelimary Notes on the ARC Clock       February 1970\n\n\nlocation is written each time the accumulator is updated.  As above the\nshort-term accuracy will be about 10 to 20 microseconds and the long-\nterm accuracy will be the equivalent of one second every 250 days.\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Katsunori Tanaka 1/98 ]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}