{
  "series": "Request for Comments",
  "number": "222",
  "howpublished": "RFC 222",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0222",
  "url": "https://www.rfc-editor.org/info/rfc222",
  "title": "Subject: System programmer's workshop",
  "pagetotal": "2",
  "year": "1971",
  "month": "sep",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        R. Metcalfe\nRequest for Comments: 222                                    Project MAC\nNIC: 7621                                              13 September 1971\n\n\n   As described in RFC's #207 and #212, the next meeting of the ARPA\n   Computer Network Working Group (NWG) will be held at MIT Project MAC\n   in Cambridge, Massachusetts, October 10-14, 1971.\n\n   The first phase of the NWG meeting is to be a workshop for a\n   representative group of system programmers from those sites with\n   operational TELNET interfaces.  From noon, Sunday, October 10, until\n   sometime late Monday evening, teams of workshop participants will hit\n   the ARPA network from MAC consoles in an intensive effort to study\n   its operational characteristics and to work on any remaining trouble\n   spots in protocols and their implementations.\n\n   Although the NWG meeting is geared for heavy attendance, our\n   facilities and objectives make it important that no more than a dozen\n   system programmers be present for the grueling workshop sessions\n   planned.  These system programmers should be from sites with\n   operational TELNET interfaces (user and/or server) and should have a\n   working knowledge of protocols, their own NCP's, and TELNET\n   implementations.  Sites wishing to send a system programmer should\n   leave his name and address with Anne Speare at (617) 864-6900 x1458.\n\n   In preparation for the workshop, we are working on documentation\n   describing our user TELNET and a site-use scenario booklet to be used\n   at the workshop in exercising various systems.  It is our intention\n   to establish a pattern of routine usage with as many sites as\n   possible prior to the workshop.  In developing the site-use scenario\n   booklet, we will be looking for advice and comment from participating\n   hosts.\n\n   Because the use of computers with operational network protocols is\n   central to the success of the workshop, we are working hard to bring\n   our developing system into a period of stability and are making\n   special arrangements for on-site hardware repair personnel.  To the\n   extent that participating sites can make similar preparations, the\n   chances for a successful workshop will be improved.\n\n   We are hoping that knowledgeable network people will be on call at\n   the various sites during the workshop so that there will be some hope\n   of fixing minor implementation problems on the fly.\n\n   We will begin the workshop at noon on Sunday, October 10 with a brief\n   strategy meeting in Project MAC's second floor conference room, #217,\n   545 Technology Square, Cambridge, Massachusetts.  Our first mission\n\n\n\nMetcalfe                                                        [Page 1]\n\f\nRFC 220              System Programmer's Workshop      13 September 1971\n\n\n   will be to establish and exercise all possible TELNET connections\n   with MAC's PDP-10 (Host 70.).  When this first check-off is complete,\n   we will meet again to discuss difficulties and to regroup for our\n   second mission.  By appropriately nesting TELNET's, we will pair up\n   to systematically fill in the matrix of possible TELNET connections.\n\n   During the workshop we expect to be finding and fixing implementation\n   problems, discussing protocol, and getting an extremely valuable\n   introduction to the use of a wide variety of hosts.  Our experience\n   in the workshop will be an important input to the NWG sessions to\n   follow.  In particular, we are to generate specific reports for the\n   protocol review and status sessions.\n\n   See you then.\n\n   Bob Metcalfe\n\n   (617) 864-6900\n    x1429 Office\n    x1458 Secretary\n    x2910 Computer Room\n\n   Room 203\n   Project MAC\n   545 Technology Square\n   Cambridge, Massachusetts 02139\n\n\n         [ This RFC was put into machine readable form for entry ]\n             [ into the online RFC archives by Ryan Kato 6/01]\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMetcalfe                                                        [Page 2]\n\f\n"
}