{
  "series": "Request for Comments",
  "number": "406",
  "howpublished": "RFC 406",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0406",
  "url": "https://www.rfc-editor.org/info/rfc406",
  "title": "Scheduled IMP Software Releases",
  "pagetotal": "2",
  "year": "1972",
  "month": "oct",
  "body": "\n\n\n\n\n\nNetwork Working Group                        John M. McQuillan\nRequest for Comments # 406                   Bolt Beranek and Newman\nNIC # 12111                                  10 October 1972\nCategories B.1\nUpdates RFC # 381\n\n\n                    Scheduled IMP Software Releases\n                    -------------------------------\n\n\n     This note is a reminder that the procedures suggested in\nRFC # 381 for scheduling IMP software maintenance have now\nbeen in effect for a period of about two months.  Two points\napparently require re-emphasis:\n\n\n     1)   We reserve the hour from 7 to 8 a.m. eastern time\nevery Tuesday as the time when IMPs can be reloaded.  We will\nprobably not use this period every Tuesday, but we do reserve\nthis period every Tuesday.  The software maintenance time period\nis in addition to the hardware preventive maintenance scheduled\nat each site.\n\n\n     2)   We now send an IMP - Going - Down message to all\nthe Hosts at the site which contains information on the time\nthat the IMP is going down, the expected duration, and the\nreason.  We try to send out this message an hour before soft-\nware releases, and five to ten minutes before scheduled pre-\nventive maintenance.  Further, we will also notify the Hosts\nat a site, whenever possible, when it is necessary to stop the\nIMP on an unscheduled basis.  Finally, 30 seconds before the\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 1]\n\f\nIMP goes down, a second IMP - Going - Down message will be\nsent to the Hosts informing them that the IMP is going down\nimmediately.  The format of the IMP - Going - Down message\nis as follows:\n\nbits 1 - 4  -  all zero\n\nbits 5 - 8  -  0010\n\nbits 9 - 16 -  all zero\n\nbits 17 - 32 -  coded as follows:\n\n\n          All bits zero - going down in 30 seconds\n\n\n\n          Bits 17, 18 = 01 - scheduled hardware PM\n\n          Bits 17, 18 = 10 - scheduled software reload\n\n          Bits 17, 18 = 11 - emergency reload on restart\n\n\n\n          Bits 19 - 22 - how soon the IMP is going down,\n                         in 5 minute units.\n\n\n\n          Bits 23 - 32 - how long the IMP will be down, in\n                         5 minute units.\n\n\n\n\n\n    [ This RFC was put into machine readable form for entry ]\n    [ into the online RFC archives by BBN Corp. under the   ]\n    [ direction of Alex McKenzie.                      1/97 ]\n\n\n\n\n\n\n\n\n\n\n                                                                [Page 2]\n\f\n"
}