{
  "series": "Request for Comments",
  "number": "488",
  "howpublished": "RFC 488",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0488",
  "url": "https://www.rfc-editor.org/info/rfc488",
  "title": "NLS classes at network sites",
  "pagetotal": "2",
  "year": "1973",
  "month": "mar",
  "body": "\n\n\n\n\n\nNetwork Working Group                                   Marilyn Auerbach\nRFC # 488                                               SRI-ARC\nNIC # 15266                                             March 23, 1973\n\n\n                      NLS Classes at Network Sites\n\n\nPurpose of this RFC\n\nNetwork users have expressed interest in holding NLS classes at sites on\nthe Network, instead of at SRI-ARC.  This RFC solicits comments from the\nNetwork community on the desirability of doing on-site classes.\n\nA brief outline of course contents is included at the end of this RFC,\ntogether with some logistic information which we feel is necessary to\nconducting a useful class.\n\nPlease review this information, and let us know whether such a class\nwould be useful if conducted at or near your site.  We are eager to\nparticipate in this way, because we know it will be useful to us to have\nthe benefit of consultation with experienced Network users.\n\nAs we have to schedule our people's time in advance, we are tentatively\nconsidering making trips to Washington D.C. during the first week of\nMay, and to Boston during the first week of June, for the purpose of\nconducting classes.  We will consider other arrangements, however,\nif they would be more satisfactory.\n\nPlease respond by April 15 to Marilyn Auerbach (MFA) at the NIC\n(415)326-6200 extension 3722.\n\n\nNLS Class Information\n\nThe class is a comprehensive introduction to the use of NLS over the\nNetwork.  The class generally runs for two to three days, depending on\nthe composition and interests of the participants.\n\nFor purposes of planning, the following information will be useful:\n\n    1.  We have found the optimum class size to be six, with an upper\n    limit of ten.\n\n    2.  We need a room large enough to hold the number of students, with\n    a teletype-type terminal and appropriate connections for each\n    student, a flip-chart stand and a large blackboard.\n\n\n\n\nAuerbach                                                        [Page 1]\n\f\nRFC 488               NLS Classes at Network Sites            March 1973\n\n\nClass Outline - TNLS Course\n\nWe have held NLS classes approximately a dozen times.  In all, nearly a\nhundred people have attended these classes.  While we feel that the\ntraining has been helpful, we also recognize that teaching the class at\nSRI-ARC tends to overlook special problems of working through the\nNetwork and special interests of other sites.\n\nThe people who conduct the class are experienced in working out\nprocedures for using NLS in work environments.  Therefore, please accept\nthe outline below as a flexible one, one that can be tailored to fit\nparticular applications or needs.\n\nPart I:  Elementary Concepts\n\n    1.  Introduction to NLS\n    2.  Sending a Journal Message\n    3.  TENEX/NLS Interfaces\n    4.  Basic File Manipulation\n    5.  Basic Text Handling\n    6.  Addressing Data Within a Statement\n    7.  Elementary Text-Editing\n\nPart II:  Entering and Using Information\n\n    1.  NLS Data Structures\n    2.  Structure Editing and Text Editing\n    3.  \"Viewspecs\":  Controlling the Appearance of On-Line Output\n    4.  Submission and Retrieval of Journal Items\n    5.  \"Partial Copies\":  File Updating\n    6.  Use of the NIC On-Line:  \"LOCATOR\" and \"NIC/QUERY\"\n    7.  \"Strucrels\":  Relative Data and Statement Addressing\n    8.  \"Directives\":  Controlling the Appearance of Off-Line Output\n    9.   Adjusting NLS Control Characters to Your Terminal\n\nPart III:  Sorting and Searching\n\n    1.  Sort and Merge\n    2.  Content analyses\n\n\n\n       [ This RFC was put into machine readable form for entry ]\n       [ into the online RFC archives by Alex McKenzie with    ]\n       [ support from GTE, formerly BBN Corp.             9/99 ]\n\n\n\n\n\n\nAuerbach                                                        [Page 2]\n\f\n"
}