{
  "series": "Request for Comments",
  "number": "495",
  "howpublished": "RFC 495",
  "publisher": "RFC Editor",
  "doi": "10.17487/RFC0495",
  "url": "https://www.rfc-editor.org/info/rfc495",
  "title": "Telnet Protocol specifications",
  "pagetotal": "2",
  "year": "1973",
  "month": "may",
  "body": "\n\n\n\n\n\nNetwork Working Group                                        A. McKenzie\nRequest for Comments: 495                                        BBN-NET\nNIC #15371                                                    1 May 1973\nCategories: TELNET, Protocols\nReferences: RFCs 318, 435; NIC 7104\n\n\n                     TELNET Protocol Specification\n\nFollowing much discussion of TELNET via the RFC series, an open meeting\nwas held at UCLA on 5 March to formulate a new specification for the\nTELNET Protocol.  Two attached documents (TELNET Protocol Specification,\nNIC #15372, and TELNET Option Specifications, NIC #15373) report the\nresults of that meeting, which was attended by: Alex McKenzie, BBN-NET,\nco-chairman; Jon Postel, UCLA-NMC, co-chairman; Bob Braden, UCLA-CCN;\nVint Cerf, Stanford University; Bernie Cosell, BBN-NET; Dave Crocker,\nUCLA-NMC; Steve Crocker, ARPA; John Davidson, Univ. of Hawaii; Gary\nGrossman, Univ. of Illinois; Bob Merryman, UCSD; Lou Nelson, UCLA-NMC;\nMike Padlipsky, MIT-MULTICS: Milt Reese, FNW; Bob Thomas, BBN-TENEX;\nSteve Wolfe, UCLA-CCN.\n\n\nThe two attached specifications referenced above have been reviewed by\nthe meeting attendees, and should be viewed as the \"official\" TELNET\nProtocol (subject to the implementation schedule given below).\nNevertheless, these documents are still subject to minor revisions and\nany pertinent comments should be addressed to me at the NIC as AAM, or\nby mail at:\n\n                           Alex McKenzie\n                           Bolt Beranek and Newman Inc.\n                           50 Moulton Street\n                           Cambridge, Ma. 02138\n\n   There are two key dates for a phasing in of the new protocol:  the\n   date when sites should feel free to send the \"new\" form of TELNET\n   commands and special codes without expecting to receive \"error\"\n   responses, and the date when sites may remove the code which\n   processes the \"old\" form of TELNET commands.  Between these two\n   dates, sites may gradually implement and test the \"interpreter\" for\n   the new commands.  It was the sense of the meeting that appropriate\n   lead times to these two dates were about 60 and 260 days.\n   Accordingly, these two dates are hereby established as 1 July 1973\n   and 1 January 1974.\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 1]\n\f\nRFC 495              TELNET Protocol Specification            1 May 1973\n\n\n   I have also attached specifications for TELNET options which allow\n   negotiation of:\n\n            o binary transmission\n            o echoing\n            o reconnection\n            o suppression of \"Go Ahead\"\n            o approximate message size\n            o use of a \"timing mark\"\n            o discussion of status\n            o extension of option code set\n\n   These specifications have been prepared by Dave Walden (BBN-NET) with\n   the help of Bernie Cosell, Ray Tomlinson (BBN-TENEX) and Bob Thomas;\n   by Jerry Burchfiel (BBN-TENEX); and by David Crocker (ULCA-NMC).  It\n   appears that these options cover most of the capabilities of the\n   current version of TELNET, with the exception of \"Hide Your Input.\"\n   Dave Walden has also promised to specify the following options in the\n   near future:\n\n            o NVT printer line width negotiation\n            o NVT printer page size negotiation\n            o negotiation of the mapping between the line terminator\n              character available on a physical terminal (e.g., LF,\n              CR, NL) and the NVT characters to be transmitted\n              (e.g., CR NUL, LF, CR LF).\n\n   Dave has also announced his intent to seek collaboration with\n   Gary Grossman, Bob Braden, and perhaps others in defining an\n   EBCDIC option.  The announcement of intent to specify these\n   options should, of course, be seen as useful information rather\n   than as the granting of an \"exclusive right\" to Dave, or any\n   other author.\n\n   I gratefully acknowledge the assistance of Bernie Cosell\n   in the preparation of the protocol specification.\n\n   AAM/jm\n   Attachments\n\n\n       [ This RFC was put into machine readable form for entry ]\n        [ into the online RFC archives by Gottfried Janik 4/98 ]\n\n\n\n\n\n\n\n\nMcKenzie                                                        [Page 2]\n\f\n"
}